<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Fotos bearbeiten</h2>

<p>Mit der File Station k&ouml;nnen Sie Fotos mit webbasierten externen Fotobearbeitungsprogrammen z.&nbsp;B. Pixlr Editor oder Pixlr Express bearbeiten.</p>
<h4>So bearbeiten Sie ein Foto mit einem webbasierten Fotobearbeitungsprogramm:</h4>

<ol>
<li>Suchen Sie den Ordner, in dem sich das Foto befindet.</li>
<li>Klicken Sie mit der rechten Maustaste auf das Foto, und w&auml;hlen Sie <b>In Pixlr Editor bearbeiten</b> oder <b>In Pixlr Express bearbeiten</b>.<ul><span class="note_head">Hinweis: </span><li>Pixlr Editor unterst&uuml;tzt die folgenden Formate: jpg, gif, png, psd, pxd (Pixlr-Schichtbild)</li>
<li>Pixlr Express unterst&uuml;tzt die folgenden Formate: jpg, gif, png</li>
</ul>
</li>
<li>Der ausgew&auml;hlte Foto-Editor wird in einem neuen Browser-Fenster ge&ouml;ffnet. Das Foto wird sofort angezeigt, und Sie k&ouml;nnen es mit den zur Verf&uuml;gung gestellten Werkzeugen bearbeiten.</li>
<li>Abschlie&szlig;end speichern Sie das fertig bearbeitete Foto wie folgt.</li>
<ul>
<li>In Pixlr Express: Klicken Sie auf <b>Fertig</b>, um das Foto im urspr&uuml;nglichen Format an seinem urspr&uuml;nglichen Speicherort auf DiskStation zu speichern.</li>
<li>In Pixlr Editor: W&auml;hlen Sie <b>Datei</b> &gt; <b>Speichern</b> und dann den Speicherort (dies kann der urspr&uuml;ngliche Speicherort Ihres Fotos auf DiskStation sein, Ihr Computer oder ein soziales Netzwerk) im Feld auf der linken Seite aus. W&auml;hlen Sie anschlie&szlig;end ggf. einen neuen Namen oder ein neues Format, und klicken Sie dann auf <b>OK</b>.</li>
</ul>
</ol>
<p><span class="note_head">Hinweis: </span>Vergewissern Sie sich vor der Bearbeitung Ihrer Fotos mit einem der webbasierten Fotobearbeitungsprogramme, dass Ihr DiskStation erfolgreich eine externe IP-Adresse abgerufen hat (unter <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <strong>Externer Zugriff</strong> &gt; <b>DDNS</b> oder <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Netzwerk</b> &gt; <b>Netzwerk-Schnittstelle</b> &gt; <b>PPPoE</b>, abh&auml;ngig von der Netzwerkkonfiguration). Wenn sich Ihr DiskStation hinter einem Router befindet, achten Sie bitte darauf, dass Sie die Portweiterleitungsregel f&uuml;r DSM unter <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <strong>Externer Zugriff</strong> &gt; <b>Routerkonfiguration</b> eingerichtet haben. Wenn Sie immer noch Schwierigkeiten beim &Ouml;ffnen der Fotobearbeitungsprogramme haben, geben Sie den Router-Port f&uuml;r DSM unter <b>Hauptmen&uuml;</b> &gt; <b>Systemsteuerung</b> &gt; <b>Externer Zugriff</b> &gt; <b>Erweitert</b> an.</p>
</body>
</html>
