<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Text-Editor</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Text-Editor</h1>
<p>Text-Editor ist ein sehr vielseitiger Text- und Code-Editor, mit dem Sie schnell auf Textdateien oder Codes auf Ihrem DiskStation direkt von einem Webbrowser aus zugreifen und sie bearbeiten k&ouml;nnen.</p>

<h3>Dateiverwaltung</h3>
<h4>So werden neue Dateien erstellt:</h4> 
<p>Klicken Sie auf <b>Datei</b> und w&auml;hlen Sie <b>Neu</b> aus. Eine neue leere Registerkarte mit dem Titel <b>New Document.txt</b> erscheint.</p>

<h4>So werden Dateien vom Text-Editor aus ge&ouml;ffnet:</h4> 
<p>Klicken Sie einfach auf <b>Datei</b>, und w&auml;hlen Sie <b>&Ouml;ffnen</b> aus. Ein Dialog wird angezeigt, in dem Sie eine Datei mit einer bestimmten Zeichenkodierung ausw&auml;hlen k&ouml;nnen, die in einer Registerkarte ge&ouml;ffnet werden soll. Wenn die Datei bereits ge&ouml;ffnet ist, zeigt der Text-Editor die Datei in ihrem aktuellen Zustand.</p> 

<h4>So werden Dateien von File Station aus ge&ouml;ffnet:</h4> 
<p>Rechtsklicken Sie in File Station einfach auf die ausgew&auml;hlte Datei, und klicken Sie dann im Kontextmen&uuml; auf <b>Mit Text-Editor &ouml;ffnen</b>. Wenn die Datei bereits ge&ouml;ffnet ist, zeigt der Text-Editor die Datei in ihrem aktuellen Zustand. Eine weitere M&ouml;glichkeit, eine Datei zu &ouml;ffnen ist, eine oder mehrere Dateien von File Station mit dem Cursor in den Text-Editor zu ziehen.</p><br><div class="section">
<p><b>Hinweis:</b></p>
<p>Mit Text-Editor k&ouml;nnen Sie keine Datei &ouml;ffnen, deren Gr&ouml;&szlig;e 10&nbsp;MB &uuml;berschreitet.</p>
</div>

<h4>So werden Dateien gespeichert:</h4> 
<p>Klicken Sie einfach auf <b>Datei</b>, und w&auml;hlen Sie <b>Speichern</b>. Wenn es eine vorhandene Datei ist, wird sie mit dem aktuellen Inhalt &uuml;berschrieben. Wenn Sie alle ge&ouml;ffneten Dateien auf einmal speichern m&ouml;chten, gehen Sie zu <b>Datei</b> &gt; <b>Alle speichern</b>. Wenn die Datei noch keinen Namen besitzt (eine neue Datei), oder Sie <b>Datei</b> &gt; <b>Speichern unter</b> ausgew&auml;hlt haben, &ouml;ffnet sich ein Dialogfenster, um die Datei zu benennen. Sie k&ouml;nnen dann den Speicherort, den Dateinamen und die Codierung w&auml;hlen, um die Datei zu speichern.</p>

<h4>So werden Dateien geschlossen:</h4> 
<p>Klicken Sie einfach auf <b>Datei</b>, und w&auml;hlen Sie <b>Schlie&szlig;en</b>. F&uuml;r eine weitere M&ouml;glichkeit zum Schlie&szlig;en einer Datei klicken Sie auf die Schaltfl&auml;che &bdquo;Schlie&szlig;en&ldquo; auf der jeweiligen Registerkarte. Wenn noch nicht gespeicherte Daten in einer Datei vorhanden sind, wird der Text-Editor Sie immer fragen, ob die Datei ohne die &Auml;nderungen gespeichert werden soll.</p>

</ul>

<div class="section">
<h4>Hinweis:</h4>
<p>Sie k&ouml;nnen Dateien mit einem bestimmten Zeichensatz speichern, um bidirektionale Sprachen zu unterst&uuml;tzen. Au&szlig;erdem kann auch eine Codierung beim &Ouml;ffnen einer Datei angegeben werden, damit Text-Editor die Datei korrekt anzeigt.</p>
</div>

<h3>Bearbeiten</h3>
<ul>
<li><strong>Standardvorg&auml;nge</strong><br> Die Bearbeitungssteuerung unterst&uuml;tzt die einfachen Befehle &bdquo;R&uuml;ckg&auml;ngig&ldquo;, &bdquo;Wiederholen&ldquo; und &bdquo;Alle ausw&auml;hlen&ldquo;. Diese Vorg&auml;nge sind in den meisten Editoren zu finden und sind sehr &auml;hnlich. Diese Vorg&auml;nge k&ouml;nnen durch Auswahl des entsprechenden Men&uuml;punkts im Men&uuml; <b>Bearbeiten</b> ausgef&uuml;hrt werden. Zus&auml;tzlich sind die Standard-Befehle Ausschneiden, Kopieren und Einf&uuml;gen &uuml;ber das Kontextmen&uuml; des Browsers verf&uuml;gbar.</li>

<li><strong>Einzug</strong><br> Das Einr&uuml;cken von Text ist ein h&auml;ufiger Vorgang beim Bearbeiten von Quellcodes. Das Einr&uuml;cken bezieht sich auf das Einf&uuml;gen von zus&auml;tzlichen Leerzeichen am Anfang einer Zeile, um Textbl&ouml;cke zu trennen und eine Hierarchie hinzuzuf&uuml;gen. Normalerweise wird durch Dr&uuml;cken der Tabulatortaste ein Tabulator an der aktuellen Position eingef&uuml;gt. Falls allerdings ein Text ausgew&auml;hlt ist, f&uuml;gt das Dr&uuml;cken der Tabulatortaste zus&auml;tzliche Leerzeichen am Anfang jeder Zeile des markierten Textes ein, sodass ganze Textbl&ouml;cke auf einmal einger&uuml;ckt werden k&ouml;nnen. Durch gleichzeitiges Dr&uuml;cken der Umschalttaste und der Tabulatortaste wird der Einzug auf einmal entfernt.</li>

<li><strong>&Uuml;berschreiben</strong><br> &Uuml;berschreiben kann durch Dr&uuml;cken der Taste &bdquo;Einfg&ldquo; (Einf&uuml;gen) aktiviert und deaktiviert werden. Dies bedeutet, dass Zeichen an der Cursorposition ersetzt werden, anstatt sie einzuf&uuml;gen. Die angezeigte Cursor-Form &auml;ndert sich im &Uuml;berschreiben-Modus entsprechend.</li>

<li><strong>Spalten-Bearbeitungsmodus</strong><br> Eine besondere Art der Bearbeitung von Dateien ist die Bearbeitung im Spaltenmodus. Dies bedeutet, dass Text in Spalten ausgew&auml;hlt werden kann, anstatt in Zeilen. Um eine Spaltenmodus-Auswahl zu starten, dr&uuml;cken Sie bei der Auswahl von Text die Alt-Taste und bewegen Sie den Cursor nach Bedarf nach oben oder unten. Wenn der Text in diesem sogenannten Spaltenmodus ausgew&auml;hlt wurde, wird beim Eingeben jede ausgew&auml;hlte Spalte von Zeichen zum eingegebenen Zeichen ge&auml;ndert.</li>
</ul>


<h3>Suchen</h3>
<ul>
<li><strong>Einfache Suche</strong><br> Sie k&ouml;nnen Text wie in den meisten Programmen mit dem Suchen-Dialog suchen. Dieser Dialog &ouml;ffnet sich unter <b>Suche</b> &gt; <b>Suchen</b>. Dieses Dialogfenster wird immer &uuml;ber dem Text angezeigt, und der Text kann nicht bearbeitet werden, solange es ge&ouml;ffnet ist. Geben Sie in das Suchfeld den gesuchten Text ein.</li>

<li><strong>Ersetzen</strong><br> Sie k&ouml;nnen Text wie in den meisten Programmen mit dem Ersetzen-Dialog suchen und ersetzen. Dieser Dialog &ouml;ffnet sich unter <b>Suche</b> &gt; <b>Ersetzen</b>. <b>Alle ersetzen</b> ersetzt alle Eintr&auml;ge der abgefragten Suchbegriffe durch den Ersatztext. </li>

<li><strong>Gro&szlig;-/Kleinschreibung</strong><br> Sie erzwingt, dass die Suchergebnisse genau die gleiche Schreibweise wie die Abfrage aufweisen. Wenn dies nicht markiert ist, wird die Gro&szlig;-/Kleinschreibung bei der Suche nicht beachtet.</li>

<li><strong>Nur ganzes Wort</strong><br> Es werden nur Suchergebnisse angezeigt, wenn das Ergebnis aus einem ganzen Wort und nicht nur einem Teil davon besteht. Wenn Sie z.&nbsp;B. das Wort &bdquo;Bei&ldquo; mit <strong>Nur ganzes Wort</strong> suchen, wird nur &bdquo;Bei&quot; gefunden, und nicht &bdquo;Beispiel&ldquo;.</li>

<li><strong>Regul&auml;rer Ausdruck</strong><br> Die Abfrage wird wie ein regul&auml;rer Ausdruck behandelt.</li>
</ul>


<div class="section">
<h4>Was ist ein regul&auml;rer Ausdruck?</h4>
<p>Ein regul&auml;rer Ausdruck ist eine Folge von Zeichen, die f&uuml;r eine leistungsstarke, zeitsparende Suchtechnik ein Suchmuster bildet. Eine sehr einfache Verwendung eines regul&auml;ren Ausdrucks w&auml;re, ein im Text-Editor auf zwei Arten geschriebenes Wort zu finden, z.&nbsp;B. Ha[un]s.</p>
</div>

<h3>Stil-Konfigurator</h3>
<p>Der Stil-Konfigurator wird in erster Linie verwendet, um das Aussehen des Textes im Texteditor zu steuern.<br> Die Drop-down-Liste unten rechts enth&auml;lt alle unterst&uuml;tzten Programmiersprachen, deren Stil ge&auml;ndert werden kann, um Ihnen dabei zu helfen, eine geeignete Programmierumgebung zu erstellen.</p>

<h3>Voreinstellungen</h3>
<ul>
<li><strong>Unsichtbare Zeichen anzeigen</strong><br> Wenn dies markiert ist, werden Leerzeichen, Tabulatoren, Zeilenvorschub- oder Zeilenende-Zeichen angezeigt.</li>

<li><strong>Einr&uuml;ckungslinien anzeigen</strong><br> Wenn dies markiert ist, werden Einr&uuml;ckungslinien angezeigt. Dies ist n&uuml;tzlich f&uuml;r das Ausrichten von Codes in der Codiersprache.</li>

<li><strong>Aktuelle Zeile markieren</strong><br> Wenn dies markiert ist, wird die Zeile, bei der sich die Einf&uuml;gemarke befindet, mit einer speziellen Hintergrundfarbe gekennzeichnet.</li>

<li><strong>Ausgew&auml;hltes Wort markieren</strong><br> Wenn dies markiert ist, werden automatisch alle W&ouml;rter (nicht teilweise) in derselben Textdatei markiert, die mit dem ausgew&auml;hlten Wort &uuml;bereinstimmen.</li>

<li><strong>Zeilennummern anzeigen</strong><br> Wenn dies markiert ist, werden die Zeilennummern angezeigt.</li>

<li><strong>Codefaltung aktivieren</strong><br> Wenn dies markiert ist, k&ouml;nnen bestimmte Zeilen des Codes, basierend auf bestimmten Merkmalen, verborgen werden. Diese Funktion eignet sich gut f&uuml;r strukturierte Sprachen wie C++ oder XML. Wenn <b>Offenlegungs-Widgets automatisch ausblenden</b> markiert ist, werden bestimmte Codezeilen automatisch gefaltet. Sie k&ouml;nnen auch festlegen, dass nur die Start-Klammer oder sowohl Start- und End-Klammer bei den Offenlegungs-Widgets markiert werden.</li>  

<li><strong>Zeilenumbruch</strong><br> Bestimmen Sie, ob der Text am Fensterrand oder bei einer bestimmten Spaltennummer umgebrochen wird, ohne einen harten Zeilenumbruch einzuf&uuml;gen.</li>

<li><strong>Schlie&szlig;ende Zeichen automatisch hinzuf&uuml;gen</strong><br> Wenn dies markiert ist, werden End-Klammern (Zeichen) automatisch zu den Codes hinzugef&uuml;gt.</li>

<li><strong>Leerzeichen anstelle von Tabulatoren einf&uuml;gen</strong><br> Wenn dies markiert ist, wird durch Dr&uuml;cken der Tabulatortaste ein Leerzeichen anstatt eines Tabulators eingef&uuml;gt. <b>Tabulaborbreite</b> kann durch die Anzahl von Zeichen unter <b>Voreinstellungen</b> &gt; <b>Schriftart und Farbe</b> festgelegt werden.</li>

<li><strong>Standardkodierung</strong><br> Die Standardkodierung wird verwendet, um Dateien mit einem bestimmten Zeichensatz zu speichern, damit bidirektionale Sprachen unterst&uuml;tzt werden. Au&szlig;erdem kann auch eine Codierung beim &Ouml;ffnen einer Datei angegeben werden, damit Text-Editor die Datei korrekt anzeigt.</li>

<li><strong>Schriftart und Farbe</strong><br> <b>Tabulatorbreite</b>, <b>Schriftgr&ouml;&szlig;e</b> und <b>Thema</b> k&ouml;nnen nach Ihren pers&ouml;nlichen Vorlieben angepasst werden. <b>Tabulaborbreite</b> wird nach Anzahl von Leerzeichen definiert.</li>
</ul>

<div class="section">
<h4>Unterst&uuml;tzte Dateiformate</h4>
<p>Text-Editor unterst&uuml;tzt nur einfache Textdateien. Text-Dateien mit umfangreicher Formatierung wie *.doc und *.pdf werden nicht unterst&uuml;tzt.</p>
</div>

</body>
</html>
