<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Primeros pasos con Cloud Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Sincronizar archivos entre Synology NAS y un ordenador con Cloud Station</h1>
<div class="tutorials_content">

<img src="../../images/BuildCloud/1x/cloud_sync_files/02_1_build_your_private_cloud_CloudStation.png"/>

<h2>Visi&oacute;n general</h2>
<p>Cloud Station para Synology NAS es una aplicaci&oacute;n para la sincronizaci&oacute;n de archivos que le permite sincronizar archivos en su Synology NAS f&aacute;cilmente con otros dispositivos, como por ejemplo ordenadores o dispositivos m&oacute;viles (con DS cloud). Cuando haya instalado Cloud Station en el Synology NAS y en el ordenador, los archivos almacenados en una carpeta espec&iacute;fica del ordenador se sincronizar&aacute;n autom&aacute;ticamente a el Synology NAS.</p>

<iframe width="640" height="360" src="//www.youtube.com/embed/kZX8XK9Wy2Y" frameborder="0" allowfullscreen></iframe>

<h3 class="list_head">1. Instalar Cloud Station</h3>
<ol>
<li>Vaya al <b>Centro de paquetes</b>, busque <b>Cloud Station</b> y haga clic en <strong>Instalar</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/1.png" />
</ol>

<h3 class="list_head">2. Habilitar Cloud Station</h3>
<ol>
<li>Iniciar <b>Cloud Station</b>.

<li>Si no ha habilitado la caracter&iacute;stica de inicio de usuario, se le pedir&aacute; que lo haga. Haga clic en <b>OK</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/01.png" />
<li>Se le redirigir&aacute; a la p&aacute;gina de configuraci&oacute;n de usuario. Habilite los homes de usuario y haga clic en <b>Aplicar</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/02.png" />
<li>Ahora vuelva a <b>Cloud Station</b> y se le pedir&aacute; que la habilite. Haga clic en <b>S&iacute;</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/03.png" />
<li>Vaya a <b>Privilegios</b> y especifique los usuarios que podr&aacute;n utilizar Cloud Station. Haga clic en <b>Guardar</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/04.png" />
</ol>

<h3 class="list_head">3. Instale y habilite el cliente</h3>
<ol>
<li>Vaya a <b>Cloud Station</b> &gt; <b>Visi&oacute;n general</b> y haga clic en el bot&oacute;n de <b>Ordenadores</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/05.png" />
<li>Haga clic en el bot&oacute;n para descargar Cloud Station para su sistema operativo. (Tambi&eacute;n puede descargar Cloud Station desde el <a href="https://www.synology.com/en-us/support/download" target="_blank">Centro de descargas de Synology</a>).</li>
<li>Inicie el instalador en el ordenador y siga las instrucciones en pantalla.</li>
<li>Tras la instalaci&oacute;n, ejecute <strong>Cloud Station</strong> en su ordenador. Haga clic en <strong>Iniciar ahora</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/06.png" />
<li>Introduzca la direcci&oacute;n para el Synology NAS que ejecuta Cloud Station (o QuickConnect ID), nombre de usuario y contrase&ntilde;a. Puede hacer clic en el icono de b&uacute;squeda de la derecha para buscar IP en su LAN. Haga clic en <strong>Siguiente</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/07.png" />
<li>Seleccione como desea configurar su tarea (aqu&iacute; seleccionaremos <strong>Configuraci&oacute;n r&aacute;pida</strong>) y a continuaci&oacute;n haga clic en <strong>Siguiente</strong>. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/08.png" />
<li>Haga clic en <strong>Finalizar</strong> para completar la configuraci&oacute;n de su carpeta de Cloud Station.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/09.png" />
<li>Haga clic en <strong>Abrirla ahora</strong> para abrir su carpeta de Cloud Station.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/10.png" />
<li>Puede encontrar el icono de Cloud Station en la bandeja del sistema. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/14.png" />
<li>Haga doble clic en el icono de Cloud Station para abrir el men&uacute; de la bandeja. Aqu&iacute; puede visualizar el progreso y el estado de sus archivos. Haga clic en <strong>Aplicaci&oacute;n principal</strong> para iniciar Cloud Station. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/15.png" />
<li>Tras iniciarla, se le mostrar&aacute;n algunos consejos acerca del uso de Cloud Station. Haga clic en la flecha de la derecha para ver m&aacute;s consejos o haga clic en <strong>Ir a tutoriales</strong> en l&iacute;nea para obtener m&aacute;s informaci&oacute;n. Si no necesita los consejos, haga clic en <strong>No volver a mostrar esto</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/16.png" />
<li>Ahora puede administrar sus tareas de sincronizaci&oacute;n en Cloud Station. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/17.png" />
</ol>

<h3 class="list_head">4. Sincronizar datos con sus dispositivos m&oacute;viles</h3>
<p>DS cloud est&aacute; disponible de manera gratuita en <a href="https://itunes.apple.com/us/app/ds-cloud/id590216612?mt=8" target="_blank">Apple App Store</a> y <a href="https://play.google.com/store/apps/details?id=com.synology.dscloud" target="_blank">Google Play Store</a>. Tambi&eacute;n puede escanear el siguiente c&oacute;digo QR para su descarga directa.</p>
<img src="../../images/BuildCloud/1x/cloud_sync_files/13.png" width="475" height="219" />
</div>
<div class="page-info">
  <ul>
    <li>Siguiente en este tema:<a href="cloud_set_up_quickconnect.html">Acceda a su Synology NAS por Internet y comparta archivos</a> </li>
  </ul>
</div>
</body>

</html>
