<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="session"></a>Seguridad</h2>

<p>Puede modificar los siguientes par&aacute;metros de seguridad en <strong>Panel de control</strong> &gt; <strong>Seguridad</strong> &gt; <strong>Seguridad</strong> para sesiones de exploraci&oacute;n de DSM:</p>

<ul>
<li><strong>Temporizador de cierre de sesi&oacute;n (minutos):</strong> La sesi&oacute;n de los usuarios se cerrar&aacute; autom&aacute;ticamente en DSM si permanecen inactivos durante el periodo de tiempo especificado aqu&iacute;. Introduzca cualquier valor entre 1 y 65535.</li>
<li><strong>Mejorar la compatibilidad del explorador omitiendo la comprobaci&oacute;n de IP:</strong> Si accede a DiskStation a trav&eacute;s de un proxy HTTP y encuentra desconexiones aleatorias, puede habilitar esta opci&oacute;n para omitir la comprobaci&oacute;n de IP.</li>
<li><strong>Mejorar la protecci&oacute;n contra ataques de falsificaci&oacute;n de solicitud entre sitios:</strong> Esta opci&oacute;n mejora la protecci&oacute;n del sistema contra ataques de scripting entre sitios. Esta opci&oacute;n entrar&aacute; en efecto la pr&oacute;xima vez que inicie una sesi&oacute;n en DSM.</li>
<li><strong>No permitir que DSM se incruste en iFrame</strong> Puede habilitar esta opci&oacute;n para impedir que otros sitios incrusten DSM en otras p&aacute;ginas web con iFrame, evitando as&iacute; algunos tipos de ataques desde sitios web malintencionados. Se puede permitir que ciertos sitios web determinados incrusten DSM con iFrame si hace clic en el bot&oacute;n <strong>Sitios web permitidos</strong>.</li>
</ul>


</body>
</html>

