<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Programador de tareas</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Programador de tareas</h1>
<p>El Programador de tareas le permite programar y ejecutar servicios o scripts a horas predefinidas.</p>
<h2>Tareas compatibles</h2>
<p>Se pueden crear tareas para hacer lo siguiente:</p>
<ul class="disable-eds14">
<li><strong>Script definido por usuario:</strong> Ejecute scripts o comandos definidos por el usuario.</li>
<li><strong>Papelera de reciclaje:</strong> Vaciar la papelera de reciclaje de ciertas carpetas compartidas espec&iacute;ficas. Adem&aacute;s, la configuraci&oacute;n de la <strong>Pol&iacute;tica de retenci&oacute;n</strong> le permitir&aacute; controlar los archivos que se eliminar&aacute;n permanentemente al vaciar la papelera de reciclaje. Por ejemplo, los archivos se pueden eliminar o conservar de acuerdo con su tama&ntilde;o, hora de eliminaci&oacute;n o formato de archivo.</li>
<li><strong>Control de pitido:</strong> Cree el pitido de DiskStation.</li> 
<li><strong>Servicio:</strong> Inicie o detenga los servicios de red, como el Servicio de archivos Windows, FTP, Bloqueo autom&aacute;tico, etc.</li>
</ul>


<ul class="enable-eds14">
<li><strong>Script definido por usuario:</strong> Ejecute scripts o comandos definidos por el usuario.</li>
<li><strong>Papelera de reciclaje:</strong> Vaciar la papelera de reciclaje de ciertas carpetas compartidas espec&iacute;ficas. Adem&aacute;s, la configuraci&oacute;n de la <strong>Pol&iacute;tica de retenci&oacute;n</strong> le permitir&aacute; controlar los archivos que se eliminar&aacute;n permanentemente al vaciar la papelera de reciclaje. Por ejemplo, los archivos se pueden eliminar o conservar de acuerdo con su tama&ntilde;o, hora de eliminaci&oacute;n o formato de archivo.</li>
<li><strong>Servicio:</strong> Inicie o detenga los servicios de red, como el Servicio de archivos Windows, FTP, Bloqueo autom&aacute;tico, etc.</li>
</ul>


<h2>Administrar tareas</h2>
<p>La p&aacute;gina principal del Programador de tareas muestra todas las tareas existentes y ofrece opciones para crear, editar o ejecutar tareas.</p>
<h4>Para crear una tarea:</h4>
<ol>
<li>Haga clic en <strong>Crear</strong> y seleccione el tipo de tarea que desea programar.</li>
<li>Cuando aparezca la ventana <strong>Crear tarea</strong>, modifique las siguientes opciones en la ficha <strong>General</strong>:</li>
<ul>
<li><strong>Configuraci&oacute;n general:</strong> Introduzca un nombre de tarea, seleccione un usuario y habilite o deshabilite la tarea. </li>
<li><strong>Otra configuraci&oacute;n:</strong> En esta ficha se pueden modificar opciones adicionales espec&iacute;ficas de la tarea (solo para determinadas tareas). Por ejemplo, cuando cree una tarea para vaciar una papelera de reciclaje, tendr&aacute; que seleccionar la papelera de reciclaje de una carpeta compartida determinada.</li>
</ul>
<li>En la pesta&ntilde;a <strong>Programa</strong>, modifique las siguientes opciones:</li>
<ul>
<li><strong>Fecha:</strong> Indique cu&aacute;ndo ejecutar la tarea. Las tareas se pueden programar para que se ejecuten determinados d&iacute;as de la semana (por ejemplo, diariamente, los fines de semana o todos los domingos, etc.) o en determinadas fechas (p. ej., 21/10/2015).</li>
<li><strong>Veces:</strong> Indique cu&aacute;ntas veces se debe ejecutar la tarea cada d&iacute;a, as&iacute; como la primera y la &uacute;ltima hora de ejecuci&oacute;n.</li>
</ul>
<li>Modifique las opciones espec&iacute;ficas de la tarea en la ficha <strong>Configuraci&oacute;n de tarea</strong> (solo para ciertas tareas).</li>
</ul>
<li>Haga clic en <strong>OK</strong> para terminar</li>
</ol>
<h4>Para editar la configuraci&oacute;n de la tarea:</h4>
<ol>
<li>Seleccione una tarea existente.</li>
<li>Haga clic en <b>Editar</b>.</li>
<li>Aparece una ventana en la que puede modificar la configuraci&oacute;n de la tarea.</li>
</ol>
<h4>Para eliminar una tarea:</h4>
<ol>
<li>Seleccione una tarea existente.</li>
<li>Haga clic en <b>Eliminar</b>.</li>
</ol>

<h4>Para habilitar o deshabilitar una tarea:</h4>
<ol>
<li>En la p&aacute;gina principal del <strong>Programador de tareas</strong>, active o desactive la casilla de verificaci&oacute;n adecuada bajo <strong>Habilitada</strong> para habilitar o deshabilitar una tarea.</li>
<li>Haga clic en <strong>Guardar</strong>.</li>
</ol>


<h4>Para ejecutar manualmente una tarea:</h4>
<ol>
<li>Seleccione una o varias tareas existentes.</li>
<li>Haga clic en <strong>Ejecutar</strong>.</li>
</ol>

<div class="section">
<h4>Limitaciones del Programador de tareas:</h4>
<ul class="disable-eds14">
<li>Los nombres de las tareas pueden incluir 512 caracteres visibles.</li>
<li>N&uacute;mero m&aacute;ximo de tareas: 1024.</li>
<li>Longitud m&aacute;xima de la ruta del script o de la l&iacute;nea de comando: 4095.</li>
<li>La duraci&oacute;n del pitido se puede ajustar entre 1 y 600 segundos.</li>
</ul>


<ul class="enable-eds14">
<li>Los nombres de las tareas pueden incluir 512 caracteres visibles.</li>
<li>N&uacute;mero m&aacute;ximo de tareas: 1024.</li>
<li>Longitud m&aacute;xima de la ruta del script o de la l&iacute;nea de comando: 4095.</li>
</ul>

</div>

</body> </html>
