<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Recupera&ccedil;&atilde;o</h2>
	<p>Essa p&aacute;gina permite que os administradores do sistema realizem a recupera&ccedil;&atilde;o. Para permitir que os usu&aacute;rios acessem os instant&acirc;neos da pasta compartilhada, habilite <strong>Tornar o instant&acirc;neo vis&iacute;vel</strong> para cada pasta compartilhada para que os usu&aacute;rios possam acessar os instant&acirc;neos atrav&eacute;s do File Station ou Explorador de arquivos do Windows.</p>
<h3>Pasta Compartilhada</h3>
<h4>Para restaurar arquivos/pastas individuais em uma pasta compartilhada:</h4>
<ol>
<li>Selecione uma pasta compartilhada que deseje restaurar.
<li>Clique em <strong>Recuperar</strong>.</li>
<li>Selecione uma vers&atilde;o do instant&acirc;neo do qual deseje restaurar.</li>
<li>Clique em <strong>Procurar</strong> e copie os arquivos/pastas que deseja restaurar para o destino.</li>
</ol>
<h4>Para restaurar uma pasta compartilhada:</h4>
<ol>
<li>Selecione uma pasta compartilhada que deseje restaurar.
<li>Clique em <strong>Recuperar</strong>.</li>
<li>Selecione uma vers&atilde;o do instant&acirc;neo do qual deseje restaurar.</li>
<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Restaurar no local</strong> da lista suspensa.</li>
<li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para clonar um instant&acirc;neo para uma nova pasta compartilhada:</h4>
<ol>
<li>Selecione uma pasta compartilhada que deseja clonar.</li>
<li>Clique em <strong>Recuperar</strong>.</li>
<li>Selecione uma vers&atilde;o do instant&acirc;neo que deseja clonar para uma nova pasta compartilhada.</li>
<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Clonar com um novo nome</strong> da lista suspensa.</li>
<li>Voc&ecirc; ser&aacute; redirecionado para a p&aacute;gina <strong>Clonar</strong> em <strong>Painel de controle</strong> &gt; <strong>Pasta compartilhada</strong> &gt; <strong>Criar</strong>. Digite o nome da pasta compartilhada clonada e clique em <strong>OK</strong> para concluir.</li>
</ol>
<div class="section"><h4>Observa&ccedil;&atilde;o:</h4>
<ul>
	<li>As &quot;homes&quot; da pasta compartilhada n&atilde;o podem ser restauradas.</li>
	<li>As pastas compartilhadas clonadas n&atilde;o podem ser criptografadas.</li>
	<li>Se um instant&acirc;neo for tirado enquanto a transfer&ecirc;ncia de qualquer arquivo ainda estiver em andamento, a consist&ecirc;ncia dos dados n&atilde;o ser&aacute; garantida.</li>
	<li>Limita&ccedil;&otilde;es sobre pastas compartilhadas criptografadas:
		<ul>
			<li>Nenhum dos tipos de recupera&ccedil;&atilde;o est&aacute; dispon&iacute;vel para as pastas compartilhadas criptografadas montadas.</li>
			<li><strong>Clonar com um novo nome</strong> n&atilde;o est&aacute; dispon&iacute;vel para as pastas compartilhadas criptografadas.</li>
			<li>As pastas compartilhadas criptografadas desmontadas podem ser restauradas de instant&acirc;neos tirados anteriormente usando-se <strong>Restaurar no local</strong>.</li>
		</ul>
	</li>
</ul>
</div>
<h3>iSCSI LUN</h3>
<h4>Para restaurar um iSCSI LUN:</h4>
<ol>
  <li>Selecione o iSCSI LUN que deseja restaurar.</li>
	<li>Clique em <strong>Recuperar</strong>.</li>
	<li>Selecione uma vers&atilde;o do instant&acirc;neo do qual deseje restaurar.</li>
	<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Restaurar no local</strong> da lista suspensa.</li>
  <li>Voc&ecirc; ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a a&ccedil;&atilde;o.</li>
</ol>
<h4>Para clonar um instant&acirc;neo para um novo iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que deseja clonar.</li>
	<li>Clique em <strong>Recuperar</strong>.</li>
	<li>Selecione uma vers&atilde;o do instant&acirc;neo que deseja clonar para um novo iSCSI LUN.</li>
	<li>Clique em <strong>A&ccedil;&atilde;o</strong> e selecione <strong>Clonar com um novo nome</strong> da lista suspensa.</li>
	<li>Voc&ecirc; ser&aacute; redirecionado para a p&aacute;gina <strong>Clonar</strong> em <strong>Gerenciador de armazenamento</strong> &gt; <strong>iSCSI LUN</strong>. Digite o nome do iSCSI LUN clonado e clique em <strong>OK</strong> para concluir.</li>
</ol>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Se um instant&acirc;neo for tirado enquanto a transfer&ecirc;ncia de qualquer arquivo ainda estiver em andamento, a consist&ecirc;ncia dos dados n&atilde;o ser&aacute; garantida.</li>
</ul>
</div>
</body>
</html>
