<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Analisador de Armazenamento</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Gerenciar perfis de relat&oacute;rio</h2>

<p>Voc&ecirc; pode criar e modificar tarefas agendadas para gerar relat&oacute;rios sobre o uso do volume em <b>Analisador de Armazenamento</b> &gt; <b>Perfil de Relat&oacute;rio</b>.</p>


<h4>Para criar uma tarefa de relat&oacute;rio:</h4>
<ol>
<li>Clique em <b>Criar</b> para abrir o assistente.</li>
<li>Especifique um nome para a nova tarefa de relat&oacute;rio e digite o endere&ccedil;o de e-mail para o qual deseja enviar o relat&oacute;rio.</li>
<li>Selecione um ou v&aacute;rios tipos de relat&oacute;rio que deseja gerar.</li>
<li>Realize uma das seguintes a&ccedil;&otilde;es para especificar um hor&aacute;rio para gerar relat&oacute;rios:</li>
<ul>
<li>Marque <b>Gerar relat&oacute;rios de acordo com um agendamento</b> e especifique o hor&aacute;rio se desejar que o sistema analise o uso do volume periodicamente.</li>
<li>Marque <b>Gerar relat&oacute;rios agora</b> se desejar iniciar manualmente uma tarefa de relat&oacute;rio agora.</li>
</ul>
<li>Se necess&aacute;rio, especifique determinados usu&aacute;rios ou pastas compartilhadas a serem inclu&iacute;das para limitar os relat&oacute;rios. (Observe que se voc&ecirc; desejar especificar e gerar relat&oacute;rios em pastas compartilhadas que estejam criptografadas, certifique-se de que os compartilhamentos criptografados foram montados antes de a tarefa de relat&oacute;rio ser executada.)</li>
<li>Clique em <b>Aplicar</b> para salvar as configura&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Pressione <b>Enter</b>/<b>Return</b> ap&oacute;s cada endere&ccedil;o de e-mail para separar v&aacute;rios endere&ccedil;os de e-mail.</li>
<li>Pressione <b>Enter</b>/<b>Return</b> ap&oacute;s cada usu&aacute;rio ao especificar usu&aacute;rios cujos arquivos ser&atilde;o listados individualmente por grupos de arquivo.</li>
<li>O relat&oacute;rio <b>Arquivos por grupo de arquivo</b> listar&aacute; os seguintes tipos de arquivo:<br> &Aacute;udio, arquivos de imagem de disco, documentos, arquivos execut&aacute;veis, imagens, v&iacute;deos, p&aacute;ginas da Internet, arquivos compactados e outros.</li>
<li>A se&ccedil;&atilde;o <b>Arquivos grandes</b> do relat&oacute;rio lista os 500 arquivos maiores na p&aacute;gina do relat&oacute;rio de uso ou os 200 arquivos maiores na p&aacute;gina completa do relat&oacute;rio.</li>

</ul>
</div>


<h4>Para editar uma tarefa de relat&oacute;rio:</h4>
<ol>
<li>Selecione uma tarefa de relat&oacute;rio na lista e clique em <b>Editar</b>.</li>
<li>Clique nas guias individuais para modificar as configura&ccedil;&otilde;es dessa tarefa.</li>
</ol>

<h4>Para excluir uma tarefa de relat&oacute;rio:</h4>
<p>Selecione uma tarefa de relat&oacute;rio na lista e clique em <b>Excluir</b>.</p>

<h4>Para visualizar relat&oacute;rios do hist&oacute;rico:</h4>
<ol>
<li>Selecione uma tarefa de relat&oacute;rio na lista e clique em <b>Relat&oacute;rio</b> &gt; <b>Exibir relat&oacute;rios do hist&oacute;rico</b>.</li>
<li>Na janela que aparece, clique em uma entrada para visualizar o relat&oacute;rio gerado no hor&aacute;rio especificado.</li>
</ol>

<h4>Para gerar relat&oacute;rios imediatamente:</h4>
<p>Selecione uma tarefa de relat&oacute;rio na lista e clique em <b>Relat&oacute;rio</b> &gt; <b>Gerar relat&oacute;rios agora</b> para gerar relat&oacute;rios sob demanda.</p>

<h4>Para alterar onde os relat&oacute;rios s&atilde;o salvos:</h4>
<ol>
<li>Clique em <b>Configura&ccedil;&otilde;es</b>.</li>
<li>Selecione uma nova pasta de destino para alterar o local onde os relat&oacute;rios s&atilde;o salvos.</li>
</ol>
<h4>Para coletar o hist&oacute;rico de uso do volume em um cronograma regular:</h4>
<p>Por padr&atilde;o, os dados de uso do volume s&atilde;o reunidos sempre que o relat&oacute;rio Uso do Volume &eacute; gerado e na inicializa&ccedil;&atilde;o do sistema. Al&eacute;m dos casos acima, voc&ecirc; pode optar por um novo agendamento para reunir o hist&oacute;rico de uso. Para isso, clique em <b>Configura&ccedil;&otilde;es</b> e marque <b>Coletar hist&oacute;rico de uso do volume de acordo com um agendamento</b> e agende um hor&aacute;rio.</p>
<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>O hist&oacute;rico coletado no hor&aacute;rio agendado aqui ser&aacute; usado principalmente para a finalidade especificada e como fonte das tend&ecirc;ncias de uso na se&ccedil;&atilde;o <b>Uso do Volume</b>. Quando essa op&ccedil;&atilde;o for habilitada, voc&ecirc; ver&aacute; um gr&aacute;fico de linhas exibindo as tend&ecirc;ncias e altera&ccedil;&otilde;es de uso ao longo do tempo; caso n&atilde;o seja habilitada, um gr&aacute;fico de barras indicando a porcentagem de uso atual ser&aacute; exibido em vez disso.</p>
</div>

<h4>Para analisar uma tarefa de relat&oacute;rio:</h4>
<p>Clique duas vezes na tarefa de relat&oacute;rio desejada ou apenas clique em <b>Analisar essa tarefa de relat&oacute;rio</b> (&iacute;cone <b>&gt;</b> ) pr&oacute;ximo &agrave; tarefa de relat&oacute;rio desejada para abrir sua p&aacute;gina de an&aacute;lise. Consulte <a href="view_reports.html">Visualizar Uso e Relat&oacute;rios</a> para obter mais informa&ccedil;&otilde;es.</p>

</body>
</html>
