<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Analisador de Armazenamento</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Visualizar Uso e Relat&oacute;rios</h2>
<p>Com o Analisador de Armazenamento, voc&ecirc; pode n&atilde;o apenas monitorar as tend&ecirc;ncias gerais de uso do volume, mas tamb&eacute;m ter uma vis&atilde;o r&aacute;pida da an&aacute;lise detalhada de armazenamento gerada pelas tarefas agendadas, para saber mais sobre seu espa&ccedil;o de armazenamento e ter um melhor gerenciamento do seu DiskStation.</p>
<h3>Uso do Volume</h3>
<p>Na se&ccedil;&atilde;o <b>Uso do Volume</b>, voc&ecirc; encontrar&aacute; um gr&aacute;fico de linhas exibindo as tend&ecirc;ncias e altera&ccedil;&otilde;es de uso do volume ao longo do tempo ou um gr&aacute;fico de barras indicando a porcentagem de uso atual, caso n&atilde;o tenha ativado a op&ccedil;&atilde;o de hist&oacute;rico de uso do volume (em <b>Perfis de Relat&oacute;rio</b> &gt; <b>Configura&ccedil;&otilde;es</b> &gt; <b>Coletar hist&oacute;rico de uso do volume de acordo com um agendamento</b>).</p>
<h4>Para visualizar o uso do volume, realize uma das seguintes a&ccedil;&otilde;es:</h4>
<ul>
<li>Passe o mouse sobre a linha no gr&aacute;fico de linhas para ver a capacidade usada, dispon&iacute;vel e total do volume na data indicada.</li>
<li>Clique nos bot&otilde;es <b>1</b> e <b>2</b> no canto superior direito para alterar entre dois modos de exibi&ccedil;&atilde;o (gr&aacute;fico de linhas e lista) conforme sua prefer&ecirc;ncia.O gr&aacute;fico de linhas permite ter uma vis&atilde;o r&aacute;pida da tend&ecirc;ncia geral em um curto per&iacute;odo de tempo, ao passo que a lista oferece os dados coletados mais recentemente.</li>
</ul>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Se voc&ecirc; tiver mais do que 10 volumes em seu DiskStation, somente os dez volumes principais com o uso mais alto ser&atilde;o exibidos.</p>
</div>

<h3>Relat&oacute;rios de Uso</h3>
<p>Al&eacute;m do uso atual do volume, com apenas alguns cliques, voc&ecirc; tamb&eacute;m pode visualizar v&aacute;rios tipos de relat&oacute;rios de uso gerados por tarefas anteriores ou localizar facilmente o relat&oacute;rio desejado que corresponde aos crit&eacute;rios ou data especificada.Os relat&oacute;rios de an&aacute;lise s&atilde;o classificados em diferentes tipos, incluindo o uso da cota de cada pasta ou tipo de arquivo e o uso de pastas de acordo com seu hor&aacute;rio modificado ou acessado.</p>


<h4>Para visualizar relat&oacute;rios de uso:</h4>
<ol>
<li>Na se&ccedil;&atilde;o <b>Perfil de Relat&oacute;rio</b>, selecione uma tarefa na lista de perfis e clique duas vezes na tarefa ou apenas clique em <b>Analisar essa tarefa de relat&oacute;rio</b> (&iacute;cone <b>&gt;</b>) pr&oacute;ximo &agrave; tarefa desejada para visualizar seus dados coletados e an&aacute;lise.(Observe que as tarefas que nunca foram executadas n&atilde;o podem ser selecionadas.)</li>
<li>Clique nas guias individuais no painel esquerdo da p&aacute;gina de relat&oacute;rio para visualizar a an&aacute;lise correspondente:</li>
<ul>
<li><b>Uso de cota:</b> Exibe a cota ocupada por cada pasta compartilhada.</li>
<li><b>Cota do usu&aacute;rio:</b> Exibe a contagem e o tamanho do arquivo de cada usu&aacute;rio em cada pasta compartilhada.</li>
<li><b>Tipo:</b> Exibe a cota de todos os tipos de arquivo em cada pasta compartilhada.</li>
<li><strong>Duplicados:</strong> Exibe arquivos duplicados localizados no sistema pela conveni&ecirc;ncia de organizar ou excluir c&oacute;pias desnecess&aacute;rias.Observe que quanto maior o n&uacute;mero m&aacute;ximo de arquivos duplicados voc&ecirc; definir, mais tempo o processo levar&aacute;.</li>
<li><b>Tamanho:</b> Exibe at&eacute; 500 arquivos em ordem descendente do seu tamanho.</li>
<li><b>Arquivos mais modificados recentemente:</b> Exibe at&eacute; 500 arquivos em ordem descendente do hor&aacute;rio da sua &uacute;ltima altera&ccedil;&atilde;o.</li>
<li><b>Arquivos menos acessados recentemente:</b> Exibe at&eacute; 500 arquivos em ordem ascendente do hor&aacute;rio de seu &uacute;ltimo acesso.</li>
</ul>
<li>Se necess&aacute;rio, especifique os crit&eacute;rios no menu suspenso para filtrar relat&oacute;rios e localizar as informa&ccedil;&otilde;es que precisa de maneira mais eficiente.</li>
<li>Clique em qualquer data no controle deslizante da programa&ccedil;&atilde;o na parte inferior para visualizar relat&oacute;rios gerados na data selecionada.</li>
<li>De forma alternativa, voc&ecirc; pode clicar em <b>Visualizar relat&oacute;rio completo</b> no canto superior direito se preferir visualizar a an&aacute;lise completa em uma &uacute;nica p&aacute;gina.</li>
</ol>
</body>
</html>
