<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Analisador de Armazenamento</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Gerir Perfis de Relat&oacute;rio</h2>

<p>Pode criar e alterar tarefas agendadas para gerar relat&oacute;rios sobre a utiliza&ccedil;&atilde;o do volume em <b>Analisador de Armazenamento</b> &gt; <b>Perfil de Relat&oacute;rio</b>.</p>


<h4>Para criar uma tarefa de relat&oacute;rio:</h4>
<ol>
<li>Clique em <b>Criar</b> para abrir o assistente.</li>
<li>Especifique um nome para a nova tarefa de relat&oacute;rio e introduza o endere&ccedil;o de e-mail para o qual pretende enviar o relat&oacute;rio.</li>
<li>Selecione um ou v&aacute;rios tipos de relat&oacute;rio que pretende gerar.</li>
<li>Execute uma das seguintes op&ccedil;&otilde;es para determinar uma hora para gerar os relat&oacute;rios:</li>
<ul>
<li>Assinale a op&ccedil;&atilde;o <b>Gerar relat&oacute;rio de acordo com agendamento</b> e especifique a hora se pretender que o sistema analise periodicamente a utiliza&ccedil;&atilde;o do volume.</li>
<li>Assinale a op&ccedil;&atilde;o <b>Gerar relat&oacute;rios agora</b> se pretender dar in&iacute;cio agora de forma manual a uma tarefa de relat&oacute;rio.</li>
</ul>
<li>Se necess&aacute;rio, especifique determinados utilizadores ou pastas partilhadas a incluir para reduzir os relat&oacute;rios. (Note que se pretender especificar e gerar relat&oacute;rios de pastas partilhadas que estejam encriptadas, &eacute; favor certificar-se que as partilhas encriptadas est&atilde;o devidamente montadas antes de a tarefa de relat&oacute;rio ser desempenhada.)</li>
<li>Clique em <b>Aplicar</b> para guardar as defini&ccedil;&otilde;es.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Prima <b>Enter</b>/<b>Return</b> depois de cada endere&ccedil;o de e-mail para separar m&uacute;ltiplos endere&ccedil;os de e-mail.</li>
<li>Prima <b>Enter</b>/<b>Return</b> depois de cada utilizador, quando especificar utilizadores cujos ficheiros ser&atilde;o listados individualmente por grupos de ficheiros.</li>
<li>O relat&oacute;rio <b>Ficheiros por Grupo de Ficheiros</b> ir&aacute; listar os seguintes tipos de ficheiros:<br> Ficheiros &aacute;udio, ficheiros de imagem de disco, documentos, ficheiros execut&aacute;veis, imagens, v&iacute;deos, p&aacute;ginas web, ficheiros comprimidos e outros</li>
<li>A sec&ccedil;&atilde;o dos <b>Ficheiros Grandes</b> do relat&oacute;rio lista os 500 ficheiros maiores na p&aacute;gina do relat&oacute;rio de utiliza&ccedil;&atilde;o ou os 200 ficheiros maiores na p&aacute;gina do relat&oacute;rio completo.</li>

</ul>
</div>


<h4>Para editar uma tarefa de relat&oacute;rio:</h4>
<ol>
<li>Selecione uma tarefa de relat&oacute;rio da lista e clique em <b>Editar</b>.</li>
<li>Clique nos separadores individuais para alterar as defini&ccedil;&otilde;es da tarefa.</li>
</ol>

<h4>Para eliminar uma tarefa de relat&oacute;rio:</h4>
<p>Selecione uma tarefa de relat&oacute;rio da lista e clique em <b>Eliminar</b>.</p>

<h4>Para ver relat&oacute;rios hist&oacute;ricos:</h4>
<ol>
<li>Selecione uma tarefa de relat&oacute;rio da lista e clique em <b>Relat&oacute;rio</b> &gt; <b>Ver relat&oacute;rios hist&oacute;ricos</b>.</li>
<li>Na janela que aparece, clique numa entrada para ver o relat&oacute;rio gerado na hora especificada.</li>
</ol>

<h4>Para gerar relat&oacute;rios de imediato:</h4>
<p>Selecione uma tarefa de relat&oacute;rio da lista e clique em <b>Relat&oacute;rio</b> &gt; e escolha <b>Gerar relat&oacute;rios agora</b> para gerar relat&oacute;rios a pedido.</p>

<h4>Para alterar onde s&atilde;o guardados os relat&oacute;rios:</h4>
<ol>
<li>Clique em <b>Defini&ccedil;&otilde;es</b>.</li>
<li>Selecione uma nova pasta de destino para alterar a localiza&ccedil;&atilde;o onde s&atilde;o guardados os relat&oacute;rios.</li>
</ol>
<h4>Para reunir um hist&oacute;rico de utiliza&ccedil;&atilde;o do volume, de forma regular:</h4>
<p>Por predefini&ccedil;&atilde;o, os dados de utiliza&ccedil;&atilde;o do volume s&atilde;o reunidos sempre que &eacute; gerado um relat&oacute;rio de Utiliza&ccedil;&atilde;o do Volume e no arranque do sistema. Para al&eacute;m desses casos, pode tamb&eacute;m optar por um novo hor&aacute;rio para recolha do hist&oacute;rico de utiliza&ccedil;&atilde;o. Para tal, clique em <b>Defini&ccedil;&otilde;es</b>, assinale <b>Recolher hist&oacute;rico de utiliza&ccedil;&atilde;o de volume de acordo com um agendamento</b> e agende uma hora.</p>
<div class="section">
<h4>Nota:</h4>
<p>O hist&oacute;rico recolhido na hora aqui agendada ser&aacute; essencialmente utilizado para efeitos e como fonte de tend&ecirc;ncias de utiliza&ccedil;&atilde;o na sec&ccedil;&atilde;o <b>Utiliza&ccedil;&atilde;o de Volume</b>. Sempre que esta op&ccedil;&atilde;o estiver ativa, ver&aacute; um gr&aacute;fico de linhas com as tend&ecirc;ncias e altera&ccedil;&otilde;es relativas &agrave; utiliza&ccedil;&atilde;o do volume ao longo do tempo, caso contr&aacute;rio, ser&aacute; apresentado um gr&aacute;fico de barras com a percentagem atual de utiliza&ccedil;&atilde;o.</p>
</div>

<h4>Para analisar uma tarefa de relat&oacute;rio:</h4>
<p>Clique duas vezes na tarefa de relat&oacute;rio pretendida ou clique simplesmente em <b>Analisar esta tarefa de relat&oacute;rio</b> (no &iacute;cone <b>&gt;</b>) junto da tarefa de relat&oacute;rio pretendida para abrir a respetiva p&aacute;gina de an&aacute;lise. Consulte <a href="view_reports.html">Ver Utiliza&ccedil;&atilde;o e Relat&oacute;rios</a> para obter mais informa&ccedil;&otilde;es.</p>

</body>
</html>
