<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Analisador de Armazenamento</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Ver Utiliza&ccedil;&atilde;o e Relat&oacute;rios</h2>
<p>Com o Analisador de Armazenamento, pode n&atilde;o apenas monitorizar as tend&ecirc;ncias globais de utiliza&ccedil;&atilde;o do volume, como tamb&eacute;m dar uma olhadela &agrave;s an&aacute;lises de armazenamento detalhadas resultantes das tarefas agendadas de forma a saber mais sobre o seu espa&ccedil;o de armazenamento e a gerir melhor o DiskStation.</p>
<h3>Utiliza&ccedil;&atilde;o do volume</h3>
<p>Na sec&ccedil;&atilde;o <b>Utiliza&ccedil;&atilde;o do Volume</b>, encontrar&aacute; um gr&aacute;fico de linhas com as tend&ecirc;ncias e altera&ccedil;&otilde;es relativas &agrave; utiliza&ccedil;&atilde;o do volume ao longo do tempo e um gr&aacute;fico de barras que indica a percentagem atual de utiliza&ccedil;&atilde;o caso n&atilde;o tenha ativado a op&ccedil;&atilde;o de hist&oacute;rico de utiliza&ccedil;&atilde;o do volume (em <b>Perfis de Relat&oacute;rio</b> &gt; <b>Defini&ccedil;&otilde;es</b> &gt; <b>Recolher hist&oacute;rico de utiliza&ccedil;&atilde;o de volume de acordo com um agendamento</b>).</p>
<h4>Para ver a utiliza&ccedil;&atilde;o do volume, proceda de uma das formas seguintes:</h4>
<ul>
<li>Passe com o rato por cima da linha do gr&aacute;fico de linhas para visualizar a capacidade de volume utilizada, dispon&iacute;vel e total &agrave; data indicada.</li>
<li>Clique nos bot&otilde;es <b>1</b> e <b>2</b> no canto superior direito para alternar entre dois modos de exibi&ccedil;&atilde;o (gr&aacute;fico de linhas e lista) de acordo com a sua prefer&ecirc;ncia.O gr&aacute;fico de linhas permite-lhe um olhar r&aacute;pido sobre a tend&ecirc;ncia global durante um curto per&iacute;odo de tempo, ao passo que a lista lhe oferece os dados mais recentes.</li>
</ul>

<div class="section">
<h4>Nota:</h4>
<p>Caso tenha mais de 10 volumes no DiskStation, apenas ser&atilde;o apresentados os dez mais utilizados.</p>
</div>

<h3>Relat&oacute;rios de Utiliza&ccedil;&atilde;o</h3>
<p>Para al&eacute;m da utiliza&ccedil;&atilde;o atual do volume, pode tamb&eacute;m visualizar v&aacute;rios tipos de relat&oacute;rios de utiliza&ccedil;&atilde;o gerados a partir de tarefas anteriores ou encontrar facilmente e em apenas alguns cliques o relat&oacute;rio desejado que cumpre os crit&eacute;rios ou a data definidos.Os relat&oacute;rios de an&aacute;lise est&atilde;o classificados em v&aacute;rios tipos, incluindo a utiliza&ccedil;&atilde;o de quota dos diferentes tipos de pastas ou ficheiros e a utiliza&ccedil;&atilde;o de ficheiros de acordo com a respetiva data de altera&ccedil;&atilde;o ou de acesso.</p>


<h4>Para ver relat&oacute;rios de utiliza&ccedil;&atilde;o:</h4>
<ol>
<li>Na sec&ccedil;&atilde;o <b>Perfil de Relat&oacute;rio</b>, selecione uma tarefa da lista de perfil e, em seguida, clique duas vezes na tarefa ou simplesmente clique em <b>Analisar esta tarefa de relat&oacute;rio</b> (o &iacute;cone <b>&gt;</b>) junto da tarefa pretendida para visualizar os respetivos dados e a an&aacute;lise.(Por favor, tenha em aten&ccedil;&atilde;o que as tarefas que nunca foram executadas n&atilde;o podem ser selecionadas.)</li>
<li>Clique nos separadores individuais situados no painel esquerdo da p&aacute;gina de relat&oacute;rio para visualizar a an&aacute;lise correspondente:</li>
<ul>
<li><b>Utiliza&ccedil;&atilde;o de Quota:</b> Exibe a quota preenchida por cada pasta partilhada.</li>
<li><b>Quota de utilizador:</b> Exibe a contagem e o tamanho dos ficheiros de cada utilizador em todas as pastas partilhadas.</li>
<li><b>Tipo:</b> Exibe a quota dos v&aacute;rios tipos de ficheiros de todas as pastas partilhadas.</li>
<li><strong>Duplicados:</strong> Exibe ficheiros duplicados encontrados no sistema para efeitos de organiza&ccedil;&atilde;o ou elimina&ccedil;&atilde;o de c&oacute;pias desnecess&aacute;rias.Tenha em conta que, quando maior o n&uacute;mero m&aacute;ximo de ficheiros duplicados definidos, mais tempo ir&aacute; demorar a processar.</li>
<li><b>Tamanho:</b> Exibe at&eacute; 500 ficheiros por ordem decrescente de tamanho.</li>
<li><b>Ficheiros modificados mais recentemente:</b> Exibe at&eacute; 500 ficheiros por ordem decrescente da data mais recente de modifica&ccedil;&atilde;o.</li>
<li><b>Ficheiros acedidos menos recentemente:</b> Exibe at&eacute; 500 ficheiros por ordem ascendente da data de acesso mais recente.</li>
</ul>
<li>Se necess&aacute;rio, especifique os crit&eacute;rios no menu pendente para filtrar os relat&oacute;rios e encontrar mais eficazmente a informa&ccedil;&atilde;o de que necessita.</li>
<li>Clique em qualquer data no indicador da cronologia na parte inferior para visualizar os relat&oacute;rios gerados na data selecionada.</li>
<li>Em alternativa, pode clicar em <b>Visualizar relat&oacute;rio completo</b> no canto superior direito se optar por visualizar a an&aacute;lise completa numa &uacute;nica p&aacute;gina.</li>
</ol>
</body>
</html>
