<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>G&uuml;nl&uuml;k Merkezi</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>G&uuml;nl&uuml;k Arama</h2>
<p><strong>G&uuml;nl&uuml;k Merkezi</strong> &gt; <strong>G&uuml;nl&uuml;k Arama</strong> sayfasında, g&uuml;nl&uuml;kleri g&ouml;r&uuml;nt&uuml;leyebilir, arayabilir ve dışa aktarabilirsiniz. </p>

<h4>G&uuml;nl&uuml;kleri aramak i&ccedil;in:</h4>

<ol>
<li><strong>Yerel</strong> veya <strong>Diğer sunuculardan</strong> sekmesini se&ccedil;erek yerel sistem g&uuml;nl&uuml;klerini veya diğer aygıtlardan g&uuml;nl&uuml;kleri g&ouml;r&uuml;nt&uuml;lemeyi se&ccedil;in.
<li>Gerekirse, <strong>En son g&uuml;nl&uuml;kleri</strong> g&ouml;r&uuml;nt&uuml;lemek veya <strong>G&uuml;nl&uuml;k arşivini a&ccedil;</strong> &ouml;ğesini se&ccedil;erek mevcut bir g&uuml;nl&uuml;k arşivini a&ccedil;mak i&ccedil;in se&ccedil;in.
<li>Arama aşağı a&ccedil;ılır men&uuml;s&uuml;nde, duruma bağlı olarak aşağıdaki kriterleri belirleyebilirsiniz:
  <ul>
  <li><b>Anahtar s&ouml;zc&uuml;k</b>: Eşleşen anahtar s&ouml;zc&uuml;ğ&uuml; i&ccedil;eren g&uuml;nl&uuml;k mesajlarını aramak i&ccedil;in bir anahtar s&ouml;zc&uuml;k girin.
  	<div class="section">
	<h4>Not:</h4>
	<p>Arama yaparken anahtar s&ouml;zc&uuml;k arama kısmında [<strong>*</strong>] (&ouml;r. rastgele karakterlerden oluşan herhangi bir sayı) veya [<strong>?</strong>] (&ouml;r. bir rastgele karakter) gibi normal işaretler kullanabilirsiniz. &Ouml;rneğin, [a<span class="note_head">*</span>n] belirtimi [a<span class="note_head">ctio</span>n], [a<span class="note_head">ttentio</span>n] veya [an] anlamına gelebilir.</p>
	</div>
  </li>
  <li><strong>Tarih Aralığı: </strong>Belirtilen tarih aralığına g&ouml;re g&uuml;nl&uuml;kleri arayın.
  <li><b>Seviye</b>: Belirtilen d&uuml;zeye g&ouml;re g&uuml;nl&uuml;kleri arayın.</li>
  <li><b>Ana makine adı</b>: Belirtilen ana bilgisayar adına g&ouml;re g&uuml;nl&uuml;kleri arayın.</li>
  <li><b>Program</b>: Belirtilen program adına g&ouml;re g&uuml;nl&uuml;kleri arayın.</li>
  <li><b>Kategori</b>: Belirtilen program kategorisine g&ouml;re g&uuml;nl&uuml;kleri arayın.</li>
  </ul>
<li>Belirtilen kriterlerle eşleşen g&uuml;nl&uuml;kleri aramak i&ccedil;in <strong>Ara</strong>'ya tıklayın.</li>
</ol>

<h4>G&uuml;nl&uuml;kleri dışarı aktarmak i&ccedil;in:</h4>

<ol>
<li><strong>Dışarı aktar</strong> d&uuml;ğmesinin yanındaki oka tıklayın.</li>
<li>Arzu ettiğiniz bi&ccedil;imi kullanarak g&uuml;nl&uuml;kleri indirmek i&ccedil;in <strong>HTML</strong> veya <strong>CSV</strong> se&ccedil;imi yapın.</li>
</ol>

<div class="section">
<h4>Not:</h4>
<ul>
<li>Dışarı aktarılan CSV g&uuml;nl&uuml;k dosyalarının karakter kodlaması UTF-8'dir. Dosyayı UTF-8 karakter kodlamasını destekleyen bir program ile a&ccedil;manız gerekecektir. </li>
</ul>
</div>

</body></html>
