<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Guardar os ficheiros no eCore Server provenientes de um PC Windows na rede local</title>
</head>

<body class="tutorial-content-box" >

<h1>Desfrute da m&uacute;sica armazenada no seu eCore Server com a Audio Station</h1>
<div class="tutorials_content">
<img src="../../images/HomeTheater/1x/home_theater_music/03_3_set_up_your_home_theater_AudeoStation.png" />
<h2>Vis&atilde;o Geral</h2>
<p>Com Audio Station, pode organizar, percorrer e reproduzir m&uacute;sica armazenada no seu eCore Server pela Internet. Audio Station suporta tamb&eacute;m uma vasta sele&ccedil;&atilde;o de tipos de ficheiros, para que possa desfrutar da sua m&uacute;sica em qualquer formato, da forma que quiser. Pode tamb&eacute;m transferir DS Audio, uma aplica&ccedil;&atilde;o m&oacute;vel que complemente Audio Station, permitindo-lhe aceder &agrave; m&uacute;sica no seu eCore Server quando estiver em viagem. 
</p>
<h3 class="list_head">1. Instalar a Audio Station</h3>
<ol>
<li>Aceda ao <b>Centro de Pacotes</b> e localize <b>Audio Station</b>. Clique em <b>Instalar</b>.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/01.png" />
</ol>

<h3 class="list_head">2. Armazene Ficheiros &Aacute;udio na pasta de m&uacute;sica</h3>
<ol>
<li>Aceda a <b>File Station</b> &gt; <b>m&uacute;sica</b> e clique em <b>Carregar</b>.</li> <img src="../../images/HomeTheater/1x/home_theater_music/03.png" />
<li>Selecione os ficheiros que deseja carregar para a sua pasta <b>m&uacute;sica</b> a partir do seu computador local.</li>
</ol>

<h3 class="list_head">3. Pesquisar M&uacute;sica</h3>
<p>Depois de ter carregado ficheiros de m&uacute;sica, pode agora reproduzir e percorrer a sua m&uacute;sica na Audio Station. Se desejar aceder e percorrer os seus ficheiros de m&uacute;sica quando n&atilde;o est&aacute; na sua rede local, recomendamos que ative QuickConnect em <b>Painel de Controlo</b> &gt; <b>QuickConnect</b>. Se n&atilde;o tiver uma Conta Synology, pode configurar uma em poucos minutos e dar &agrave; sua DiskStation um <b>QuickConnect ID</b>. Com esta op&ccedil;&atilde;o ativada, pode agora iniciar a sess&atilde;o no DSM e aceder &agrave; sua m&uacute;sica a partir de qualquer lugar. Pode tamb&eacute;m usar o seu <b>QuickConnect ID</b> para iniciar a sess&atilde;o em DS Audio para poupar trabalho em memorizar o seu endere&ccedil;o IP. </p>
<h4>3.1 Biblioteca</h4>
<p> A biblioteca cont&eacute;m m&uacute;sica na pasta partilhada <b>m&uacute;sica</b> ou qualquer das outras pastas indexadas do seu eCore Server. No separador <b>Biblioteca</b>, a sua m&uacute;sica &eacute; ordenada em categorias para lhe proporcionar diferentes op&ccedil;&otilde;es para percorrer facilmente a sua m&uacute;sica consoante as suas necessidades e prefer&ecirc;ncias. Tal como isto, permite-lhe encontrar facilmente qualquer m&uacute;sica que estiver a procurar. Pode clicar em cada categoria para realzizar a sua pesquisa ou selecionar a categoria que deseja procurar a partir do menu de contexto na barra de pesquisa. </p>

  <img src="../../images/HomeTheater/1x/home_theater_music/08.png" width="640" height="392" />
</ul>
<div class="code_div"><b>Nota:</b> Para adicionar uma pasta como pasta indexada, inicie sess&atilde;o no DSM como admin (ou um utilizador pertencente ao grupo administrators) e, em seguida, v&aacute; a <b>Painel de Controlo</b> &gt; <b>Biblioteca de Multim&eacute;dia</b> &gt; <b>Pasta Indexada</b>. </div>
<h4>3.2. Modos de visualiza&ccedil;&atilde;o</h4>
<p>Os &iacute;cones no canto superior direito da Audio Station permitem-lhe mudar entre diferentes modos de visualiza&ccedil;&atilde;o nos quais pode percorrer a sua biblioteca de m&uacute;sica.</p>
<ul>
<li><b>Vista de lista</b> permite-lhe visualizar a sua m&uacute;sica como uma lista apresentando o nome da m&uacute;sica, int&eacute;rprete, &aacute;lbum, duran&ccedil;&atilde;o de m&uacute;sica, n&uacute;mero de faixa e classifica&ccedil;&atilde;o.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/05.png" width="640" height="392" />
<li><b>Capa</b> apresenta o nome da faixa, nome do &aacute;lbum e a capa do &aacute;lbum.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/06.png" width="640" height="392" />
<li><b>Fila de espera de reprodu&ccedil;&atilde;o</b> apresenta a fila de espera de reprodu&ccedil;&atilde;o em ecr&atilde; completo com capas de &aacute;lbuns e t&iacute;tulos ou letra de m&uacute;sicas.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/07.png" width="640" height="392" />
</ul>
<h3 class="list_head">4. Partilhar em P&uacute;blico</h3>
<p>A fun&ccedil;&atilde;o de partilhar em p&uacute;blico do Audio Station permite-lhe partilhar m&uacute;sicas com o p&uacute;blico, ao facultar-lhe um link que pode enviar para quem est&aacute; ou n&atilde;o na sua rede ou que n&atilde;o tem um eCore Server. Assim que tiverem o link, podem ouvir as m&uacute;sicas. </p>
<h4>4.1. Partilhar m&uacute;sicas com o p&uacute;blico</h4>
<ol>
<li>Clique com o bot&atilde;o direito na(s) m&uacute;sica(s) que pretende partilhar e selecione <b>Partilhar com o p&uacute;blico</b>.</li>
<img src="../../images/HomeTheater/1x/home_theater_music/09.png" width="640" height="392" />
<li>H&aacute; duas op&ccedil;&otilde;es quando est&aacute; a partilhar m&uacute;sicas com o p&uacute;blico: <ul>
  <li>Se selecionar uma s&oacute; m&uacute;sica a partilhar, na caixa de di&aacute;logo que surge, assinale a op&ccedil;&atilde;o <b>Partilhar com o p&uacute;blico</b> para ativar a partilha de liga&ccedil;&atilde;o.</li> 
  <img src="../../images/HomeTheater/1x/home_theater_music/10.png" width="561" height="190" />
<li>Se selecionar v&aacute;rias m&uacute;sicas para partilhar, isto ir&aacute; criar uma lista de reprodu&ccedil;&atilde;o. Pode dar um nome &agrave; sua lista de reprodu&ccedil;&atilde;o bem como a op&ccedil;&atilde;o de especificar um per&iacute;odo de validade para a liga&ccedil;&atilde;o assinalando a op&ccedil;&atilde;o <b>Personalizar Per&iacute;odo de Validade</b> e clicar em OK.</li>
  <img src="../../images/HomeTheater/1x/home_theater_music/11.png" width="560" height="320" /></ul>
<li>Copie o link e cole-o para a pessoa com quem pretende partilhar a lista de reprodu&ccedil;&atilde;o, ou clique em <b>Ir para link</b> para visitar o link diretamente. </li>
</ol>
<div class="code_div"><b>Nota:</b> Poder&aacute; encontrar as listas de reprodu&ccedil;&atilde;o partilhadas que criar visitando o separador <b>Lista de reprodu&ccedil;&atilde;o</b>. As m&uacute;sicas partilhadas de forma individual ser&atilde;o adicionadas a uma lista de reprodu&ccedil;&atilde;o predefinida com o nome <b>M&uacute;sicas Partilhadas</b> que pode tamb&eacute;m a&iacute; ser encontrada.
  </div>

<h3 class="list_head">5. Organizar e Reproduzir M&uacute;sica em Dispositivos M&oacute;veis</h3>
<p>DS audio funciona no iPad/iPhone/iPod touch, dispositivos Android e Windows Phones. A aplica&ccedil;&atilde;o est&aacute; dispon&iacute;vel de forma gratuita na <a href="http://itunes.apple.com/us/app/ds-audio/id321495303?mt=8" target="_blank">Apple App Store</a>,&nbsp;<a href="https://play.google.com/store/apps/details?id=com.synology.DSaudio&amp;hl=en" target="_blank">Google Play</a>, e&nbsp;<a href="http://www.windowsphone.com/en-US/apps/30d353e3-9ca6-458a-a88e-c972fc3e04d6" target="_blank">Windows Phone Store</a>. Pode tamb&eacute;m digitalizar o c&oacute;digo QR abaixo para uma transfer&ecirc;ncia instant&acirc;nea.</p>
<img src="../../images/HomeTheater/1x/home_theater_music/12.png" width="758" height="217" /></div>
<div class="section">
  <ul>
    <li>Atr&aacute;s neste t&oacute;pico: <a href="home_theater_videos.html">Categorizar e reproduzir V&iacute;deos com a Video Station</a> </li>
  </ul>
</div>
</body>

</html>
