<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Sikkerhedskopier dine data til eCore Server for at sikre datasikkerheden</title>
</head>

<body class="tutorial-content-box" >

<h1>Sikkerhedskopier dine data til eCore Server for at sikre datasikkerheden</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/Backup/back_up_your_data_on_synology_nas_to_ensure_data_security.jpg" />
<h2>Oversigt</h2>
<p>Uforudsigelige serverfejl eller sammenbrud af diskenheder er en alvorlig risiko til dine yderst vigtige data. eCore Server giver dig alternativer, enten lokalt eller fjerntliggende, til at lave sikkerhedskopier af dine vigtigste data, s&aring; du altid er forberedt p&aring; det v&aelig;rste. Du kan v&aelig;lge at sikkerhedskopiere p&aring; en eller flere m&aring;der for at reducere risikoen for datatab, afh&aelig;ngigt af krav og virksomhedens forhold.</p>

<h3 class="list_head">1. Sikkerhedskopier til en ekstern lagerenhed</h3>
<p> N&aring;r du sikkerhedskopierer lokalt, kan du v&aelig;lge at indstille sikkerhedskopieringsdestinationen til en anden mappe p&aring; den samme diskenhed, RAID-gruppe eller endda p&aring; den samme fysiske disk. I dette tilf&aelig;lde kan du, hvis dine data slettes ved en fejltagelse, kunne gendanne dem fra sikkerhedskopierne i en anden mappe. Hvis det uheldige skulle ske, at din server svigter eller diskenheden bryder sammen, er det muligt, at dine data, s&aring;vel som dine sikkerhedskopier, mistes. Det anbefales derfor altid, at du sikkerhedskopierer dine vigtige data til en ekstern lagerenhed og ikke til den samme server. Med eCore Server kan brugerne indstille deres sikkerhedskopieringsdestination til ikke blot lokaldrev, men ogs&aring; eksterne USB-enheder. Funktionen findes i <b>Hovedmenu &gt; Backup og kopiering</b>. Du kan finde trin-for-trin vejledninger ved at se <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=dan#local_backup">her</a>.</p>

<h3 class="list_head">2. Sikkerhedskopier til en anden eCore Server over netv&aelig;rket</h3>
<p>Sikkerhedskopiering af dine data til en ekstern lagerenhed forbedrer dataenes tilg&aelig;ngelighed, men du b&oslash;r t&aelig;nke p&aring; risikoen for en ulykke, som f.eks. brand eller oversv&oslash;mmelse af det sted, hvor din server og lagerenhederne opbevares. eCore Server giver brugerne mulighed for at lave en sikkerhedskopi udenfor stedet ved at overf&oslash;re kopier af dine data over netv&aelig;rket til en anden server et andet sted, og mindsker s&aring;ledes risikoen for datatab, skulle der forekomme en ulykke p&aring; serverstedet. Dataoverf&oslash;rsel af en sikkerhedskopi kan v&aelig;re krypteret, s&aring; den beskytter dine vigtige data mere sikkert. Med sikkerhedskopieringsmuligheden p&aring; blokniveau sikkerhedskopierer din NAS kun &aelig;ndrede blokke, hvilket er s&aelig;rligt praktisk, n&aring;r netv&aelig;rkssikkerhedskopieringen udf&oslash;res over internettet. Funktionen findes i <b>Hovedmenu &gt; Backup og kopiering</b>. Du kan finde trin-for-trin vejledninger ved at se <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=dan#network_backup">her</a>.</p>

<h3 class="list_head">3. Sikkerhedskopiering til offentligt skylager</h3>
<p>Fjernsikkerhedskopiering mellem forskellige NAS-enheder kr&aelig;ver to eller flere servere, inklusiv et antal diske i serverne, samt et sted for serverne. Dine virksomhedsforhold tillader muligvis ikke, at du opretter et andet sted med sikkerhedskopier med flere NAS-enheder. For at kunne levere en l&oslash;sning til problemet, hvor du ikke kan implementere NAS til sikkerhedskopiering over netv&aelig;rket, har Synologys sikkerhedskopieringsfunktion underst&oslash;ttelse af flere offentlige skylagre, s&aring; du kan sikkerhedskopiere direkte til din offentlige skykonto. Denne funktion findes i <b>Backup &amp; kopiering</b> eller <b>Pakkecenter</b>, afh&aelig;ngigt af dit foretrukne offentlige skylager. Du kan finde trin-for-trin vejledninger ved at se <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=dan#cloudservice_backup">her</a>.</p>
</div>

</body>

</html>