<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Sikkerhetskopiere dataene dine p&aring; Synology NAS</title>
</head>

<body class="tutorial-content-box" >

<h1>Sikkerhetskopiere dataene dine p&aring; Synology NAS</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/Backup/back_up_your_data_on_synology_nas_to_ensure_data_security.jpg" />
<h2>Oversikt</h2>
<p>Uforutsigbare serverfeil eller volumkrasj utgj&oslash;r en alvorlig risiko for dine kritiske data. Synology NAS gir brukere alternativer, enten lokalt eller eksternt, for sikkerhetskopiering av trygge kopier av de viktigste dataene dine. Dermed er du alltid sikret mot de alvorligste situasjonene. Du kan velge &aring; sikkerhetskopiere p&aring; en eller flere m&aring;ter for &aring; redusere faren for datatap, avhengig av virksomhetens krav og situasjoner.</p>

<h3 class="list_head">1. Sikkerhetskopier til en ekstern lagringsenhet</h3>
<p> N&aring;r du sikkerhetskopierer lokalt, kan du velge &aring; sette opp sikkerhetskopim&aring;let i en annen mappe p&aring; samme volum, i samme RAID-gruppe eller til og med samme fysiske disk. Hvis dataene i dette tilfellet blir slettet ved en feil, kan du gjenopprette dem fra de sikkerhetskopierte kopiene i en annen mappe. Hvis det imidlertid oppst&aring;r serverfeil, volumkrasj eller andre uhell, kan b&aring;de data og sikkerhetskopier g&aring; tapt. Du blir alltid anbefalt &aring; sikkerhetskopiere dine viktigste data til en ekstern lagringsenhet, i stedet for samme server. Synology NAS gj&oslash;r at brukere kan angi sitt sikkerhetkopim&aring;l ikke bare til lokale stasjoner, men ogs&aring; eksterne USB-enheter. Funksjonen er tilgjengelig i <b>Hovedmeny &gt; Sikkerhetskopiering &amp; kopiering</b>. Hvis du vil ha en trinnvis instruksjoner, se <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=nor#local_backup">her</a>.</p>

<h3 class="list_head">2. Sikkerhetskopier til en annen Synology NAS-enhet over nettverket</h3>
<p>Sikkerhetskopiering av data til en annen ekstern lagringsenhet forbedrer dataenes tilgjengelighet, men tenk p&aring; faren for katastrofer, for eksempel brann eller jordskjelv, p&aring; stedet der server- og lagringsenhetene dine er plassert. Synology NAS lar brukere etablere ekstern sikkerhetskopiering ved &aring; overf&oslash;re kopier av dataene dine til en annen server et annet sted p&aring; nettverket. Dette reduserer faren for datatap p&aring; grunn av katastrofer p&aring; serverens plassering. Dataoverf&oslash;ring av sikkerhetskopien kan krypteres for &aring; beskytte dine viktigste data med en h&oslash;yere grad av sikkerhet. Med alternativet sikkerhetskopiering p&aring; blokkniv&aring; vil din NAS-enhet sikkerhetskopiere bare modifiserte blokker, og dette er spesielt praktisk n&aring;r sikkerhetskopieringen utf&oslash;res over Internett. Funksjonen er tilgjengelig i <b>Hovedmeny &gt; Sikkerhetskopiering &amp; kopiering</b>. Hvis du vil ha en trinnvis instruksjoner, se <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=nor#network_backup">her</a>.</p>

<h3 class="list_head">3. Sikkerhetskopier til lagring i den offentlige skyen</h3>
<p>Ekstern sikkerhetskopiering blant forskjellige NAS-enheter krever to eller flere servere, medregnet et antall disker som er plassert i dem, og steder der serverne dine kan plasseres. En virksomhets plassering tillater kanskje ikke at du setter opp en ekstern sikkerhetsl&oslash;sning med flere NAS-enheter. Hvis du vil tilby en l&oslash;sning p&aring; problemet med lite gjennomf&oslash;rbar NAS-implementering for sikkerhetskopiering i nettverket, kan du bruke Synologys sikkerhetskopieringsfunksjon til flere offentlige skytjenester slik at du kan sikkerhetskopiere dataene direkte til den offentlige skykontoen. Funksjonen er tilgjengelig i <b>Sikkerhetskopiering &amp; kopiering</b> eller <b>Pakkesenter</b>, avhengig av din foretrukne offentlige skylagring. Hvis du vil ha en trinnvis instruksjoner, se <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=nor#cloudservice_backup">her</a>.</p>
</div>

</body>

</html>