<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DHCP Server</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>DHCP Server</h2>
<p>O seu DiskStation pode assumir a fun&ccedil;&atilde;o de um servidor DHCP e atribui endere&ccedil;os IP din&acirc;micos a clientes DHCP na rede de &aacute;rea local.</p>

<h4>Para ativar o servidor DHCP:</h4>
<ol>
<li>Aceda a <strong>Painel de Controlo</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de Rede</strong>.</li>
<li>Selecione uma interface de rede (por exemplo, LAN) e clique em <strong>Editar</strong>.</li>
<li>Aceda ao separador <strong>DHCP Server</strong> e assinale <b>Ativar DHCP Server</b>.</li>
<li>Introduza um valor no campo <b>Tempo de concess&atilde;o de endere&ccedil;o</b> para definir o tempo de concess&atilde;o DHCP (em minutos) para endere&ccedil;os IP atribu&iacute;dos a clientes DHCP.</li>
<li>Introduza o endere&ccedil;o DNS para clientes DHCP nos campos <b>DNS Principal</b> (necess&aacute;rio) e <b>DNS Secund&aacute;rio</b> (opcional).</li>
<li>Defina o nome de dom&iacute;nio para o servidor DHCP no campo <b>Nome de dom&iacute;nio</b> (opcional).</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<h4>Para adicionar uma sub-rede:</h4>
<ol>
<li>Clique em <b>Adicionar</b> e depois especifique as informa&ccedil;&otilde;es nas seguintes colunas:</li>
<ul>
<li><b>Ativar</b>: Ativa ou desativa a sub-rede.</li>
<li><b>In&iacute;cio</b>: O primeiro endere&ccedil;o IP da sub-rede.</li>
<li><b>Fim</b>: O &uacute;ltimo endere&ccedil;o IP da sub-rede.</li>
<li><b>M&aacute;scara de rede</b>: A m&aacute;scara de sub-rede.</li>
<li><b>Gateway</b>: O gateway da sub-rede.</li>
</ul>
<li>Clique em <b>OK</b>.</li>
</ol>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>S&oacute; pode adicionar at&eacute; 32 sub-redes.</li>
</ul>
</div>



<h3>Clientes DHCP</h3>

<p>Para ver uma lista de clientes DHCP e respetivas configura&ccedil;&otilde;es de rede (por exemplo, endere&ccedil;o MAC, endere&ccedil;o IP, nome de anfitri&atilde;o e o tempo restante antes de a concess&atilde;o DHCP expirar), pode aceder ao separador <strong>Clientes DHCP</strong>.</p>


<h3>Reserva DHCP</h3>

<p>Se pretende que um cliente receba sempre o mesmo endere&ccedil;o IP durante a renova&ccedil;&atilde;o da concess&atilde;o DHCP, pode adicionar o cliente &agrave; lista de reservas de endere&ccedil;os.</p>

<h4>Para adicionar um cliente &agrave; lista de reserva de endere&ccedil;os:</h4>

<ul>
<li>Clique em <b>Adicionar</b>.</li>
<li>Especifique o endere&ccedil;o MAC do cliente, o endere&ccedil;o IP que pretende atribuir ao cliente e o nome de anfitri&atilde;o do cliente. </li>
<li>Clique em <b>OK</b> para guardar as suas defini&ccedil;&otilde;es.</li>
</ul>


</body>
</html>