<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="session"></a>Seguran&ccedil;a</h2>

<p>Pode modificar as seguintes defini&ccedil;&otilde;es de seguran&ccedil;a em <strong>Painel de Controlo</strong> &gt; <strong>Seguran&ccedil;a</strong> &gt; <strong>Seguran&ccedil;a</strong> para as sess&otilde;es de navega&ccedil;&atilde;o do DSM:</p>

<ul>
<li><strong>Temporizador de fecho de sess&atilde;o (minutos):</strong> Os utilizadores ter&atilde;o a sess&atilde;o terminada automaticamente no DSM se estiverem inativos durante o per&iacute;odo de tempo especificado aqui. Introduza qualquer valor de 1 a 65535.</li>
<li><strong>Melhorar a compatibilidade do navegador ignorando a verifica&ccedil;&atilde;o do IP:</strong> Se aceder ao DiskStation atrav&eacute;s de um proxy HTTP e encontrar fechos de sess&atilde;o aleat&oacute;rios, pode ativar esta op&ccedil;&atilde;o para ignorar a verifica&ccedil;&atilde;o do IP.</li>
<li><strong>Melhorar a prote&ccedil;&atilde;o contra a falsifica&ccedil;&atilde;o de pedidos em v&aacute;rios sites:</strong> Esta op&ccedil;&atilde;o melhora a prote&ccedil;&atilde;o do sistema contra a falsifica&ccedil;&atilde;o de scripting em v&aacute;rios sites. Esta op&ccedil;&atilde;o entra em vigor na pr&oacute;xima vez que iniciar sess&atilde;o no DSM.</li>
<li><strong>N&atilde;o permitir que o DSM seja incorporado com o iFrame:</strong> Pode ativar esta op&ccedil;&atilde;o para restringir outros websites de incorporarem o DSM noutras p&aacute;ginas web com o iFrame, evitando determinados tipos de ataques de websites maliciosos. Os websites espec&iacute;ficos podem incorporar o DSM com iFrame clicando no bot&atilde;o <strong>Websites permitidos</strong>.</li>
</ul>


</body>
</html>

