<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Centro de Ajuda</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Centro de Ajuda</h1>
<p>O Centro de Ajuda apresenta informa&ccedil;&otilde;es b&aacute;sicas relacionadas com v&aacute;rios aspetos do seu DiskStation, como as especifica&ccedil;&otilde;es de hardware, rede, armazenamento e servi&ccedil;os. O Centro de Ajuda encontra-se em <strong>Painel de Controlo</strong> &gt; <strong>Centro de Ajuda</strong>.</p>
<h2><a name="general"></a>Geral</h2>
<p>No separador <b>Geral</b>, &eacute; apresentada informa&ccedil;&atilde;o b&aacute;sica sobre DiskStation, incluindo n&uacute;mero de s&eacute;rie, nome do modelo, montante da mem&oacute;ria f&iacute;sica, vers&atilde;o DSM, informa&ccedil;&atilde;o sobre o tempo de utiliza&ccedil;&atilde;o, estado t&eacute;rmico ou dispositivos externos.</p>

<h3 class="disable-eds14">Estado T&eacute;rmico*</h3>
<p class="disable-eds14">O estado t&eacute;rmico do DiskStation &eacute; indicado pela luz verde ou laranja:</p>

<ul class="disable-eds14">
<li><strong>Verde:</strong> O estado t&eacute;rmico &eacute; normal.</li>
<li><strong>Laranja</strong>: A temperatura do DiskStation est&aacute; demasiado elevada. Se a temperatura do DiskStation se mantiver elevada, pode desligar-se devido ao sobreaquecimento.</li>
</ul>


<h2><a name="network"></a>Rede</h2>
<p>O separador <b>Rede</b> apresenta as informa&ccedil;&otilde;es da rede, como o servidor DNS, endere&ccedil;o IP, m&aacute;scara de sub-rede, entre outras.</p>

<h2><a name="storage"></a>Armazenamento</h2>
<p class="disable-eds14">O separador <b>Armazenamento</b> apresenta informa&ccedil;&otilde;es relacionadas com a utiliza&ccedil;&atilde;o do volume e o estado do disco r&iacute;gido.</p>
<p class="enable-eds14">No separador <strong>Armazenamento</strong>, s&atilde;o apresentadas informa&ccedil;&otilde;es relacionadas com a utiliza&ccedil;&atilde;o do armazenamento e o estado dos dispositivos de armazenamento externo.</p>

<h3 class="disable-eds14">Estado do Disco R&iacute;gido</h3>

<p class="disable-eds14">De seguida apresentam-se os tipos de estados poss&iacute;veis de um disco r&iacute;gido interno:</p>

<ul class="disable-eds14">
<li><strong>Sem Disco Instalado:</strong> N&atilde;o est&aacute; instalado qualquer disco na correspondente ranhura de disco r&iacute;gido.</li>
<li><strong>N&atilde;o Inicializado:</strong> A parti&ccedil;&atilde;o e o volume do sistema n&atilde;o est&atilde;o estabelecidos no disco r&iacute;gido.</li>
<li><strong>Normal:</strong> A parti&ccedil;&atilde;o e o volume do sistema est&atilde;o dispon&iacute;veis para utilizar no disco r&iacute;gido.</li>
<li><strong>Inicializado:</strong> A parti&ccedil;&atilde;o do sistema est&aacute; estabelecida mas n&atilde;o foi criado o volume.</li>
<li><strong>Parti&ccedil;&atilde;o do Sistema Falhou:</strong> A parti&ccedil;&atilde;o do sistema no disco r&iacute;gido est&aacute; indispon&iacute;vel.</li>
<li><strong>Avariado:</strong> Erro no acesso ao volume no disco r&iacute;gido. Recomendamos que substitua o disco r&iacute;gido.</li>
</ul>




<div class="section disable-eds14">

<h4>Nota:</h4>
<p>Para o sistema funcionar normalmente, pelo menos um disco deve estar no estado <b>Normal</b> ou <b>Inicializado</b>.</p>

</div>


<h2><a name="service"></a>Servi&ccedil;o</h2>
<p>O separador <b>Servi&ccedil;o</b> apresenta uma lista de servi&ccedil;os e pacotes instalados, incluindo op&ccedil;&otilde;es para ativar ou desativar cada um dos servi&ccedil;os e pacotes. Al&eacute;m disso, para alguns servi&ccedil;os e pacotes, existem op&ccedil;&otilde;es para testar a conectividade ou escolher se cada um dos servi&ccedil;os ou pacotes pode ser acedido atrav&eacute;s da firewall.</p>

<h4>Para modificar as defini&ccedil;&otilde;es do servi&ccedil;o ou pacote:</h4>
<ol>
<li>Encontram-se dispon&iacute;veis as seguintes op&ccedil;&otilde;es:<ul>
	  <li><strong>Ativar:</strong> Ativa ou desativa os servi&ccedil;os ou pacote.</li>
	  <li><strong>Permitir atrav&eacute;s da firewall:</strong> Adicione ou remova as portas utilizadas pelo servi&ccedil;o ou aplica&ccedil;&atilde;o em <strong>Painel de Controlo</strong> &gt; <strong>Acesso Externo</strong> &gt; <strong>Configura&ccedil;&atilde;o do Router</strong>, permitindo que o servi&ccedil;o ou pacote passe pela firewall do DiskStation.</li>
	  <li><strong>Defini&ccedil;&otilde;es:</strong> Selecione a interface de rede cujas defini&ccedil;&otilde;es de firewall gostaria de visualizar e gerir. Pode selecionar <strong>Tudo</strong> para visualizar e gerir as defini&ccedil;&otilde;es da firewall de todas as interfaces de rede.</li>
	  <li><strong>Testar liga&ccedil;&atilde;o:</strong> Teste as portas utilizadas pelos servi&ccedil;os e pacotes. Isto permite testar se os dispositivos podem aceder aos servi&ccedil;os e pacotes a partir de uma rede externa.</li>
    </ul>
</li>
<li>Clique em <strong>Guardar</strong> para guardar as altera&ccedil;&otilde;es ou clique em <strong>Repor</strong> para ignorar as altera&ccedil;&otilde;es. </li>
</ol>

<p class="disable-eds14">____<br> * Dispon&iacute;vel em apenas alguns modelos. </p>

</body>
</html>
