<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Instalar ou Comprar Pacotes - Ajuda Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Package Center lets you download, install, and launch packages on your DiskStation with a few simple clicks.">
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Instalar ou Comprar Pacotes</h2>

<p>O Centro de Pacotes disponibiliza uma avan&ccedil;ada variedade de aplica&ccedil;&otilde;es web que podem alargar a funcionalidade do seu DiskStation. Com o Centro de Pacotes, pode transferir, instalar e iniciar pacotes com alguns simples cliques.</p>
<p>O artigo seguinte explica como instalar pacotes no seu DiskStation utilizando o Centro de Pacotes. Para informa&ccedil;&otilde;es relacionadas com pacotes individuais, consulte <a href="http://www.synology.com/en-global/dsm/app_packages" target="_blank">aqui</a>.</p>

<h4>Para instalar ou comprar pacotes:</h4>

<ol>

<li>Abra o <strong>Centro de Pacotes</strong>.</li>

<li>Aceda &agrave; p&aacute;gina <strong>Tudo</strong> para consultar os pacotes dispon&iacute;veis.</li>
<div class="section">
<h4>Nota:</h4>
<ul>
	<li>Se n&atilde;o conseguir localizar o pacote que procura, poder&aacute; ser necess&aacute;rio uma vers&atilde;o mais recente da DSM ou poder&aacute; estar apenas dispon&iacute;vel para modelos com requisitos de hardware espec&iacute;ficos. Contacte o criador deste pacote para obter mais informa&ccedil;&otilde;es.</li>

</ul>
</div>
<li>Descubra o pacote que deseja instalar e clique em <strong>Instalar</strong>. (Para pacotes pagos, clique em <strong>Comprar</strong> ou <strong>Experimentar</strong> para ligar &agrave; Conta Synology e compre com Paypal ou utilize a vers&atilde;o experimental para avalia&ccedil;&atilde;o.)</li>

<li>Depois de o pacote estar devidamente instalado, deve ficar vis&iacute;vel no <strong>Menu Principal</strong>.</li>

</ol>

<div class="section">
<h4>Compra de Pacotes:</h4>
<p>Antes da compra de quaisquer pacotes, consulte as seguintes notas:</p>

<ul>
	<li>Registe uma <a href="https://account.synology.com/support/register.php" target="_blank">Conta Synology</a> para aceder a mais caracter&iacute;sticas, como a informa&ccedil;&atilde;o sobre factura&ccedil;&atilde;o anterior ou historial de compras. A informa&ccedil;&atilde;o que partilhar &eacute; utilizada apenas para proporcionar melhores servi&ccedil;os no futuro.</li>
<li>O Centro de Pacotes apenas aceita pagamentos online atrav&eacute;s de PayPal. Se desejar pedir um reembolso, visite o website oficial do PayPal. </li>
<li>Os pacotes est&atilde;o de momento com os pre&ccedil;os em d&oacute;lares dos E.U.A.</li>
</ul>
</div>

<div class="section">
<h4>Limita&ccedil;&atilde;o de Responsabilidade da Convers&atilde;o Cambial</h4>
<p>Para transac&ccedil;&otilde;es que incluam convers&atilde;o cambial, o emissor do seu cart&atilde;o de cr&eacute;dito/d&eacute;bito poder&aacute; acrescentar taxas adicionais n&atilde;o reflectidas no pre&ccedil;o apresentado. Quaisquer compras podem ser sujeitas a c&acirc;mbio internacional ou taxas internacionais pelo emissor do cart&atilde;o. O emissor do seu cart&atilde;o ir&aacute; avaliar as taxas aplicadas, para as quais a Synology n&atilde;o pode providenciar um reembolso. Contacte o emissor do seu cart&atilde;o de cr&eacute;dito/d&eacute;bito para mais informa&ccedil;&otilde;es.
</p></div>


<h4>Para instalar pacotes manualmente:</h4>
<ol>
<li>Se pretender instalar um pacote carregando um ficheiro .spk (dispon&iacute;vel no <a href="http://www.synology.com/support/download.php" target="_blank">Centro de Transfer&ecirc;ncias</a> da Synology ou nas p&aacute;ginas de internet dos terceiros), clique em <b>Instala&ccedil;&atilde;o Manual</b> e siga o assistente para instalar o novo pacote.</li>

</ol>


<h4>Para procurar um pacote:</h4>
<ol>
<li>Introduza uma palavra-chave na barra de pesquisa no canto superior esquerdo e prima Enter para come&ccedil;ar a pesquisar. </li>
</ol>


<h4>Para escolher a forma como os pacotes s&atilde;o ordenados:</h4>
<p>Poder&aacute; alterar a ordem dos pacotes, exibidos no Centro de Pacotes.&nbsp; Seleccione uma categoria, clique no &iacute;cone de lista no canto superior direito e opte por ordenar pacotes usando uma das seguintes op&ccedil;&otilde;es:</p>
<ul>
<li><strong>Ordenar por nome:</strong> Clique para ordenar os pacotes alfabeticamente.</li>
<li><strong>Ordenar por popularidade recente:</strong> Clique para ordenar pacotes por contagem de instala&ccedil;&atilde;o recente com os mais populares &agrave; frente.</li>
</ul>


<h4>Para ocultar pacotes instalados:</h4>
<p>Seleccione qualquer categoria, clique no &iacute;cone da lista no canto superior direito e escolha <strong>N&atilde;o mostrar pacotes instalados</strong>. Desta forma, oculta os pacotes j&aacute; instalados e mostra os que ainda n&atilde;o est&atilde;o instalados, actualizados ou reparados.</p>

</body>
</html>
