<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Recupera&ccedil;&atilde;o</h2>
	<p>Esta p&aacute;gina permite aos administradores de sistema realizar uma recupera&ccedil;&atilde;o. Para permitir que utilizadores acedam a instant&acirc;neos de pastas partilhadas, active <strong>Tornar vis&iacute;vel instant&acirc;neo</strong> para cada pasta partilhada, para que os utilizadores possam aceder aos instant&acirc;neos atrav&eacute;s da File Station ou Explorador de Ficheiros do Windows.</p>

<h3>Pasta Partilhada</h3>

<h4>Para restaurar ficheiros/pastas individuais numa pasta partilhada:</h4>
<ol>
<li>Seleccione uma pasta partilhada que deseja restaurar.
<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma vers&atilde;o de instant&acirc;neo da qual deseja restaurar.</li>
<li>Clique em <strong>Percorrer</strong>, e copie os ficheiros/pastas que deseja restaurar para o destino.</li>
</ol>

<h4>Para restaurar uma pasta partilhada:</h4>
<ol>
<li>Seleccione uma pasta partilhada que deseja restaurar.
<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma vers&atilde;o de instant&acirc;neo da qual deseja restaurar.</li>
<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Restaurar em substitui&ccedil;&atilde;o</strong> da lista de selec&ccedil;&atilde;o.</li>
<li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h4>Para clonar um instant&acirc;neo para uma nova pasta partilhada:</h4>
<ol>
<li>Seleccione uma pasta partilhada que deseja clonar.</li>
<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
<li>Seleccione uma vers&atilde;o de instant&acirc;neo que deseja clonar para uma nova pasta partilhada.</li>
<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Clonar com um novo nome</strong> da lista de selec&ccedil;&atilde;o.</li>
<li>Ser&aacute; redireccionado para a p&aacute;gina <strong>Clonar</strong> no <strong>Painel de Controlo</strong> &gt; <strong>Pasta Partilhada</strong> &gt; <strong>Criar</strong>. Introduza o nome da pasta partilhada clonada e clique em <strong>OK</strong> para terminar.</li>
</ol>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>N&atilde;o &eacute; poss&iacute;vel restaurar os &quot;homes&quot; da pasta partilhada.</li>
	<li>A pasta partilhada clonada n&atilde;o pode estar encriptada.</li>
	<li>Se for tirado um instant&acirc;neo quando est&aacute; a decorrer uma transfer&ecirc;ncia de quaisquer ficheiros, n&atilde;o pode ser garantida a consist&ecirc;ncia dos dados.</li>
	<li>Limita&ccedil;&otilde;es em pastas partilhadas encriptadas:
		<ul>
			<li>Nenhum tipo de recupera&ccedil;&atilde;o est&aacute; dispon&iacute;vel para pastas partilhadas montadas e encriptadas.</li>
			<li><strong>Clonar com um novo nome</strong> n&atilde;o est&aacute; dispon&iacute;vel para pastas partilhadas encriptadas.</li>
			<li>Pastas partilhadas encriptadas e desmontadas podem ser restauradas a partir de instant&acirc;neos tirados anteriormente, usando <strong>Restaurar em substitui&ccedil;&atilde;o</strong>.</li>
		</ul>
	</li>
</ul>
</div>



<h3>iSCSI LUN</h3>
<h4>Para restaurar um iSCSI LUN:</h4>
<ol>
  <li>Selecione um iSCSI LUN que pretende restaurar.</li>
	<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
	<li>Seleccione uma vers&atilde;o de instant&acirc;neo da qual deseja restaurar.</li>
	<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Restaurar em substitui&ccedil;&atilde;o</strong> da lista de selec&ccedil;&atilde;o.</li>
  <li>Ver&aacute; uma mensagem de confirma&ccedil;&atilde;o. Clique em <strong>Sim</strong> para confirmar a ac&ccedil;&atilde;o.</li>
</ol>

<h4>Para clonar um instant&acirc;neo para um novo iSCSI LUN:</h4>
<ol>
	<li>Selecione o iSCSI LUN que pretende clonar.</li>
	<li>Clique em <strong>Recupera&ccedil;&atilde;o</strong>.</li>
	<li>Seleccione uma vers&atilde;o de instant&acirc;neo que deseja clonar para um novo iSCSI LUN.</li>
	<li>Clique em <strong>Ac&ccedil;&atilde;o</strong>, e seleccione <strong>Clonar com um novo nome</strong> da lista de selec&ccedil;&atilde;o.</li>
	<li>Ser&aacute; redireccionado para a p&aacute;gina <strong>Clonar</strong> no <strong>Gestor de Armazenamento</strong> &gt; <strong>iSCSI LUN</strong>. Introduza o nome do iSCSI LUN clonado e clique em <strong>OK</strong> para terminar.</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>Se for tirado um instant&acirc;neo quando est&aacute; a decorrer uma transfer&ecirc;ncia de quaisquer ficheiros, n&atilde;o pode ser garantida a consist&ecirc;ncia dos dados.</li>
</ul>
</div>

</body>
</html>
