<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Contactar Suporte</title>



<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>



</head>
<body>

<h2>Contactar Suporte</h2>
<p>O Centro de Suporte da Synology &eacute; um recurso experiente que ir&aacute; prestar assist&ecirc;ncia em caso de problemas com o DiskStation durante o per&iacute;odo de garantia do produto. Estamos aqui para ajudar a assegurar e manter um desempenho perfeito do seu DiskStation. Para utilizar este servi&ccedil;o e enviar um bilhete de suporte, aceda a <b>Centro de Suporte</b> &gt; <b>Contactar Suporte</b>.</p>

<h4>Leia antes de iniciar um novo bilhete de suporte:</h4>
<ul>
<li>Para poupar tempo, &eacute; recomend&aacute;vel pesquisar a <a href="http://www.synology.com/support/knowledge_base" target="_blank">Base de Recursos</a> antes de iniciar um novo bilhete de suporte, uma vez que &eacute; prov&aacute;vel que a sua pergunta j&aacute; tenha sido feita e que tenhamos criado um artigo para a mesma.
</li>
<li>Pode utilizar a sua <a href="https://account.synology.com/support/register" target="_blank">Conta Synology</a> ou o endere&ccedil;o de e-mail da sua prefer&ecirc;ncia para dar in&iacute;cio a um novo bilhete de suporte do DSM.</li>
<li>&Eacute; necess&aacute;rio preencher todos os campos obrigat&oacute;rios no novo bilhete de suporte.
</li>
<li>Para evitar falhas de compreens&atilde;o, envie o bilhete de suporte em <b>ingl&ecirc;s</b> ou <b>chin&ecirc;s</b>.
</li>
</ul>

<h4>Sugest&otilde;es para iniciar um novo bilhete de suporte:</h4>
<ul>
<li>Descreva o problema que est&aacute; a comunicar e inclua eventuais passos que tenha tomado para resolv&ecirc;-lo individualmente. Inclua detalhes que ajudem os engenheiros de suporte t&eacute;cnico da Synology a compreender o problema. Se poss&iacute;vel, forne&ccedil;a passos numerados, incluindo capturas de ecr&atilde; que reproduzam a situa&ccedil;&atilde;o.
</li>
<li>O nosso sistema de suporte remover&aacute; anexos com mais de 4 MB.
</li>
</ul>

<h4>O que esperar depois de enviar um bilhete de suporte:</h4>
<ul>
<li>Pouco depois do envio do bilhete de suporte, ser&aacute; contactado por um engenheiro de suporte t&eacute;cnico da Synology.
</li>
<li>Em caso de n&atilde;o entrarmos em contacto, &eacute; muito importante que se certifique de que estes e-mails n&atilde;o est&atilde;o bloqueados pelo software de seguran&ccedil;a do computador ou da rede.
</li>
<li>Cada bilhete de suporte possui um ID exclusivo e este ID est&aacute; inclu&iacute;do no assunto dos e-mails enviados em resposta ao bilhete de suporte.
</li>
<li>Os nossos engenheiros de suporte t&eacute;cnico poder&atilde;o pedir-lhe que active o acesso remoto no seu DiskStation para realizar um diagn&oacute;stico aprofundado a partir de um Escrit&oacute;rio da Synology. Consulte os <a href="support_services.html">Servi&ccedil;os de Suporte</a> para obter instru&ccedil;&otilde;es detalhadas.
</li>
</ul>

</body>
</html>