<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Optionen</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="leaf_user"></a>Konto</h2>

<p>Die Konto-Registerkarte bietet Optionen, um grundlegende Kontoeinstellungen wie Beschreibung, Passwort, E-Mail und 2-Schritt-Verifizierung zu bearbeiten. Zum Anzeigen dieser Registerkarte klicken Sie auf das Figur-f&ouml;rmige Symbol in der oberen rechten Desktop-Ecke und w&auml;hlen Sie <strong>Optionen</strong>.</p>



<h3>&Auml;ndern von Kontoeinstellungen</h3>

<p>Die folgenden Kontoeinstellungen k&ouml;nnen bearbeitet werden:</p>
<ul>
<li><strong>Beschreibung:</strong> Geben Sie eine Beschreibung Ihres Kontos ein. Benutzerbeschreibungen d&uuml;rfen bis zu 64 anzeigbare Unicode-Zeichen enthalten.</li>
<li><strong>Neues Passwort:</strong> Wenn Sie das Passwort Ihres Kontos &auml;ndern m&ouml;chten, geben Sie hier ein neues ein und best&auml;tigen Sie es im unteren Feld <strong>Passwort best&auml;tigen</strong>. Bei Passw&ouml;rtern wird die Gro&szlig;-/Kleinschreibung ber&uuml;cksichtigt und sie k&ouml;nnen aus bis zu 127 Zeichen einschlie&szlig;lich Buchstaben, Zahlen, Symbolen und Leerzeichen bestehen.</li>
<li><strong>E-Mail:</strong> Geben Sie eine E-Mail-Adresse ein (nur f&uuml;r Nicht-Admin-Benutzer).</li>
<li><strong>Anzeigesprache:</strong> Legen Sie die Anzeigesprache f&uuml;r Ihr Konto fest. Die Einstellungen der Anzeigesprache, die Sie hier festlegen, haben Priorit&auml;t &uuml;ber die unter <b>Systemsteuerung</b> &gt; <b>Regionale Optionen</b> &gt; <b>Sprache</b> festgelegten Sprachen.</li>
</ul>
<p>Klicken Sie nach dem &Auml;ndern der Kontoeinstellungen auf <b>OK</b>, um die &Auml;nderungen zu speichern.</p>


<h3>2-Stufen-Verifizierung</h3>

<p>Die 2-Stufen-Verifizierung bietet eine gesteigerte Sicherheit f&uuml;r Ihr DSM-Konto. Wenn die 2-Stufen-Verifizierung aktiviert ist, m&uuml;ssen Sie Ihr Passwort sowie einen einmaligen Verifizierungscode bei der Anmeldung in DSM eingeben. Verifizierungscodes erhalten Sie von Authentifizierungs-Apps, die auf Ihrem Mobilger&auml;t installiert sind. Wenn jemand auf Ihr Konto zugreifen m&ouml;chte, wird er nicht nur Ihren Benutzernamen und das Passwort ben&ouml;tigen, sondern auch Ihr Mobilger&auml;t.</p>

<div class="section">
<h4>Anforderungen:</h4>
<p>Die 2-Stufen-Verifizierung erfordert ein Mobilger&auml;t und eine Authentifizierungs-App, die das Protokoll &bdquo;Time-based One-Time Password (TOTP)&ldquo; unterst&uuml;tzt. Authentifizierungs-Apps sind Google Authenticator (Android/iPhone/BlackBerry) oder Authenticator (Windows Phone).</p>
</div>

<h4>2-Stufen-Verifizierung aktivieren:</h4>

<ol>
<li>Wechseln Sie zur Registerkarte <strong>Optionen</strong> &gt; <strong>Konto</strong>, und markieren Sie die Option <strong>2-Stufen-Verifizierung aktivieren</strong>, um den Einrichtungsassistenten f&uuml;r die 2-Stufen-Verifizierung zu starten.</li>
<li>Geben Sie im ersten Fenster eine E-Mail-Adresse ein. Notfall-Verifizierungscodes k&ouml;nnen an diese E-Mail-Adresse gesendet werden, wenn Ihr Mobilger&auml;t verloren geht.</li>
<li>Laden Sie eine Authentifizierungs-App z.&nbsp;B. Google Authenticator (Android/iPhone/BlackBerry) oder Authenticator (Windows Phone) herunter und installieren Sie sie.</li>
<li>&Ouml;ffnen Sie die Authentifizierungs-App im n&auml;chsten Fenster und scannen Sie den QR-Code. Alternativ k&ouml;nnen Sie auch auf den Link klicken, um manuell einen geheimen Schl&uuml;ssel oder &bdquo;Secret Key&ldquo; einzugeben.</li>
<li>Die Authentifizierungs-App erstellt daraufhin einen 6-stelligen Verifizierungscode. Geben Sie diesen Code in das Textfeld im Assistenten ein, um zu best&auml;tigen, dass die Konfigurationen korrekt sind. Wenn ein Fehler auftritt, stellen Sie bitte sicher, dass die Systemzeit Ihres Mobilger&auml;tes mit der Systemzeit des DSM synchronisiert ist. Verifizierungscodes werden zudem von Zeit zu Zeit aktualisiert. Stellen Sie daher sicher, dass der von Ihnen eingegebene Code nicht abgelaufen ist.</li>
<li>Klicken Sie nach dem Abschluss des Einrichtungsassistenten auf <strong>OK</strong>, um die Einstellungen zu speichern.</li>
</ol>



<h4>Anmeldung bei DSM mit 2-Stufen-Verifizierung:</h4>

<p>Wenn die 2-Stufen-Verifizierung aktiviert ist, werden Sie zur Eingabe eines 6-stelligen Verifizierungscodes aufgefordert, wenn Sie sich bei DSM anmelden m&ouml;chten.</p>

<ol>
<li>Geben Sie Ihren Benutzernamen und das Passwort wie gewohnt im DSM-Anmeldefenster ein.</li>
<li>Wenn Sie zur Eingabe eines Verifizierungscodes aufgefordert werden, &ouml;ffnen Sie die Authentifizierungs-App auf Ihrem Mobilger&auml;t.</li>
<li>Suchen und geben Sie den 6-stelligen Verifizierungscode f&uuml;r Ihr Konto ein. Wenn Sie Ihr Mobilger&auml;t verloren haben, k&ouml;nnen Sie auf den Link <b>Telefon verloren?</b> klicken, dann wird ein Notfallcode an Ihre E-Mail-Adresse gesendet.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li><strong>SMTP-Einstellungen:</strong> Um Notfallcodes per E-Mail erhalten zu k&ouml;nnen, m&uuml;ssen die SMTP-Servereinstellungen unter <b>Systemsteuerung</b> &gt; <b>Benachrichtigung</b> korrekt eingerichtet sein.</li>
<li><strong>Notfallcode-Limit:</strong> Jeder Benutzer hat ein Limit von 5 Notfallcodes. Wenn Sie dieses Limit &uuml;berschreiten, m&uuml;ssen Sie die 2-Stufen-Verifizierung deaktivieren und aktivieren, bevor Sie weitere Notfallcodes erhalten k&ouml;nnen.</li>
</ul>
</div>


<h4>2-Stufen-Verifizierungseinstellungen zur&uuml;cksetzen:</h4>

<p>Benutzer, die zur Gruppe <strong>administrators</strong> geh&ouml;ren, k&ouml;nnen die 2-Stufen-Verifizierung anderer Benutzer zur&uuml;cksetzen.<ol>
<li>Gehen Sie zu <strong>Systemsteuerung</strong> &gt; <strong>Benutzer</strong>.</li>
<li>Doppelklicken Sie auf den Benutzer, dessen 2-Stufen-Verifizierung Sie zur&uuml;cksetzen m&ouml;chten.</li>
<li>Klicken Sie auf der Registerkarte <strong>Benutzerinformationen</strong> auf die Schaltfl&auml;che <strong>2-Stufen-Verifizierung zur&uuml;cksetzen</strong>.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<p>Wenn kein Benutzer der Gruppe <strong>administrators</strong> verf&uuml;gbar ist, k&ouml;nnen Sie die physische Reset-Taste am DiskStation dr&uuml;cken, um die DSM-Einstellungen zur&uuml;ckzusetzen und die 2-Stufen Verifizierung zu deaktivieren.</p>
</div>


<h3>Kontoaktivit&auml;t</h3>
<p>Die Kontoaktivit&auml;t zeigt die Anmeldeaktivit&auml;t Ihres DSM-Kontos an, z.&nbsp;B. aktuelle Verbindungen oder den Anmeldeverlauf.</p>

<h4>Kontoaktivit&auml;t &uuml;berpr&uuml;fen:</h4>
<p>Klicken Sie auf die Schaltfl&auml;che <strong>Kontoaktivit&auml;t</strong>. Ein Popup-Fenster mit den folgenden Registerkarten wird angezeigt:<ul>
<li><strong>Verbundene Benutzer:</strong> Diese Registerkarte zeigt die unten stehenden Informationen:<ul>
<li><strong>Datum &amp; Zeit:</strong> Wann auf das Konto zugegriffen wurde.</li>
<li><strong>Client-Name und IP:</strong> Name und IP-Adresse des Ger&auml;tes, das auf das Konto zugegriffen hat. Der Client-Name wird nur angezeigt, wenn &uuml;ber das CIFS-Protokoll auf das Konto zugegriffen wurde.</li>
<li><strong>Dienst:</strong> Das f&uuml;r den Zugriff auf das Konto verwendete Protokoll.</li>
<li><strong>Ressource:</strong> Die vom Konto verwendeten Systemressourcen.</li>
</ul></li>
<li><strong>Anmeldeverlauf:</strong> Diese Registerkarte zeigt letzte Anmeldesitzungen und die unten stehenden Informationen an:<ul>
<li><strong>Datum &amp; Zeit:</strong> Wann auf das Konto zugegriffen wurde.</li>
<li><strong>Ereignis:</strong> Zeigt Benutzername und IP-Adresse.</li>
</ul>
</li>
</ul>


</body>
</html>