<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Options</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_user"></a>Autres</h2>
<p>Vous pouvez personnaliser les autres options du compte personnel dans <strong>Options</strong> &gt; <strong>Autres</strong></p>

<h4>Pour personnaliser d'autres options personnelles&nbsp;:</h4>
<ol>
<li>Choisissez l&rsquo;une des options suivantes&nbsp;:
<ul>
<li><b>Ne pas afficher la bo&icirc;te de dialogue de confirmation &agrave; la fermeture de DSM :</b>Ignorer la bo&icirc;te de confirmation lorsque vous fermez la fen&ecirc;tre du navigateur&nbsp;:</li>
<li><b>Reprendre DSM &agrave; mon statut de d&eacute;connexion pr&eacute;c&eacute;dent lorsque je me connecte :</b> Se souvenir des applications ou des paquets ouverts et les restaurer la prochaine fois que vous vous connectez ou que vous rafra&icirc;chissez la fen&ecirc;tre de navigation.</li>
<li><b>Activer la pr&eacute;visualisation instantan&eacute;e sur la barre des t&acirc;ches :</b>Affichez un aper&ccedil;u rapide d&rsquo;une application ouverte quand vous passez sur son ic&ocirc;ne d&rsquo;application sur la barre des t&acirc;ches&nbsp;:

</li>
<li><strong>Activer les notifications du navigateur sur le bureau :</strong> Afficher les notifications depuis votre navigateur web sur le bureau DSM.
  
   Les notifications du navigateur sur le bureau sont prises en charge par Google Chrome et Safari seulement. Selon la version de votre navigateur Web, la page des param&egrave;tres de notification peut &ecirc;tre diff&eacute;rente. Veuillez aller &agrave; la page des param&egrave;tres de votre navigateur pour g&eacute;rer les param&egrave;tres des notifications.</li>
</ul>
<li>
Cliquez sur <b>OK</b>.
</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>La pr&eacute;visualisation instantan&eacute;e n'est pas prise en charge par Internet Explorer.</li>
</ul>
</div>

</body>
</html>