<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Aufgabenplaner</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Aufgabenplaner</h1>
<p>Mit dem Aufgabenplaner k&ouml;nnen Sie Dienste oder Skripte planen und zu bestimmten Zeiten ausf&uuml;hren.</p>
<h2>Unterst&uuml;tzte Aufgaben</h2>
<p>Aufgaben k&ouml;nnen f&uuml;r Folgendes erstellt werden:</p>
<ul class="disable-eds14">
<li><strong>Benutzer-definiertes Skript:</strong> F&uuml;hren Sie benutzerdefinierte Skripte oder Befehle aus.</li>
<li><strong>Papierkorb:</strong> Leeren Sie den Papierkorb von bestimmten gemeinsamen Ordnern. &Uuml;ber die Einstellungen der <strong>Beibehaltungsrichtlinie</strong> k&ouml;nnen Sie au&szlig;erdem regeln, welche Dateien beim Leeren des Papierkorbs endg&uuml;ltig gel&ouml;scht werden. Dateien k&ouml;nnen z.&nbsp;B. nach Gr&ouml;&szlig;e, L&ouml;schzeitpunkt oder Dateiformat gel&ouml;scht oder beibehalten werden.</li>
<li><strong>Signalton-Steuerung:</strong> Lassen Sie den DiskStation einen Signalton abgeben.</li> 
<li><strong>Dienst:</strong> Starten oder stoppen Sie Netzwerkdienste z.&nbsp;B. Windows Dateidienst, FTP, Automatische Blockierung usw.</li>
</ul>


<ul class="enable-eds14">
<li><strong>Benutzer-definiertes Skript:</strong> F&uuml;hren Sie benutzerdefinierte Skripte oder Befehle aus.</li>
<li><strong>Papierkorb:</strong> Leeren Sie den Papierkorb von bestimmten gemeinsamen Ordnern. &Uuml;ber die Einstellungen der <strong>Beibehaltungsrichtlinie</strong> k&ouml;nnen Sie au&szlig;erdem regeln, welche Dateien beim Leeren des Papierkorbs endg&uuml;ltig gel&ouml;scht werden. Dateien k&ouml;nnen z.&nbsp;B. nach Gr&ouml;&szlig;e, L&ouml;schzeitpunkt oder Dateiformat gel&ouml;scht oder beibehalten werden.</li>
<li><strong>Dienst:</strong> Starten oder stoppen Sie Netzwerkdienste z.&nbsp;B. Windows Dateidienst, FTP, Automatische Blockierung usw.</li>
</ul>


<h2>Aufgaben verwalten</h2>
<p>Die Hauptseite des Aufgabenplaners zeigt s&auml;mtliche Aufgaben an und bietet Optionen zum Erstellen, Bearbeiten oder Ausf&uuml;hren von Aufgaben.</p>
<h4>Erstellen einer Aufgabe:</h4>
<ol>
<li>Klicken Sie auf <strong>Erstellen</strong> und w&auml;hlen Sie den Aufgabentyp, den Sie planen m&ouml;chten.</li>
<li>Wenn das Fenster <strong>Aufgabe erstellen</strong> angezeigt wird, &auml;ndern Sie die folgenden Einstellungen auf der Registerkarte <strong>Allgemein</strong>:</li>
<ul>
<li><strong>Allgemeine Einstellungen:</strong> Geben Sie einen Aufgabennamen ein, w&auml;hlen Sie einen Benutzernamen und aktivieren oder deaktivieren Sie eine Aufgabe. </li>
<li><strong>Andere Einstellungen:</strong> Auf dieser Registerkarte k&ouml;nnen zus&auml;tzliche aufgabenspezifische Einstellungen ge&auml;ndert werden (nur f&uuml;r bestimmte Aufgaben). Wenn Sie zum Beispiel eine Aufgabe zum Leeres eines Papierkorbs erstellen, m&uuml;ssen Sie den Papierkorb eines bestimmten gemeinsamen Ordners ausw&auml;hlen.</li>
</ul>
<li>Auf der Registerkarte <strong>Zeitplan</strong> k&ouml;nnen Sie die folgenden Einstellungen &auml;ndern:</li>
<ul>
<li><strong>Datum:</strong> Geben Sie an, wann die Aufgabe ausgef&uuml;hrt werden soll. Aufgaben k&ouml;nnen an bestimmten Tagen der Woche (z.&nbsp;B. t&auml;glich, am Wochenende, jeden Sonntag usw.) oder an bestimmten Daten (z.&nbsp;B. 21.10.2015) ausgef&uuml;hrt werden.</li>
<li><strong>Zeit:</strong> Geben Sie an, wie oft die Aufgabe pro Tag laufen soll, sowie die erste und letzte Ausf&uuml;hrungszeit.</li>
</ul>
<li>Auf der Registerkarte <strong>Aufgabeneinstellungen</strong> k&ouml;nnen aufgabenspezifische Einstellungen ge&auml;ndert werden (nur f&uuml;r bestimmte Aufgaben).</li>
</ul>
<li>Klicken Sie zum Beenden auf <strong>OK</strong>.</li>
</ol>
<h4>So bearbeiten Sie Aufgabeneinstellungen:</h4>
<ol>
<li>W&auml;hlen Sie eine Aufgabe aus.</li>
<li>Klicken Sie auf <strong>Bearbeiten</strong>.</li>
<li>Ein Fenster zum Bearbeiten der Aufgabeneinstellungen wird angezeigt.</li>
</ol>
<h4>L&ouml;schen einer Aufgabe:</h4>
<ol>
<li>W&auml;hlen Sie eine Aufgabe aus.</li>
<li>Klicken Sie auf <strong>L&ouml;schen</strong>.</li>
</ol>

<h4>So aktivieren oder deaktivieren Sie eine Aufgabe:</h4>
<ol>
<li>Aktivieren oder deaktivieren Sie auf der Hauptseite von <strong>Aufgabenplaner</strong> das entsprechende Kontrollk&auml;stchen unter <strong>Aktiviert</strong>, um eine Aufgabe zu aktivieren oder zu deaktivieren.</li>
<li>Klicken Sie auf <strong>Speichern</strong>.</li>
</ol>


<h4>Eine Aufgabe manuell ausf&uuml;hren:</h4>
<ol>
<li>W&auml;hlen Sie eine oder mehrere Aufgaben aus.</li>
<li>Klicken Sie auf <strong>Ausf&uuml;hren</strong>.</li>
</ol>

<div class="section">
<h4>Aufgabenplaner-Einschr&auml;nkungen:</h4>
<ul class="disable-eds14">
<li>Aufgabennamen k&ouml;nnen bis zu 512 anzeigbare Zeichen enthalten.</li>
<li>Maximale Anzahl an Aufgaben: 1024.</li>
<li>Maximall&auml;nge des Skript-Pfades oder der Befehlszeile: 4095.</li>
<li>Die Signaldauer kann zwischen 1 und 600 Sekunden eingestellt werden.</li>
</ul>


<ul class="enable-eds14">
<li>Aufgabennamen k&ouml;nnen bis zu 512 anzeigbare Zeichen enthalten.</li>
<li>Maximale Anzahl an Aufgaben: 1024.</li>
<li>Maximall&auml;nge des Skript-Pfades oder der Befehlszeile: 4095.</li>
</ul>

</div>

</body> </html>
