<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="session"></a>S&eacute;curit&eacute;</h2>

<p>Vous pouvez modifier les param&egrave;tres de s&eacute;curit&eacute; suivants dans <strong>Panneau de configuration</strong> &gt; <strong>S&eacute;curit&eacute;</strong> &gt; <strong>S&eacute;curit&eacute;</strong> pour les sessions de navigation DSM :</p>

<ul>
<li><strong>Heure de d&eacute;connexion (minutes)</strong>  Les utilisateurs seront automatiquement d&eacute;connect&eacute;s de DSM s&apos;ils sont inactifs pendant la p&eacute;riode de temps sp&eacute;cifi&eacute;e ici. Saisissez une valeur entre 1 et 65535.</li>
<li><strong>Am&eacute;liorez la compatibilit&eacute; du navigateur en ignorant la v&eacute;rification de l&rsquo;IP&nbsp;:</strong> Si vous acc&eacute;dez au DiskStation via un proxy HTTP et que des d&eacute;connexions al&eacute;atoires surviennent, vous pouvez activer cette option pour ignorer la v&eacute;rification de l&apos;IP.</li>
<li><strong>Am&eacute;liorer la protection contre les falsifications de requ&ecirc;tes inter-site</strong> Cette option am&eacute;liore la protection du syst&egrave;me contre les attaques de scripts intersite. Cette option prendra effet la prochaine fois que vous vous connecterez dans DSM.</li>
<li><strong>Ne pas permettre que DSM soit incorpor&eacute; dans iFrame :</strong> Cette option permet d&apos;emp&ecirc;cher d&apos;autres sites web d&apos;embarquer DSM dans d&apos;autres pages web avec iFrame, emp&ecirc;chant ainsi certains types d&apos;attaques &eacute;manant de sites mal intentionn&eacute;s. L&apos;on peut autoriser des sites web &agrave; embarquer DSM avec iFrame en cliquant sur le bouton <strong>Sites autoris&eacute;s</strong>.</li>
</ul>


</body>
</html>

