<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Planificateur de t&acirc;ches</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Planificateur de t&acirc;ches</h1>
<p>Le Planificateur de t&acirc;ches vous permet de planifier et d&apos;ex&eacute;cuter des services ou des scripts &agrave; des horaires pr&eacute;d&eacute;finis.</p>
<h2>T&acirc;ches prises en charge</h2>
<p>Des t&acirc;ches peuvent &ecirc;tre cr&eacute;&eacute;es pour faire ce qui suit&nbsp;:</p>
<ul class="disable-eds14">
<li><strong>Script d&eacute;fini par l&apos;utilisateur :</strong> Ex&eacute;cuter des commandes ou des scripts d&eacute;finis par l&apos;utilisateur.</li>
<li><strong>Corbeille :</strong> Vider la corbeille de certains dossiers partag&eacute;s sp&eacute;cifiques. De plus, les param&egrave;tres de <strong>la politique de conservation</strong> vous permettent de d&eacute;terminer les fichiers qui doivent &ecirc;tre d&eacute;finitivement supprim&eacute;s lorsque vous videz la corbeille. Par exemple, les fichiers peuvent &ecirc;tre supprim&eacute;s ou conserv&eacute;s selon leur taille, leur temps de suppression ou le format de fichier.</li>
<li><strong>Contr&ocirc;le du bip&nbsp;:</strong> Fait biper le DiskStation.</li> 
<li><strong>Service&nbsp;:</strong> D&eacute;marre ou arr&ecirc;te les services r&eacute;seau, tels que le Service de fichiers Windows, FTP, Blocage auto, etc.</li>
</ul>


<ul class="enable-eds14">
<li><strong>Script d&eacute;fini par l&apos;utilisateur :</strong> Ex&eacute;cuter des commandes ou des scripts d&eacute;finis par l&apos;utilisateur.</li>
<li><strong>Corbeille :</strong> Vider la corbeille de certains dossiers partag&eacute;s sp&eacute;cifiques. De plus, les param&egrave;tres de <strong>la politique de conservation</strong> vous permettent de d&eacute;terminer les fichiers qui doivent &ecirc;tre d&eacute;finitivement supprim&eacute;s lorsque vous videz la corbeille. Par exemple, les fichiers peuvent &ecirc;tre supprim&eacute;s ou conserv&eacute;s selon leur taille, leur temps de suppression ou le format de fichier.</li>
<li><strong>Service&nbsp;:</strong> D&eacute;marre ou arr&ecirc;te les services r&eacute;seau, tels que le Service de fichiers Windows, FTP, Blocage auto, etc.</li>
</ul>


<h2>Gestion des t&acirc;ches</h2>
<p>La page principale du Planificateur de t&acirc;ches affiche toutes les t&acirc;ches existantes et fournit des options pour cr&eacute;er, modifier ou ex&eacute;cuter des t&acirc;ches.</p>
<h4>Pour cr&eacute;er une t&acirc;che&nbsp;:</h4>
<ol>
<li>Cliquez sur <strong>Cr&eacute;er</strong> et s&eacute;lectionnez le type de t&acirc;che que vous souhaitez planifier.</li>
<li>Quand la fen&ecirc;tre <strong>Cr&eacute;er une t&acirc;che</strong> appara&icirc;t, modifiez les param&egrave;tres suivant sur l&apos;onglet <strong>G&eacute;n&eacute;ralit&eacute;s</strong>&nbsp;:</li>
<ul>
<li><strong>Param&egrave;tres g&eacute;n&eacute;raux&nbsp;:</strong> Saisissez un nom de t&acirc;che, s&eacute;lectionnez un utilisateur, et activez ou d&eacute;sactivez la t&acirc;che. </li>
<li><strong>Autres param&egrave;tres&nbsp;:</strong> Des param&egrave;tres suppl&eacute;mentaires sp&eacute;cifiques &agrave; la t&acirc;che peuvent &ecirc;tre modifi&eacute;s dans cet onglet (uniquement pour certaines t&acirc;ches). Par exemple, lorsque vous cr&eacute;ez une t&acirc;che pour vider une corbeille, vous devez s&eacute;lectionner la corbeille d&apos;un certain dossier partag&eacute;.</li>
</ul>
<li>Sur l&apos;onglet <strong>Planification</strong>, modifiez les param&egrave;tres suivants&nbsp;:</li>
<ul>
<li><strong>Date&nbsp;:</strong> Sp&eacute;cifiez le moment d&apos;ex&eacute;cution de cette t&acirc;che. Les t&acirc;ches peuvent &ecirc;tre planifi&eacute;es pour s&apos;ex&eacute;cuter certains jours de la semaine (par ex. tous les jours, les weekends ou tous les dimanches, etc.) ou &agrave; des dates sp&eacute;cifiques (par exemple le 21/10/2015).</li>
<li><strong>Nbre de fois :</strong> Sp&eacute;cifiez combien de fois la t&acirc;che s&apos;ex&eacute;cute chaque jour, ainsi que la premi&egrave;re et la derni&egrave;re heure d&apos;ex&eacute;cution.</li>
</ul>
<li>Modifiez les param&egrave;tres sp&eacute;cifiques &agrave; la t&acirc;che sur l&apos;onglet <strong>Param&egrave;tres de t&acirc;che</strong> (uniquement pour certaines t&acirc;ches).</li>
</ul>
<li>Cliquez sur <strong>OK</strong> pour terminer</li>
</ol>
<h4>Pour modifier les param&egrave;tres de t&acirc;che&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez une t&acirc;che existante.</li>
<li>Cliquez sur <strong>Modifier</strong>.</li>
<li>Une fen&ecirc;tre appara&icirc;t dans laquelle vous pouvez modifier les param&egrave;tres de la t&acirc;che.</li>
</ol>
<h4>Pour supprimer une t&acirc;che&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez une t&acirc;che existante.</li>
<li>Cliquez sur <strong>Supprimer</strong>.</li>
</ol>

<h4>Pour activer/d&eacute;sactiver une t&acirc;che&nbsp;:</h4>
<ol>
<li>Sur la page principale du <strong>Planificateur de t&acirc;ches</strong>, cochez ou d&eacute;cochez la case appropri&eacute;e sous <strong>Activ&eacute;</strong> pour activer ou d&eacute;sactiver une t&acirc;che.</li>
<li>Cliquez sur <strong>Sauvegarder</strong>.</li>
</ol>


<h4>Pour ex&eacute;cuter manuellement une t&acirc;che&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez une ou plusieurs t&acirc;ches existantes.</li>
<li>Cliquez sur <strong>Ex&eacute;cuter</strong>.</li>
</ol>

<div class="section">
<h4>Limites du Planificateur de t&acirc;ches</h4>
<ul class="disable-eds14">
<li>Les noms de t&acirc;ches peuvent comprendre 512 caract&egrave;res affichables.</li>
<li>Nombre maximum de t&acirc;ches&nbsp;: 1024.</li>
<li>Longueur maximale du chemin du script ou de la ligne de commande&nbsp;: 4095.</li>
<li>La dur&eacute;e du bip peut &ecirc;tre d&eacute;finie de 1 &agrave; 600 secondes.</li>
</ul>


<ul class="enable-eds14">
<li>Les noms de t&acirc;ches peuvent comprendre 512 caract&egrave;res affichables.</li>
<li>Nombre maximum de t&acirc;ches&nbsp;: 1024.</li>
<li>Longueur maximale du chemin du script ou de la ligne de commande&nbsp;: 4095.</li>
</ul>

</div>

</body> </html>
