<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>N&aacute;pověda aplikace DSM &ndash; Spr&aacute;vce ochrany dat</title>
<meta name="author" content="Synology Inc.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="utf-8">
</head>
<body>
<h1>Spr&aacute;vce ochrany dat</h1>
<p>Spr&aacute;vce ochrany dat je specialista v oblasti z&aacute;lohov&aacute;n&iacute; a obnovy dat. Firmy potřebuj&iacute; ochranu dat, aby přede&scaron;ly jejich ztr&aacute;tě v důsledku n&aacute;hodn&eacute;ho vymaz&aacute;n&iacute;, zhroucen&iacute; aplikac&iacute;, po&scaron;kozen&iacute; dat či virů.</p>

<p>&bdquo;<strong>Sn&iacute;mek</strong>&ldquo; představuje kopii k určit&eacute;mu okamžiku v čase uloženou na stejn&eacute;m svazku a slouž&iacute; k zaznamen&aacute;n&iacute; celkov&eacute;ho stavu dat v době poř&iacute;zen&iacute;. Sn&iacute;mky vyžaduj&iacute; pouze mal&eacute; množstv&iacute; dodatečn&eacute;ho &uacute;ložn&eacute;ho prostoru a nemaj&iacute; vliv na v&yacute;konnost. </p>

<p>S pomoc&iacute; sn&iacute;mků můžete rychle obnovit data do předchoz&iacute;ho okamžiku, kdy byl sn&iacute;mek poř&iacute;zen, pokud někdo z uživatelů data na svazku obsahuj&iacute;c&iacute;m sn&iacute;mky ne&uacute;myslně změn&iacute; nebo smaže. Uživatel&eacute; t&eacute;ž mohou obnovit svoje vlastn&iacute; odstraněn&eacute; nebo změněn&eacute; soubory ve sd&iacute;len&yacute;ch složk&aacute;ch bez pomoci spr&aacute;vce.</p>

<p>Spr&aacute;vce ochrany dat usnadňuje spr&aacute;vu a sledov&aacute;n&iacute; sn&iacute;mků na va&scaron;em DiskStation.</p>

<p><strong>Spr&aacute;vce ochrany dat</strong> v&aacute;m v z&aacute;vislosti na funkc&iacute;ch podporovan&yacute;ch va&scaron;&iacute;m DiskStation usnadn&iacute; prov&aacute;děn&iacute; těchto &uacute;kolů:</p>
<ul>
	<li>Vytv&aacute;řen&iacute; a spr&aacute;va sn&iacute;mků <strong>sd&iacute;len&yacute;ch složek*</strong> a jednotek <strong>iSCSI LUN</strong>.</li>
	<li>Konfigurace <strong>pl&aacute;novan&yacute;ch sn&iacute;mků</strong> a <strong>nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;</strong>. Tato nastaven&iacute; urč&iacute;, kdy a jak budou poř&iacute;zeny sn&iacute;mky, jak budou uchov&aacute;v&aacute;ny a odstraňov&aacute;ny.</li>
	<li>Zobrazen&iacute; protokolů ud&aacute;lost&iacute; t&yacute;kaj&iacute;c&iacute;ch se sn&iacute;mků.</li>
</ul>

<p>_____<br/> <strong>*</strong> Sn&iacute;mky sd&iacute;len&yacute;ch složek lze poř&iacute;dit pouze tehdy, pokud va&scaron;e &uacute;loži&scaron;tě použ&iacute;v&aacute; souborov&yacute; syst&eacute;m <strong>Btrfs</strong>.</p>

</body>
</html>