<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="UTF-8">
</head>
<body>
<h2>Sn&iacute;mky</h2>
	<p>Tato str&aacute;nka v&aacute;m umožňuje pořizovat, odstranit i upravovat sn&iacute;mky a d&aacute;le t&eacute;ž nastavit pravidla pro pl&aacute;nov&aacute;n&iacute; a uchov&aacute;v&aacute;n&iacute; sn&iacute;mků.</p>
    <p>Pro každou sd&iacute;lenou složku nebo iSCSI LUN můžete uložit až 256 kopi&iacute; sn&iacute;mku najednou. Sn&iacute;mky maj&iacute; minim&aacute;ln&iacute; n&aacute;roky na m&iacute;sto na disku, neboť neuchov&aacute;vaj&iacute; cel&eacute; soubory, ale jednotliv&eacute; bloky. K dodatečn&yacute;m n&aacute;rokům na diskov&yacute; prostor může doj&iacute;t při aktualizaci nebo odstraněn&iacute; sd&iacute;len&yacute;ch složek či bloků v jednotk&aacute;ch iSCSI LUN.</p>

<h3>Sd&iacute;len&aacute; složka</h3>
<h4>Jak vytvořit sn&iacute;mek sd&iacute;len&eacute; složky:</h4>
<ol>
  <li>Vyberte sd&iacute;lenou složku, jej&iacute;ž sn&iacute;mek chcete vytvořit.</li>
	<li>Klikněte na možnost <strong>Poř&iacute;dit sn&iacute;mek</strong>.</li>
	<li>V poli <strong>Popis</strong> uveďte popis pořizovan&eacute;ho sn&iacute;mku.</li>
	<li>Za&scaron;krtnut&iacute;m/od&scaron;krtnut&iacute;m pol&iacute;čka <strong>Uzamknout</strong> urč&iacute;te, zda při spu&scaron;těn&iacute; automatick&eacute;ho odebr&aacute;n&iacute; bude sn&iacute;mek ignorovat nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;.</li>
  <li>Kliknut&iacute;m na možnost <strong>OK</strong> začnete vytv&aacute;řet sn&iacute;mek.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
<ul><li>Z nastaven&iacute; na str&aacute;nce <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Sd&iacute;len&aacute; složka</strong> &gt; <strong>Upravit</strong> se do sn&iacute;mku ulož&iacute; pouze opr&aacute;vněn&iacute; Windows ACL.</li></ul>
</div>

<h4>Proch&aacute;zen&iacute; sn&iacute;mků sd&iacute;len&yacute;ch složek:</h4>
<ol>
  <li>Vyberte sd&iacute;lenou složku, jej&iacute;ž sn&iacute;mky chcete proch&aacute;zet.</li>
	<li>Klepněte na možnost <strong>Seznam sn&iacute;mků</strong>.</li>
  <li>Vyberte sn&iacute;mek, kter&yacute; chcete proch&aacute;zet, a&nbsp;klikněte na možnost <strong>Proch&aacute;zet</strong>.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
		<li>Volba <strong>Proch&aacute;zet</strong> sn&iacute;mky nen&iacute; funkčn&iacute; u za&scaron;ifrovan&yacute;ch sd&iacute;len&yacute;ch složek.</li>
		<li>Pokud nemůžete proch&aacute;zet sn&iacute;mek, přejděte do č&aacute;sti <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Sd&iacute;len&aacute; složka</strong> &gt; <strong>Upravit</strong> a aktivujte zde možnost <strong>Nastavit sn&iacute;mek jako viditeln&yacute;</strong>.</li>
	</ul>
</div>

<h4>Odstraněn&iacute; sn&iacute;mků sd&iacute;len&yacute;ch složek:</h4>
<ol>
	<li>Vyberte sd&iacute;lenou složku, jej&iacute;ž sn&iacute;mky chcete odstranit.</li>
	<li>Klepněte na možnost <strong>Seznam sn&iacute;mků</strong>.</li>
	<li>Vyberte jeden nebo v&iacute;ce sn&iacute;mků, kter&eacute; chcete odstranit, a&nbsp;klikněte na možnost <strong>Odstranit</strong>. (Pokud chcete vybrat v&iacute;ce položek, stiskněte a&nbsp;podržte kl&aacute;vesu Shift nebo Ctrl.)</li>
	<li>Zobraz&iacute; se potvrzuj&iacute;c&iacute; zpr&aacute;va. Odstraněn&iacute; potvrďte kliknut&iacute;m na možnost <strong>Odstranit</strong>.</li>
</ol>

<h4>&Uacute;prava sn&iacute;mků sd&iacute;len&yacute;ch složek:</h4>
<ol>
	<li>Vyberte sd&iacute;lenou složku, jej&iacute;ž sn&iacute;mky chcete upravit.</li>
	<li>Klepněte na možnost <strong>Seznam sn&iacute;mků</strong>.</li>
	<li>Vyberte sn&iacute;mek, kter&yacute; chcete upravit, a&nbsp;klikněte na možnost <strong>Upravit</strong>.</li>
	<li>V č&aacute;sti <strong>Popis</strong> můžete změnit popis sn&iacute;mku a za&scaron;krtnut&iacute;m/od&scaron;krtnut&iacute;m pol&iacute;čka <strong>Uzamknout</strong> urč&iacute;te, zda při spu&scaron;těn&iacute; automatick&eacute;ho odebr&aacute;n&iacute; bude sn&iacute;mek ignorovat nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;.</li>
	<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<h4>Nastaven&iacute; napl&aacute;novan&yacute;ch sn&iacute;mků:</h4>
<p>D&iacute;ky pl&aacute;novan&yacute;m sn&iacute;mkům bude Spr&aacute;vce ochrany dat automaticky pořizovat sn&iacute;mky v předem nastaven&eacute;m čase a intervalech, č&iacute;mž v&aacute;m u&scaron;etř&iacute; pr&aacute;ci s ručn&iacute;m vytv&aacute;řen&iacute;m sn&iacute;mků.</p>
<ol>
	<li>Vyberte sd&iacute;lenou složku.</li>
	<li>Klikněte na možnost <strong>Nastavit pl&aacute;n</strong>.</li>
	<li>V tabulce <strong>Pl&aacute;n</strong> za&scaron;krtněte pol&iacute;čko <strong>Aktivovat pl&aacute;n sn&iacute;mků</strong> a nastavte čas a frekvenci pořizov&aacute;n&iacute; sn&iacute;mků. Pl&aacute;novan&eacute; sn&iacute;mky pro tuto sd&iacute;lenou složku zru&scaron;&iacute;te od&scaron;krtnut&iacute;m tohoto pol&iacute;čka.</li>
  <li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
  <li>Zobraz&iacute; se potvrzuj&iacute;c&iacute; zpr&aacute;va. Konfiguraci ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<div class="section"><h4>Pozn&aacute;mka:</h4>
	<ul>
	  <li>Konfigurace pl&aacute;novan&yacute;ch sn&iacute;mků nebude souč&aacute;st&iacute; funkce <strong>Ovl&aacute;dac&iacute; panel</strong> &gt; <strong>Aktualizace a obnova</strong> &gt; <strong>Z&aacute;loha konfigurace</strong>.</li>
	</ul>
</div>

<h4>Konfigurace nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute; pl&aacute;novan&yacute;ch sn&iacute;mků:</h4>
<ol>
<li>Vyberte sd&iacute;lenou složku.</li>
<li>Klikněte na možnost <strong>Nastavit pl&aacute;n</strong>.</li>
<li>Vyberte tabulku <strong>Uchov&aacute;v&aacute;n&iacute;</strong>.</li>
<li>Nakonfigurujte svoje nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;. Vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
		<li><strong>Odstranit star&eacute; sn&iacute;mky po dosažen&iacute; limitu:</strong> Po dosažen&iacute; maxim&aacute;ln&iacute;ho počtu sn&iacute;mků budou nejstar&scaron;&iacute; sn&iacute;mky přeps&aacute;ny nově poř&iacute;zen&yacute;mi.</li>
		<li><strong>Vždy uchov&aacute;vat sn&iacute;mky:</strong> Po dosažen&iacute; maxim&aacute;ln&iacute;ho počtu sn&iacute;mků přestane Spr&aacute;vce ochrany dat pořizovat nov&eacute; sn&iacute;mky, aniž by odstranil již dř&iacute;ve poř&iacute;zen&eacute; sn&iacute;mky.</li>
		<li><strong>Uchov&aacute;vat sn&iacute;mky podle n&aacute;sleduj&iacute;c&iacute;ch pravidel:</strong> Pro určen&eacute; časov&eacute; intervaly můžete nastavit pravidla pro uchov&aacute;v&aacute;n&iacute;. Dal&scaron;&iacute; informace naleznete v&nbsp;pozn&aacute;mce <a href="#smart_retention">Pravidla pro uchov&aacute;v&aacute;n&iacute;</a></li>
	</ul>
</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>


<h3>Jednotka iSCSI&nbsp;LUN</h3>

<h4>Jak vytvořit sn&iacute;mek jednotky iSCSI LUN:</h4>
<ol>
<li>Vyberte jednotku iSCSI&nbsp;LUN, jej&iacute;ž sn&iacute;mek chcete vytvořit.</li>
<li>Klikněte na možnost <strong>Poř&iacute;dit sn&iacute;mek</strong>.</li>
<li>V poli <strong>Popis</strong> uveďte popis pořizovan&eacute;ho sn&iacute;mku.</li>
<li>V&yacute;běrem možnosti <strong>Ano</strong>/<strong>Ne</strong> v rozev&iacute;rac&iacute; nab&iacute;dce <strong>Uzamknout</strong> urč&iacute;te, zda při spu&scaron;těn&iacute; automatick&eacute;ho odebr&aacute;n&iacute; bude sn&iacute;mek ignorovat nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;.</li>
<li>Kliknut&iacute;m na možnost <strong>OK</strong> začnete vytv&aacute;řet sn&iacute;mek.</li>
</ol>

<h4>Jak odstranit sn&iacute;mek jednotky iSCSI LUN:</h4>
<ol>
<li>Vyberte jednotku iSCSI LUN, jej&iacute;ž sn&iacute;mky chcete odstranit.</li>
<li>Klepněte na možnost <strong>Seznam sn&iacute;mků</strong>.</li>
<li>Vyberte jeden nebo v&iacute;ce sn&iacute;mků, kter&eacute; chcete odstranit, a&nbsp;klikněte na možnost <strong>Odstranit</strong>. (Pokud chcete vybrat v&iacute;ce položek, stiskněte a&nbsp;podržte kl&aacute;vesu Shift nebo Ctrl.)</li>
<li>Zobraz&iacute; se potvrzuj&iacute;c&iacute; zpr&aacute;va. Odstraněn&iacute; potvrďte kliknut&iacute;m na možnost <strong>Ano</strong>.</li>
</ol>

<h4>Jak upravit sn&iacute;mek jednotky iSCSI LUN:</h4>
<ol>
<li>Vyberte jednotku iSCSI LUN, jej&iacute;ž sn&iacute;mky chcete upravit.</li>
<li>Klepněte na možnost <strong>Seznam sn&iacute;mků</strong>.</li>
<li>Vyberte sn&iacute;mek, kter&yacute; chcete upravit, a&nbsp;klikněte na možnost <strong>Upravit</strong>.</li>
<li>Sn&iacute;mek uprav&iacute;te proveden&iacute;m někter&eacute; z n&aacute;sleduj&iacute;c&iacute;ch činnost&iacute;:<ul>
	  <li>&Uacute;prava popisu sn&iacute;mku v č&aacute;sti <strong>Popis</strong>.</li>
	  <li>Vyberte <strong>Konzistentn&iacute; stav</strong>, jsou-li aktivov&aacute;ny <a href="#app-consistent">aplikačně-konzistentn&iacute;</a> sn&iacute;mky.</li>
	  <li>Přep&iacute;n&aacute;n&iacute;m mezi možnostmi <strong>Ano</strong>/<strong>Ne</strong> v rozev&iacute;rac&iacute; nab&iacute;dce <strong>Uzamknout</strong> urč&iacute;te, zda při spu&scaron;těn&iacute; automatick&eacute;ho odebr&aacute;n&iacute; bude sn&iacute;mek ignorovat nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;.</li>
	</ul>
</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<h4>Nastaven&iacute; napl&aacute;novan&yacute;ch sn&iacute;mků:</h4>
<p>D&iacute;ky pl&aacute;novan&yacute;m sn&iacute;mkům bude Spr&aacute;vce ochrany dat automaticky pořizovat sn&iacute;mky v předem nastaven&eacute;m čase a intervalech, č&iacute;mž v&aacute;m u&scaron;etř&iacute; pr&aacute;ci s ručn&iacute;m vytv&aacute;řen&iacute;m sn&iacute;mků.</p>
<ol>
	<li>Vyberte jednotku iSCSI&nbsp;LUN.</li>
	<li>Klikněte na možnost <strong>Nastavit pl&aacute;n</strong>.</li>
	<li>V tabulce <strong>Pl&aacute;n</strong> za&scaron;krtněte pol&iacute;čko <strong>Aktivovat pl&aacute;n sn&iacute;mků</strong> a nastavte čas a frekvenci pořizov&aacute;n&iacute; sn&iacute;mků. Pl&aacute;novan&eacute; sn&iacute;mky pro tuto sd&iacute;lenou složku zru&scaron;&iacute;te od&scaron;krtnut&iacute;m tohoto pol&iacute;čka.</li>
  <li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<h4>Konfigurace nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute; pl&aacute;novan&yacute;ch sn&iacute;mků:</h4>
<ol>
<li>Vyberte jednotku iSCSI&nbsp;LUN.</li>
<li>Klikněte na možnost <strong>Nastavit pl&aacute;n</strong>.</li>
<li>Vyberte tabulku <strong>Uchov&aacute;v&aacute;n&iacute;</strong>.</li>
<li>Nakonfigurujte svoje nastaven&iacute; pro uchov&aacute;v&aacute;n&iacute;. Vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:<ul>
		<li><strong>Odstranit star&eacute; sn&iacute;mky po dosažen&iacute; limitu:</strong> Po dosažen&iacute; maxim&aacute;ln&iacute;ho počtu sn&iacute;mků budou nejstar&scaron;&iacute; sn&iacute;mky přeps&aacute;ny nově poř&iacute;zen&yacute;mi.</li>
		<li><strong>Vždy uchov&aacute;vat sn&iacute;mky:</strong> Po dosažen&iacute; maxim&aacute;ln&iacute;ho počtu sn&iacute;mků přestane Spr&aacute;vce ochrany dat pořizovat nov&eacute; sn&iacute;mky, aniž by odstranil již dř&iacute;ve poř&iacute;zen&eacute; sn&iacute;mky.</li>
		<li><strong>Uchov&aacute;vat sn&iacute;mky podle n&aacute;sleduj&iacute;c&iacute;ch pravidel:</strong> Pro určen&eacute; časov&eacute; intervaly můžete nastavit pravidla pro uchov&aacute;v&aacute;n&iacute;. Dal&scaron;&iacute; informace naleznete v&nbsp;pozn&aacute;mce <a href="#smart_retention">Pravidla pro uchov&aacute;v&aacute;n&iacute;</a></li>
	</ul>
</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
<li>Zobraz&iacute; se potvrzuj&iacute;c&iacute; zpr&aacute;va. Konfiguraci ulož&iacute;te opětovn&yacute;m kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<h4>Konfigurace konzistentn&iacute;ho stavu va&scaron;ich sn&iacute;mků iSCSI LUN:</h4>
<ol>
<li>Vyberte jednotku iSCSI&nbsp;LUN.</li>
<li>Klikněte na možnost <strong>Nastavit pl&aacute;n</strong>.</li>
<li>Vyberte tabulku <strong>Aplikace</strong>.</li>
<li>Za&scaron;krtnut&iacute;m/od&scaron;krtnut&iacute;m pol&iacute;čka <strong>Aktivovat aplikačně-konzistentn&iacute; sn&iacute;mky</strong> vyberete někter&yacute; z n&aacute;sleduj&iacute;c&iacute;ch konzistentn&iacute;ch stavů:<ul>
<li><a name="app-consistent"></a><strong>Konzistentn&iacute; s&nbsp;aplikac&iacute;</strong>: Sn&iacute;mky v tomto konzistentn&iacute;m stavu lze vytvořit pouze tehdy, je-li na serveru Windows nebo VMware vCenter Server nainstalov&aacute;n n&aacute;stroj Synology Snapshot Manager, v&nbsp;z&aacute;vislosti na provozn&iacute;m prostřed&iacute; pro komunikaci se syst&eacute;mem&nbsp;DSM. Pokud jsou v&nbsp;syst&eacute;mu&nbsp;DSM vyvol&aacute;ny aplikačně konzistentn&iacute; sn&iacute;mky, aplikace obdrž&iacute; upozorněn&iacute; k&nbsp;vypr&aacute;zdněn&iacute; ve&scaron;ker&yacute;ch dat z&nbsp;paměti na jednotku&nbsp;LUN, z n&iacute;ž bude sn&iacute;mek vytvořen, a&nbsp;to z&nbsp;důvodu zachov&aacute;n&iacute; konzistence dat.<div class="section"><h4>Pozn&aacute;mka:</h4>
		<ul><li>Pokud ve va&scaron;em operačn&iacute;m syst&eacute;mu nen&iacute; n&aacute;stroj Synology Snapshot Manager nainstalov&aacute;n, volba aplikačně konzistentn&iacute;ho sn&iacute;mku zůstane neaktivn&iacute; i při za&scaron;krtnut&iacute; pol&iacute;čka.</li></ul>
	</div>
</li>
<li><strong>Konzistentn&iacute; v&nbsp;př&iacute;padě poruch</strong>: Pokud na ž&aacute;dn&eacute;m z&nbsp;klientů nen&iacute; nainstalov&aacute;n n&aacute;stroj Synology Snapshot Manager, můžete pro jednotky LUN vytv&aacute;řet pouze sn&iacute;mky konzistentn&iacute; v&nbsp;př&iacute;padě poruch. Při spu&scaron;těn&iacute; sn&iacute;mku konzistentn&iacute;ho v př&iacute;padě poruch aplikace neobdrž&iacute; upozorněn&iacute; k&nbsp;vypr&aacute;zdněn&iacute; dat z&nbsp;paměti na jednotku&nbsp;LUN a&nbsp;nen&iacute; tak zaručena konzistence dat.</li>
</ul>
</li>
<li>Nastaven&iacute; ulož&iacute;te kliknut&iacute;m na tlač&iacute;tko <strong>OK</strong>.</li>
</ol>

<p>____<br/><div class="section">
  <h4><a name="smart_retention"></a>Z&aacute;sady uchov&aacute;v&aacute;n&iacute; informac&iacute;</h4>
  <p>Tato volba představuje ide&aacute;ln&iacute; ře&scaron;en&iacute;, jak v&aacute;m pomoci při určov&aacute;n&iacute; maxim&aacute;ln&iacute;ho počtu verz&iacute; sn&iacute;mků a co nejv&iacute;ce &scaron;etřit prostor svazku, ale může se st&aacute;t, že budete potřebovat uchov&aacute;vat sn&iacute;mky po del&scaron;&iacute; časov&eacute; obdob&iacute;.</p>
  <p>Synology pro uchov&aacute;v&aacute;n&iacute; využ&iacute;v&aacute; GFS (neboli Grandfather-Father-Son) pravidla. Můžete nastavit maxim&aacute;ln&iacute; množstv&iacute; uchov&aacute;van&yacute;ch verz&iacute; sn&iacute;mků po tyto časov&eacute; intervaly: <strong>po hodině</strong>, <strong>denně</strong>, <strong>t&yacute;dně</strong>, <strong>měs&iacute;čně</strong> a <strong>ročně</strong>.</p>
</div>
</p>

</body>
</html>