<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Az adatbiztons&aacute;g biztos&iacute;t&aacute;sa &eacute;rdek&eacute;ben mentse az adatait a eCore Server-on</title>
</head>

<body class="tutorial-content-box" >

<h1>Az adatbiztons&aacute;g biztos&iacute;t&aacute;sa &eacute;rdek&eacute;ben mentse az adatait a eCore Server-on</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/Backup/back_up_your_data_on_synology_nas_to_ensure_data_security.jpg" />
<h2>&Aacute;ttekint&eacute;s</h2>
<p>A kisz&aacute;m&iacute;thatatlan szerver &uuml;zemzavar vagy t&eacute;rfogat &ouml;sszeoml&aacute;s komoly kock&aacute;zatot jelent az &Ouml;n fontos adatai sz&aacute;m&aacute;ra. A eCore Server a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra alternat&iacute;v&aacute;t biztos&iacute;t, ak&aacute;r helyben, ak&aacute;r t&aacute;volr&oacute;l, hogy biztons&aacute;gi ment&eacute;st k&eacute;sz&iacute;tsen a legfontosabb adatai sz&aacute;m&aacute;ra, &iacute;gy mindig fel van k&eacute;sz&uuml;lve a legrosszabbra. V&aacute;laszthat, hogy biztons&aacute;gi ment&eacute;st k&eacute;sz&iacute;t egy vagy t&ouml;bb m&oacute;don az adatveszt&eacute;s kock&aacute;zata cs&ouml;kkent&eacute;s&eacute;hez, az &Ouml;n &uuml;gyeinek a k&ouml;vetelm&eacute;nyeitől &eacute;s helyzeteitől f&uuml;ggően.</p>

<h3 class="list_head">1. Biztons&aacute;gi ment&eacute;s egy k&uuml;lső t&aacute;rol&oacute;eszk&ouml;zre</h3>
<p> Amikor biztons&aacute;gi ment&eacute;st k&eacute;sz&iacute;t helyben, akkor &uacute;gy d&ouml;nthet, hogy be&aacute;ll&iacute;tja a biztons&aacute;gi ment&eacute;s c&eacute;lhely&eacute;t egy m&aacute;sik mapp&aacute;ba ugyanazon a k&ouml;teten, RAID csoporton, vagy ak&aacute;r ugyanazon a fizikai lemezen. Ebben az esetben, ha az adatai v&eacute;letlen&uuml;l t&ouml;r&ouml;lve lettek, akkor lehets&eacute;ges lesz sz&aacute;m&aacute;ra, hogy visszaszerezze őket egy m&aacute;sik mapp&aacute;ban tal&aacute;lhat&oacute; biztons&aacute;gi ment&eacute;sből. Azonban, amikor kedvezőtlen szerverhib&aacute;val vagy k&ouml;tet &ouml;sszeoml&aacute;ssal szembes&uuml;l, az adatok, valamint a biztons&aacute;gi m&aacute;solatok, elveszhetnek. Teh&aacute;t, mindig az a javaslat, hogy biztons&aacute;gi ment&eacute;st k&eacute;sz&iacute;tsen a fontos adatokr&oacute;l egy k&uuml;lső t&aacute;rol&oacute; eszk&ouml;zre, nem pedig ugyanarra a szerverre. A eCore Server lehetőv&eacute; teszi a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra, hogy a biztons&aacute;gi ment&eacute;s c&eacute;lhelye ne csak a helyi meghajt&oacute;k, hanem k&uuml;lső USB eszk&ouml;z&ouml;k is lehessenek. Ez a szolg&aacute;ltat&aacute;s el&eacute;rhető a <b>Főmen&uuml; &gt; Biztons&aacute;gi ment&eacute;s &eacute;s replik&aacute;ci&oacute;</b> helyen. A l&eacute;p&eacute;sről l&eacute;p&eacute;sre val&oacute; utas&iacute;t&aacute;s&eacute;rt, k&eacute;rj&uuml;k, olvassa el <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=hun#local_backup">itt</a>.</p>

<h3 class="list_head">2. K&eacute;sz&iacute;tsen biztons&aacute;gi ment&eacute;st egy m&aacute;sik eCore Server-ra a h&aacute;l&oacute;zaton kereszt&uuml;l</h3>
<p>Az adatok biztons&aacute;gi ment&eacute;se egy k&uuml;lső t&aacute;rol&oacute; eszk&ouml;zre jav&iacute;tja az adatok rendelkez&eacute;sre &aacute;ll&aacute;s&aacute;t, de gondoljon a katasztr&oacute;f&aacute;k kock&aacute;zataira, mint a tűz vagy a f&ouml;ldreng&eacute;s, azon a helyen ahol a szerver &eacute;s a t&aacute;rol&oacute; eszk&ouml;z&ouml;k tal&aacute;lhat&oacute;k. A eCore Server lehetőv&eacute; teszi a felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra, hogy l&eacute;trehozzanak egy k&uuml;lső helysz&iacute;nű biztons&aacute;gi ment&eacute;st ahol &aacute;tvihetik az adatok m&aacute;solat&aacute;t a h&aacute;l&oacute;zaton kereszt&uuml;l m&aacute;shol egy m&aacute;sik szerverre, cs&ouml;kkentve az adatveszt&eacute;s kock&aacute;zat&aacute;t a szerver hely&eacute;t s&uacute;jtotta katasztr&oacute;f&aacute;k &aacute;ltal. A biztons&aacute;gi ment&eacute;s adat&aacute;tvitel&eacute;t titkos&iacute;tani lehet, hogy magasabb biztons&aacute;gi szinten v&eacute;dje meg a fontos adatait. A blokkszintű biztons&aacute;gi ment&eacute;si lehetős&eacute;ggel, a NAS csak a m&oacute;dos&iacute;tott blokkokat menti, &eacute;s ez praktikus, k&uuml;l&ouml;n&ouml;sen, ha a biztons&aacute;gi ment&eacute;s az interneten kereszt&uuml;l folyik le. Ez a szolg&aacute;ltat&aacute;s el&eacute;rhető a <b>Főmen&uuml; &gt; Biztons&aacute;gi ment&eacute;s &eacute;s replik&aacute;ci&oacute;</b> helyen. A l&eacute;p&eacute;sről l&eacute;p&eacute;sre val&oacute; utas&iacute;t&aacute;s&eacute;rt, k&eacute;rj&uuml;k, olvassa el <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=hun#network_backup">itt</a>.</p>

<h3 class="list_head">3. Biztons&aacute;gi ment&eacute;s a nyilv&aacute;nos felhőbeli t&aacute;rter&uuml;letre</h3>
<p>A t&aacute;voli biztons&aacute;gi ment&eacute;s k&uuml;l&ouml;nb&ouml;ző NAS eszk&ouml;z&ouml;k haszn&aacute;lat&aacute;n&aacute;l k&eacute;t vagy t&ouml;bb szervert, bele&eacute;rtve a benn&uuml;k tal&aacute;lhat&oacute; sz&aacute;mos lemezt, &eacute;s a szerverek hely&eacute;nek meghat&aacute;roz&aacute;s&aacute;t ig&eacute;nyli. A &uuml;zlet helyzete lehet, hogy nem teszi lehetőv&eacute; egy k&uuml;lső helysz&iacute;nű biztons&aacute;gi ment&eacute;s be&aacute;ll&iacute;t&aacute;s&aacute;t t&ouml;bb NAS eszk&ouml;zzel. Ahhoz, hogy megold&oacute;djon az &eacute;letk&eacute;ptelen NAS h&aacute;l&oacute;zati biztons&aacute;gi ment&eacute;s k&eacute;rd&eacute;se, a Synology Backup funkci&oacute; t&aacute;mogat&aacute;st ny&uacute;jt a k&uuml;l&ouml;nb&ouml;ző nyilv&aacute;nos felhőszolg&aacute;ltat&aacute;sokhoz, enged&eacute;lyezve az &Ouml;n sz&aacute;m&aacute;ra az adatok k&ouml;zvetlen biztons&aacute;gi ment&eacute;s&eacute;t az &Ouml;n nyilv&aacute;nos felhő fi&oacute;kj&aacute;ra. Ez a szolg&aacute;ltat&aacute;s el&eacute;rhető a <b>Biztons&aacute;gi ment&eacute;s &eacute;s replik&aacute;ci&oacute;ment&eacute;s</b> vagy a <b>Csomagkezel&eacute;si k&ouml;zpont</b> men&uuml;pont alatt a k&iacute;v&aacute;natosabb nyilv&aacute;nos felhőbeli t&aacute;rter&uuml;lettől f&uuml;ggően. A l&eacute;p&eacute;sről l&eacute;p&eacute;sre val&oacute; utas&iacute;t&aacute;s&eacute;rt, k&eacute;rj&uuml;k, olvassa el <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=hun#cloudservice_backup">itt</a>.</p>
</div>

</body>

</html>