<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Első l&eacute;p&eacute;sek az Cloud Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Szinkroniz&aacute;ljon f&aacute;jlokat Synology NAS kiszolg&aacute;l&oacute;ja &eacute;s sz&aacute;m&iacute;t&oacute;g&eacute;pe k&ouml;z&ouml;tt a Cloud Station seg&iacute;ts&eacute;g&eacute;vel</h1>
<div class="tutorials_content">

<img src="../../images/BuildCloud/1x/cloud_sync_files/02_1_build_your_private_cloud_CloudStation.png"/>

<h2>&Aacute;ttekint&eacute;s</h2>
<p>A Synology NAS sz&aacute;m&aacute;ra k&eacute;sz&uuml;lt Cloud Station egy f&aacute;jlszinkroniz&aacute;l&oacute; alkalmaz&aacute;s, amely megk&ouml;nny&iacute;ti a Synology NAS eszk&ouml;z&eacute;n tal&aacute;lhat&oacute; f&aacute;jlok szinkroniz&aacute;l&aacute;s&aacute;t m&aacute;s eszk&ouml;z&ouml;kkel, p&eacute;ld&aacute;ul sz&aacute;m&iacute;t&oacute;g&eacute;pekkel vagy mobileszk&ouml;z&ouml;kkel (a DS cloud haszn&aacute;lat&aacute;val). A Cloud Station sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;re &eacute;s Synology NAS kiszolg&aacute;l&oacute;ra val&oacute; egy&uuml;ttes telep&iacute;t&eacute;s&eacute;t k&ouml;vetően automatikusan szinkroniz&aacute;l&aacute;sra ker&uuml;lnek a sz&aacute;m&iacute;t&oacute;g&eacute;pe meghat&aacute;rozott mapp&aacute;j&aacute;ban tal&aacute;lhat&oacute; f&aacute;jlok a Synology NAS kiszolg&aacute;l&oacute;ra.</p>


<iframe width="640" height="360" src="//www.youtube.com/embed/kZX8XK9Wy2Y" frameborder="0" allowfullscreen></iframe>

<h3 class="list_head">1. A Cloud Station telep&iacute;t&eacute;se</h3>
<ol>
<li>Nyissa meg a <b>Csomagkezel&eacute;si k&ouml;zpontot</b>, keresse meg a <b>Cloud Station</b> alkalmaz&aacute;st, majd kattintson a&nbsp;<strong>Telep&iacute;t&eacute;s</strong> parancsra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/1.png" />
</ol>

<h3 class="list_head">2. A Cloud Station enged&eacute;lyez&eacute;se</h3>
<ol>
<li>Ind&iacute;tsa el a<b> Cloud Station</b> alkalmaz&aacute;st.

<li>Ha nem enged&eacute;lyezte a felhaszn&aacute;l&oacute;i kezdőlap funkci&oacute;t, felsz&oacute;l&iacute;tj&aacute;k ennek megt&eacute;tel&eacute;re. Kattintson az <b>OK</b> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/01.png" />
<li>&Aacute;tir&aacute;ny&iacute;t&aacute;sra ker&uuml;l a felhaszn&aacute;l&oacute;i be&aacute;ll&iacute;t&aacute;sok oldalra. Enged&eacute;lyezze a felhaszn&aacute;l&oacute;i homes mapp&aacute;kat, &eacute;s kattintson az <b>Alkalmaz</b> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/02.png" />
<li>Most nyissa meg ism&eacute;t a <b>Cloud Station</b> oldalt, a rendszer pedig felsz&oacute;l&iacute;tja annak enged&eacute;lyez&eacute;s&eacute;re. Kattintson az <b>Igen</b> lehetős&eacute;gre.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/03.png" />
<li>L&eacute;pjen a <b>Jogosults&aacute;gok</b> men&uuml;pontra, &eacute;s hat&aacute;rozza meg, mely felhaszn&aacute;l&oacute;k vehetik ig&eacute;nybe a Cloud Station alkalmaz&aacute;st. Kattintson a<b> Ment&eacute;s</b> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/04.png" />
</ol>

<h3 class="list_head">3. Kliens telep&iacute;t&eacute;se &eacute;s enged&eacute;lyez&eacute;se</h3>
<ol>
<li>L&eacute;pjen a <b>Cloud Station</b> &gt; <b>&Aacute;ttekint&eacute;s</b> men&uuml;pontra, majd kattintson a <b>Sz&aacute;m&iacute;t&oacute;g&eacute;pek</b> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/05.png" />
<li>Kattintson az oper&aacute;ci&oacute;s rendszer&eacute;nek megfelelő gombra a Cloud Station let&ouml;lt&eacute;s&eacute;hez. (A Cloud Station a <a href="https://www.synology.com/en-us/support/download" target="_blank">Synology Let&ouml;ltők&ouml;zpontj&aacute;b&oacute;l</a> is let&ouml;lthető.)</li>
<li>Ind&iacute;tsa el a telep&iacute;tőt a sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;n, &eacute;s k&ouml;vesse a k&eacute;pernyőn megjelenő utas&iacute;t&aacute;sokat.</li>
<li>Telep&iacute;t&eacute;s ut&aacute;n futtassa a <strong>Cloud Station</strong> alkalmaz&aacute;st a sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;n. Kattintson az <strong>Ind&iacute;t&aacute;s most</strong> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/06.png" />
<li>Adja meg a Cloud Station alkalmaz&aacute;st futtat&oacute; Synology NAS c&iacute;m&eacute;t (vagy QuickConnect ID azonos&iacute;t&oacute;j&aacute;t), felhaszn&aacute;l&oacute;nev&eacute;t, &eacute;s jelszav&aacute;t. A helyi h&aacute;l&oacute;zaton tal&aacute;lhat&oacute; IP-c&iacute;mekre kereshet a jobb oldalon tal&aacute;lhat&oacute; keres&eacute;s ikonra kattint&aacute;ssal. Kattintson a <strong>Tov&aacute;bb</strong> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/07.png" />
<li>V&aacute;lassza ki feladat&aacute;nak be&aacute;ll&iacute;t&aacute;sait (ebben az esetben a v&aacute;laszt&aacute;s a <strong>Gyorsbe&aacute;ll&iacute;t&aacute;s</strong> opci&oacute;ra esett), majd kattintson a <strong>Tov&aacute;bb</strong> gombra. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/08.png" />
<li>A Cloud Station mappa be&aacute;ll&iacute;t&aacute;sainak a v&eacute;gleges&iacute;t&eacute;s&eacute;hez kattintson a <strong>Befejez&eacute;s</strong> gombra.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/09.png" />
<li>A Cloud Station mappa megnyit&aacute;s&aacute;hoz kattintson a <strong>Megnyit&aacute;s most</strong> lehetős&eacute;gre.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/10.png" />
<li>A Cloud Station ikon megtal&aacute;lhat&oacute; a rendszert&aacute;lc&aacute;n. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/14.png" />
<li>A t&aacute;lcamen&uuml; megnyit&aacute;s&aacute;hoz kattintson dupl&aacute;n a Cloud Station ikonra. Ezen a k&eacute;pernyőn megtekintheti f&aacute;jljainak az &aacute;llapot&aacute;t, illetve folyamatra vonatkoz&oacute; adatokat l&aacute;that. A Cloud Station ind&iacute;t&aacute;s&aacute;hoz kattintson a <strong>Főalkalmaz&aacute;s</strong> parancsra. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/15.png" />
<li>Ind&iacute;t&aacute;skor megjelenik n&eacute;h&aacute;ny tipp a Cloud Station haszn&aacute;lat&aacute;val kapcsolatban. Tov&aacute;bbi tippek megjelen&iacute;t&eacute;s&eacute;hez kattintson a jobb ny&iacute;lra, tov&aacute;bbi t&aacute;j&eacute;koztat&aacute;s &uuml;gy&eacute;ben pedig kattintson az <strong>Ugr&aacute;s online seg&eacute;danyagokhoz</strong> parancsra. Amennyiben nincs sz&uuml;ks&eacute;ge tippekre, kattintson a <strong>Ne mutassa ezt t&ouml;bbsz&ouml;r</strong> lehetős&eacute;gre.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/16.png" />
<li>Mostant&oacute;l kezelheti szinkroniz&aacute;l&aacute;si feladatait a Cloud Station alkalmaz&aacute;sban. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/17.png" />
</ol>

<h3 class="list_head">4. Adatok szinkroniz&aacute;l&aacute;sa mobileszk&ouml;z&ouml;kre</h3>
<p>A DS cloud ingyenesen el&eacute;rhető az <a href="https://itunes.apple.com/us/app/ds-cloud/id590216612?mt=8" target="_blank">Apple App Store</a> &eacute;s <a href="https://play.google.com/store/apps/details?id=com.synology.dscloud" target="_blank">Google Play Store</a> &aacute;ruh&aacute;zakban. Beolvashatja a lenti QR-k&oacute;dot a k&ouml;zvetlen let&ouml;lt&eacute;shez.</p>
<img src="../../images/BuildCloud/1x/cloud_sync_files/13.png" width="475" height="219" />
</div>
<div class="page-info">
  <ul>
    <li>Következik a témában: <a href="cloud_set_up_quickconnect.html">Hozzáférés a Synology NAS-hoz az interneten át és fájlok megosztása</a> </li>
  </ul>
</div>
</body>

</html>
