<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Applikationsportal</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Applikationsportal</h1>
<p>Med Applikationsportal kan du konfigurera anslutningsinst&auml;llningarna f&ouml;r olika applikationer vilket l&aring;ter dig f&aring; &aring;tkomst till och k&ouml;ra dessa applikationer i oberoende bl&auml;ddringsflikar eller f&ouml;nster. </p>
<p>Du kan till exempel &ouml;ppna File Station genom att &ouml;ppna <strong>http://:diskstation:5000/file/</strong> i din webbl&auml;sare. Tillg&auml;ngliga anslutningsinst&auml;llningar inkluderar anpassade alias, HTTP- och HTTPS-portar. F&ouml;r att hitta dessa inst&auml;llningar, g&aring; till <strong>Kontrollpanel</strong> &gt; <strong>Applikationsportal</strong>.</p>

<div class="section">
<h4>Obs!</h4>
<p>Applikationsportal l&aring;ter dig redigera &aring;tkomstinst&auml;llningar f&ouml;r olika applikationer, s&aring;som Audio Station, Download Station, Surveillance Station, Video Station, File Station och &auml;ven andra.</p>
</div>


<h2><a name="session"></a>Anpassa alias</h2>
<p>Med ett anpassat alias kan en applikation, s&aring;som File Station, &ouml;ppnas genom att en adress s&aring;som <b>http://:diskstation:5000/file/</b> i din webbl&auml;sare. </p>
<h4>Att aktivera anpassade alias:</h4>
<ol>
<li>V&auml;lj en applikation.</li>
<li>Klicka p&aring; <b>Redigera</b>.</li>
<li>Markera <b>Aktivera anpassade alias</b>, i f&ouml;nstret som visas.</li>
<li>Specificera ett anpassat alias.</li>
</ol>

<div class="section">
<h4>Obs!</h4>
<ul>
<li>Du kan markera kryssrutan <strong>Omdirigera fr&aring;n</strong> och anv&auml;nda ett kortare och enklare-att-minnas alias f&ouml;r att f&aring; &aring;tkomst till den valda applikationen. </li>
<li>F&ouml;ljande &auml;r respektive standardalias f&ouml;r de fyra applikationerna Audio Station, Download Station, Surveillance Station, Video Station, File Station: <strong>audio</strong>, <strong>download</strong>, <strong>cam</strong>,<strong> video</strong>, <strong>file</strong>.</li>
<li>Aliasnamn kan inte vara desamma som &auml;r reserverade f&ouml;r systemet, webbl&auml;sare eller anv&auml;nds av andra applikationer och antal tecken f&ouml;r dem m&aring;ste begr&auml;nsas till att vara mellan 2 och 20. </li>
<li>Aliasnamn kan best&aring; av blandade gemener och versaler, numeriska tecken och tv&aring; specialtecken  (-), (_), dessa tv&aring; tecken kan dock bara anv&auml;nds f&ouml;r andra tecknen utom som f&ouml;rsta eller sista tecken.
</li>
</ul>
</div>

<h2><a name="session"></a>Anpassade HTTP- eller HTTPS-portar</h2>
<p>Med anpassade HTTP- eller HTTPS-portar kan en applikation &ouml;ppnas genom att ange en adress s&aring;som <b>http://diskstation:7000</b> eller <b>http://diskstation:7001</b>.</p>
<h4>Att aktivera en anpassad HTTP- eller HTTPS-port:</h4>
<ol>
<li>V&auml;lj en applikation.</li>
<li>Klicka p&aring; <b>Redigera</b>.</li>
<li>I f&ouml;nstret som visas, markera <b>Aktivera anpassad port (HTTP)</b> eller <b>Aktivera anpassad port (HTTPS)</b>.</li>
<li>Specificera ett anpassat portnummer.</li></ol>
<div class="section">
  <h4>Obs!</h4>
<ol>
<li>Portnumret kan vara fr&aring;n 1 till 65535, men f&ouml;ljande portar ska inte anv&auml;ndas eftersom de &auml;r reserverade f&ouml;r systembruk: 20, 21, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002, eMule-standardportar: 4662 (TCP), 4672(UDP), och standardportintervall f&ouml;r FTP: Det faktiska intervallet kan variera beroende p&aring; modell.</li>
</ol>
</div>
</body> </html>
