<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Utilit&agrave; di pianificazione</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Utilit&agrave; di pianificazione</h1>
<p>Utilit&agrave; di pianificazione consente di pianificare e eseguire i servizi o script in momenti predefiniti.</p>
<h2>Attivit&agrave; supportate</h2>
<p>&Egrave; possibile creare le attivit&agrave; nei seguenti modi:</p>
<ul class="disable-eds14">
<li><strong>Script definito dall&rsquo;utente:</strong> eseguire gli script o comandi definiti dall&apos;utente.</li>
<li><strong>Cestino:</strong> vuotare il cestino delle cartelle condivise specificate. Inoltre, le impostazioni di <strong>Politica di conservazione</strong> consentono di controllare quali file sono cancellati in modo permanente quando si svuota il Cestino. Ad esempio, i file possono essere cancellati o conservati in base a dimensione, tempo di cancellazione o formato file.</li>
<li><strong>Controllo promemoria acustico:</strong> consente a DiskStation di emettere un bip.</li> 
<li><strong>Servizio:</strong> avviare o interrompere i servizi di rete, ad esempio il Servizio file Windows, FTP, Blocco automatico, ecc.</li>
</ul>


<ul class="enable-eds14">
<li><strong>Script definito dall&rsquo;utente:</strong> eseguire gli script o comandi definiti dall&apos;utente.</li>
<li><strong>Cestino:</strong> vuotare il cestino delle cartelle condivise specificate. Inoltre, le impostazioni di <strong>Politica di conservazione</strong> consentono di controllare quali file sono cancellati in modo permanente quando si svuota il Cestino. Ad esempio, i file possono essere cancellati o conservati in base a dimensione, tempo di cancellazione o formato file.</li>
<li><strong>Servizio:</strong> avviare o interrompere i servizi di rete, ad esempio il Servizio file Windows, FTP, Blocco automatico, ecc.</li>
</ul>


<h2>Gestione delle attivit&agrave;</h2>
<p>La pagina principale dell&apos;Utilit&agrave; di pianificazione visualizza tutte le attivit&agrave; esistenti e consente di creare, modificare o eseguire le attivit&agrave;.</p>
<h4>Per creare un&apos;attivit&agrave;:</h4>
<ol>
<li>Fare clic su <strong>Crea</strong> e selezionare il tipo di attivit&agrave; da pianificare.</li>
<li>Quando viene visualizzata la finestra <strong>Crea attivit&agrave;</strong>, modificare le seguenti impostazioni nella scheda <strong>Generale</strong>:</li>
<ul>
<li><strong>Impostazioni generali:</strong> immettere un nome per l&apos;attivit&agrave;, selezionare un utente e abilitare o disabilitare l&apos;attivit&agrave;. </li>
<li><strong>Altre Impostazioni:</strong> in questa scheda possono essere modificate altre impostazioni specifiche dell&apos;attivit&agrave; (solo per alcune attivit&agrave;). Ad esempio, quando viene creata un&apos;attivit&agrave; per vuotare il cestino, &egrave; necessario selezionare il cestino di una cartella condivisa.</li>
</ul>
<li>Nella scheda <strong>Programmazione</strong>, modificare le seguenti impostazioni:</li>
<ul>
<li><strong>Data:</strong> specificare quando eseguire l&apos;attivit&agrave;. &Egrave; possibile pianificare l&apos;esecuzione in dati giorni della settimana (ad esempio ogni giorno, nei fine settimana o ogni domenica, ecc.) o in date specifiche (ad esempio 21/10/2015).</li>
<li><strong>Ora:</strong> specificare il numero di volte che l&apos;attivit&agrave; deve essere eseguita ogni giorno, oltre alla prima e ultima ora di esecuzione.</li>
</ul>
<li>Modificare le impostazioni specifiche dell&apos;attivit&agrave; nella scheda <strong>Impostazioni attivit&agrave;</strong> (solo per alcune attivit&agrave;).</li>
</ul>
<li>Fare clic su <strong>OK</strong> per terminare</li>
</ol>
<h4>Per modificare le impostazioni dell&apos;attivit&agrave;:</h4>
<ol>
<li>Selezionare un&apos;attivit&agrave; esistente.</li>
<li>Fare clic su <strong>Modifica</strong>.</li>
<li>Viene visualizzata una finestra dove &egrave; possibile modificare l&apos;attivit&agrave;.</li>
</ol>
<h4>Per eliminare un&apos;attivit&agrave;:</h4>
<ol>
<li>Selezionare un&apos;attivit&agrave; esistente.</li>
<li>Fare clic su <strong>Elimina</strong>.</li>
</ol>

<h4>Per abilitare o disabilitare l&apos;attivit&agrave;:</h4>
<ol>
<li>Nella pagina principale di <strong>Utilit&agrave; di pianificazione</strong>, selezionare o deselezionare le caselle di controllo appropriate in <strong>Abilitato</strong> per abilitare o disabilitare l&apos;attivit&agrave;.</li>
<li>Fare clic su <strong>Salva</strong>.</li>
</ol>


<h4>Per eseguire manualmente l&apos;attivit&agrave;:</h4>
<ol>
<li>Selezionare una o pi&ugrave; attivit&agrave; esistenti.</li>
<li>Fare clic su <strong>Esegui</strong>.</li>
</ol>

<div class="section">
<h4>Limitazioni dell&apos;Utilit&agrave; di pianificazione:</h4>
<ul class="disable-eds14">
<li>I nomi delle attivit&agrave; possono includere 512 caratteri visualizzabili.</li>
<li>Numero massimo di attivit&agrave;: 1024.</li>
<li>Lunghezza massima del percorso script o linea di comando: 4095.</li>
<li>La durata bip pu&ograve; essere impostata da 1 a 600 secondi.</li>
</ul>


<ul class="enable-eds14">
<li>I nomi delle attivit&agrave; possono includere 512 caratteri visualizzabili.</li>
<li>Numero massimo di attivit&agrave;: 1024.</li>
<li>Lunghezza massima del percorso script o linea di comando: 4095.</li>
</ul>

</div>

</body> </html>
