<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Hot Spare</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hot Spare*</h2>
<p>Disky Hot spare jsou disky v&nbsp;pohotovostn&iacute;m režimu, kter&eacute; dok&aacute;žou automaticky vyměnit po&scaron;kozen&yacute; svazek/skupinu Disk Group/jednotku iSCSI LUN. Disky Hot spare lze glob&aacute;lně nastavit, tak, aby zabezpečovaly ochranu jak&eacute;hokoli svazku/skupiny Disk Group/jednotky iSCSI LUN v&nbsp;r&aacute;mci zař&iacute;zen&iacute; DiskStation, av&scaron;ak za předpokladu, že svazek/skupina Disk Group/jednotka iSCSI LUN splňuje n&aacute;sleduj&iacute;c&iacute; krit&eacute;ria:</p>
<ul>
<li>Typ pole RAID svazku/skupiny RAID Group/jednotky iSCSI LUN mus&iacute; obsahovat možnost zabezpečen&iacute; dat (např. typ RAID&nbsp;1, RAID&nbsp;5, RAID&nbsp;6, RAID&nbsp;10).</li>
<li>Velikost pevn&eacute;ho disku Hot spare mus&iacute; b&yacute;t stejn&aacute; nebo vět&scaron;&iacute; než velikost nejmen&scaron;&iacute;ho disku svazku/skupiny Disk Group/jednotky iSCSI LUN.</li>
</ul>

<h4>Nastaven&iacute; disků Hot spare:</h4>
<ol>
<li>Klepněte na možnost <b>Spr&aacute;va</b>.</li>
<li>Zobraz&iacute; se dialogov&eacute; okno s&nbsp;informacemi o&nbsp;stavu jednotliv&yacute;ch svazků/skupin Disk Group/jednotek iSCSI LUN a&nbsp;tak&eacute; dostupn&eacute; disky. Obsažen&eacute; informace o&nbsp;stavu svazku/skupiny Disk Group/jednotky iSCSI LUN:</li>
<ul>
<li><strong>Přiděleno:</strong> Svazek/skupina Disk Group/jednotka iSCSI LUN je zabezpečena alespoň jedn&iacute;m diskem Hot spare.</li>
<li><strong>K&nbsp;dispozici:</strong> Jsou k&nbsp;dispozici disky, kter&eacute; mohou zajistit zabezpečen&iacute; svazku/skupiny Disk Group/jednotky iSCSI LUN, ale nebyl zat&iacute;m přidělen ž&aacute;dn&yacute; disk Hot spare.</li>
<li><strong>Nen&iacute; k&nbsp;dispozici:</strong> Pro zabezpečen&iacute; svazku/skupiny Disk Group/jednotky iSCSI LUN nejsou k&nbsp;dispozici ž&aacute;dn&eacute; disky Hot spare.</li>
</ul>
<li>V&nbsp;č&aacute;sti <strong>Dostupn&eacute; disky</strong> jsou zobrazeny pevn&eacute; disky, kter&eacute; lze přiřadit jako disky Hot spare. Chcete-li přiřadit disk Hot spare, za&scaron;krtněte pol&iacute;čko vedle disku, kter&yacute; chcete přiřadit jako disk Hot spare.</li>
<li>Nastaven&iacute; uložte klepnut&iacute;m na možnost <b>Použ&iacute;t</b>.</li>
</ol>
<p><span class="note_head">Pozn&aacute;mka:</span> Pokud je pevn&yacute; disk přiřazen jako disk Hot spare, budou v&scaron;echna data na disku odstraněna. Dř&iacute;ve než disk Hot spare přiděl&iacute;te, ověřte, zda neobsahuje důležit&aacute; data.</p>

<p>____<br />*K&nbsp;dispozici pouze u&nbsp;někter&yacute;ch modelů.</p>

</body>
</html>
