<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Sicherung Ihrer Daten auf ein Synology NAS, um die Datensicherheit zu gew&auml;hrleisten</title>
</head>

<body class="tutorial-content-box" >

<h1>Sicherung Ihrer Daten auf ein Synology NAS, um die Datensicherheit zu gew&auml;hrleisten</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/Backup/back_up_your_data_on_synology_nas_to_ensure_data_security.jpg" />
<h2>&Uuml;bersicht</h2>
<p>Unvorhergesehene Fehlfunktion des Servers oder ein Absturz des Volume stellen ein gro&szlig;es Risiko f&uuml;r Ihre wichtigsten Daten dar. Das Synology NAS bietet Benutzern die Alternative zur lokalen oder remote Sicherung von Kopien der wichtigsten Daten, so dass Sie immer auf das Schlimmste vorbereitet sind. Sie k&ouml;nnen sich je nach Anforderungen und Situationen Ihres Unternehmens f&uuml;r eine Sicherung mit einer oder mehreren Methoden entscheiden.</p>

<h3 class="list_head">1. Sicherung auf einen externen Speicher</h3>
<p> Wenn Sie eine lokale Sicherung vornehmen, k&ouml;nnen Sie als Sicherungsziel einen anderen Ordner auf dem selben Volume, RAID Gruppe oder sogar derselben Festplatte ausw&auml;hlen. In diesem Fall k&ouml;nnen Sie die Daten nach einem versehentlichen L&ouml;schen aus den in einem anderen Ordner gesicherten Kopien wiederherstellen. Wenn allerdings der Server ausf&auml;llt oder das Volume abst&uuml;rzt, k&ouml;nnten Ihre Daten mitsamt den gesicherten Kopien verloren gehen. Wir empfehlen daher immer eine Sicherung Ihrer wichtigsten Daten auf ein externes Speicherger&auml;t als auf demselben Server. Das Synology NAS erm&ouml;glicht Ihnen als Einstellung des Sicherungsziels nicht nur lokale Laufwerke, sondern auch externe USB-Ger&auml;te. Die Funktion ist unter <b>Hauptmen&uuml; &gt; Datensicherung &amp; Replikation</b> verf&uuml;gbar. Eine Schritt-f&uuml;r-Schritt Anleitung finden Sie <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=ger#local_backup">hier</a>.</p>

<h3 class="list_head">2. Auf ein anderes Synology NAS &uuml;ber das Netzwerk sichern</h3>
<p>Die Sicherung Ihrer Daten auf ein externes Speicherger&auml;t verbessert die Datenverf&uuml;gbarkeit, aber denken Sie an die Risiken von Naturkatastrophen wie z.B. Feuer oder Erdbeben an dem Ort, an dem sich Ihr Server und Ihre Speicherger&auml;te befinden. Das Synology NAS erm&ouml;glicht Benutzern die Einrichtung einer Sicherung an einem anderen Ort (Off-Site), indem Ihre Daten &uuml;ber das Netzwerk auf einen anderen Server &uuml;bertragen werden, was das Risiko eines Datenverlusts wegen einer Katastrophe am Standort des Servers minimiert. Die Daten&uuml;bertragung der Sicherung kann verschl&uuml;sselt werden, um Ihre wichtigen Daten mit einer h&ouml;heren Sicherheitsstufe zu sch&uuml;tzen. Mit der Sicherungsoption auf Blockebene wird das NAS nur ge&auml;nderte Bl&ouml;cke sichern. Dies ist besonders dann praktisch, wenn die Sicherung &uuml;ber das Internet ausgef&uuml;hrt wird. Die Funktion ist unter <b>Hauptmen&uuml; &gt; Datensicherung &amp; Replikation</b> verf&uuml;gbar. Eine Schritt-f&uuml;r-Schritt Anleitung finden Sie <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=ger#network_backup">hier</a>.</p>

<h3 class="list_head">3. Sicherung auf einem &ouml;ffentlichen Cloudspeicher</h3>
<p>Eine Remote Sicherung unter verschiedenen NAS Ger&auml;ten erfordert zwei oder mehr Server, sowie eine entsprechende Anzahl an Festplatten, und den Platz f&uuml;r die Aufstellung der Server. Die Situation in Ihrem Unternehmen k&ouml;nnte die Einrichtung einer Off-Site Sicherung mit mehreren NAS Ger&auml;ten m&ouml;glicherweise nicht zulassen. Um das Problem der fehlenden NAS Umgebung f&uuml;r eine Netzwerksicherung zu l&ouml;sen, bietet die Synology Sicherungsfunktion die Unterst&uuml;tzung f&uuml;r verschiedene &ouml;ffentliche Clouddienste, um Ihre Daten direkt in Ihrem &ouml;ffentlichen Cloud-Konto zu sichern. Diese Funktion ist je nach Ihrem bevorzugten &ouml;ffentlichen Cloudspeicher unter <b>Datensicherung &amp; Replikation</b> oder <b>Paketzentrum</b> verf&uuml;gbar. Eine Schritt-f&uuml;r-Schritt Anleitung finden Sie <a href="http://help.synology.com/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=ger#cloudservice_backup">hier</a>.</p>
</div>

</body>

</html>