<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Editor de Texto</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Editor de Texto</h1>
<p>O Editor de Texto &eacute; um editor de texto e c&oacute;digo altamente vers&aacute;til, permitindo-lhe aceder e editar rapidamente ficheiros de texto ou c&oacute;digos no seu DiskStation diretamente a partir de um navegador Web.</p>

<h3>Gest&atilde;o de Ficheiros</h3>
<h4>Para criar novos ficheiros:</h4> 
<p>Clique em <b>Ficheiro</b> e escolha <b>Novo</b>. Ser&aacute; apresentado um separador novo vazio com o t&iacute;tulo <b>Novo Documento.txt</b>.</p>

<h4>Para abrir ficheiros a partir do Editor de Texto:</h4> 
<p>Basta clicar em <b>Ficheiro</b> e escolher <b>Novo</b>. Ser&aacute; apresentada uma caixa de di&aacute;logo, onde pode selecionar um ficheiro com uma codifica&ccedil;&atilde;o de caracteres espec&iacute;fica que tenha de ser aberto num separador. Se o ficheiro j&aacute; estiver aberto, o Editor de Texto mostrar-lhe-&aacute; esse ficheiro no seu estado atual.</p> 

<h4>Para abrir ficheiros a partir da File Station:</h4> 
<p>Na File Station, basta clicar com o bot&atilde;o direito do rato no ficheiro selecionado e, em seguida, clicar em <b>Abrir com o Editor de Texto</b> no menu de contexto. Se o ficheiro j&aacute; estiver aberto, o Editor de Texto mostrar-lhe-&aacute; esse ficheiro no seu estado atual. Uma outra forma de abrir um ficheiro &eacute; arrastar um ou v&aacute;rios ficheiros da File Station para o Editor de Texto utilizando o cursor.</p><br><div class="section">
<p><b>Nota:</b></p>
<p>O Editor de Texto n&atilde;o pode abrir ficheiros que excedam 10 MB.</p>
</div>

<h4>Para guardar ficheiros:</h4> 
<p>Basta clicar em <b>Ficheiro</b> e escolher <b>Guardar</b>. Se for um ficheiro existente, ser&aacute; substitu&iacute;do pelos conte&uacute;dos atuais. Se pretender guardar todos os ficheiros abertos de uma s&oacute; vez, pode aceder a <b>Ficheiro</b> &gt; <b>Guardar Tudo</b>. Se o ficheiro ainda n&atilde;o tiver nome (um ficheiro novo) ou se tiver selecionado <b>Ficheiro</b> &gt; <b>Guardar Como</b>, ser&aacute; apresentada uma caixa de di&aacute;logo a solicitar o nome do ficheiro. Em seguida, pode escolher a localiza&ccedil;&atilde;o, o nome do ficheiro e a codifica&ccedil;&atilde;o a guardar para o ficheiro.</p>

<h4>Para fechar ficheiros:</h4> 
<p>Basta clicar em <b>Ficheiro</b> e escolher <b>Fechar</b>. Uma outra forma de fechar um ficheiro &eacute; clicar no bot&atilde;o para fechar em cada separador. Se tiver dados n&atilde;o guardados num ficheiro, o Editor de Texto perguntar-lhe-&aacute; sempre se pretende fechar sem guardar essas altera&ccedil;&otilde;es.</p>

</ul>

<div class="section">
<h4>Nota:</h4>
<p>Pode guardar ficheiros com uma codifica&ccedil;&atilde;o de caracteres espec&iacute;fica para suportar idiomas bidirecionais. Tamb&eacute;m pode especificar uma codifica&ccedil;&atilde;o ao abrir um ficheiro para que seja apresentado corretamente pelo Editor de Texto.</p>
</div>

<h3>Editar</h3>
<ul>
<li><strong>Opera&ccedil;&otilde;es normais</strong><br> O controlo de edi&ccedil;&atilde;o suporta as opera&ccedil;&otilde;es simples de Anular, Refazer e Selecionar Tudo. Estas opera&ccedil;&otilde;es podem ser encontradas na maioria dos editores e funcionam de forma muito semelhante. Pode executar estas opera&ccedil;&otilde;es selecionando o item de menu correspondente no menu <b>Editar</b>. Al&eacute;m disso, por predefini&ccedil;&atilde;o, as op&ccedil;&otilde;es de Cortar, Copiar e Colar est&atilde;o dispon&iacute;veis atrav&eacute;s do menu de contexto do navegador.</li>

<li><strong>Avan&ccedil;o</strong><br> O avan&ccedil;o de texto &eacute; uma opera&ccedil;&atilde;o comum na edi&ccedil;&atilde;o de c&oacute;digo fonte. O avan&ccedil;o &eacute; o processo de adicionar um espa&ccedil;o em branco adicional no in&iacute;cio de uma linha para separar blocos de texto, adicionando uma hierarquia. Geralmente, durante a edi&ccedil;&atilde;o, ao premir a tecla Tab, ser&aacute; inserido um caractere de tabula&ccedil;&atilde;o na localiza&ccedil;&atilde;o atual. Contudo, se estiver selecionado algum texto, premir a tecla Tab adicionar&aacute; um espa&ccedil;o em branco suplementar no in&iacute;cio de cada linha com texto selecionado, permitindo-lhe avan&ccedil;ar blocos inteiros de texto de uma s&oacute; vez. Ao premir Shift e Tab em simult&acirc;neo, o avan&ccedil;o ser&aacute; removido.</li>

<li><strong>Substituir</strong><br> Pode ativar ou desativar a substitui&ccedil;&atilde;o premindo a tecla Insert (Inserir). Isto &eacute;, em vez de se inserir caracteres na posi&ccedil;&atilde;o do cursor, estes s&atilde;o substitu&iacute;dos. O cursor apresentado mudar&aacute; de forma consoante o estado da substitui&ccedil;&atilde;o.</li>

<li><strong>Edi&ccedil;&atilde;o em modo de coluna</strong><br> Uma forma especial de editar ficheiros &eacute; a edi&ccedil;&atilde;o em modo de coluna. Isto significa que o texto pode ser selecionado em colunas, em vez da sele&ccedil;&atilde;o em linhas. Para iniciar uma sele&ccedil;&atilde;o em modo de coluna, prima a tecla Alt ao selecionar o texto, movendo o cursor para baixo ou para cima, conforme necess&aacute;rio. Quando o texto for selecionado no chamado modo de coluna, a introdu&ccedil;&atilde;o ir&aacute; alterar todas as colunas de caracteres selecionadas para o caractere introduzido.</li>
</ul>


<h3>Pesquisar</h3>
<ul>
<li><strong>Pesquisa normal</strong><br> Pode pesquisar texto tal como na maioria dos programas atrav&eacute;s da caixa de di&aacute;logo Localizar. Pode abrir esta caixa de di&aacute;logo selecionando <b>Pesquisar</b> &gt; <b>Localizar</b>. Esta caixa de di&aacute;logo permanecer&aacute; sempre sobre o texto e n&atilde;o ser&aacute; poss&iacute;vel continuar a editar o texto enquanto a caixa de di&aacute;logo estiver aberta. No campo de pesquisa, escreva o texto que pretende localizar.</li>

<li><strong>Substituir</strong><br> Pode localizar e substituir texto tal como na maioria dos programas atrav&eacute;s da caixa de di&aacute;logo Substituir. Pode abrir esta caixa de di&aacute;logo selecionando <b>Pesquisar</b> &gt; <b>Substituir</b>. <b>Substituir Tudo</b> substituir&aacute; todas as ocorr&ecirc;ncias do pedido pelo texto de substitui&ccedil;&atilde;o. </li>

<li><strong>Sens&iacute;vel a mai&uacute;sculas e min&uacute;sculas</strong><br> As ocorr&ecirc;ncias apresentadas ser&atilde;o exatamente iguais ao pedido no que se refere a mai&uacute;sculas e min&uacute;sculas. Se esta op&ccedil;&atilde;o n&atilde;o estiver assinalada, a pesquisa n&atilde;o ser&aacute; sens&iacute;vel a mai&uacute;sculas e min&uacute;sculas.</li>

<li><strong>Apenas palavra inteira</strong><br> Resultar&aacute; em ocorr&ecirc;ncia apenas se a correspond&ecirc;ncia for uma palavra inteira e n&atilde;o uma parte de uma palavra. Por exemplo, se procurar a palavra &quot;casa&quot; com <strong>Apenas palavra inteira</strong>, ir&aacute; localizar apenas &quot;casa&quot; e n&atilde;o &quot;casamento&quot;.</li>

<li><strong>Express&atilde;o regular</strong><br> O pedido ser&aacute; processado como uma express&atilde;o regular.</li>
</ul>


<div class="section">
<h4>O que &eacute; uma express&atilde;o regular?</h4>
<p>Uma express&atilde;o regular &eacute; uma sequ&ecirc;ncia de caracteres que forma um padr&atilde;o de pesquisa como t&eacute;cnica poderosa de poupan&ccedil;a de tempo. Uma utiliza&ccedil;&atilde;o muito simples de uma express&atilde;o regular seria localizar a mesma palavra escrita de duas formas diferentes num editor de texto, por exemplo, cota/quota.</p>
</div>

<h3>Configurador de Estilo</h3>
<p>O configurador de estilo &eacute; utilizado, principalmente, para controlar o aspeto do texto no Editor de Texto.<br> A lista pendente na parte inferior direita inclui a linguagem de programa&ccedil;&atilde;o suportada cujo estilo pode ser alterado para o ajudar a criar um ambiente de codifica&ccedil;&atilde;o adequado.</p>

<h3>Prefer&ecirc;ncias</h3>
<ul>
<li><strong>Mostrar caracteres invis&iacute;veis</strong><br> Se assinalado, ser&atilde;o mostrados caracteres de espa&ccedil;o, tabula&ccedil;&atilde;o, nova linha ou quebra.</li>

<li><strong>Mostrar guias de avan&ccedil;o</strong><br> Se assinalado, ser&atilde;o mostradas guias de avan&ccedil;o. Esta op&ccedil;&atilde;o &eacute; &uacute;til para alinhar os c&oacute;digos na linguagem de codifica&ccedil;&atilde;o.</li>

<li><strong>Real&ccedil;ar linha atual</strong><br> Se assinalado, a linha em que se encontra o sinal de inser&ccedil;&atilde;o ser&aacute; apresentada com uma cor de fundo especial.</li>

<li><strong>Real&ccedil;ar palavra selecionada</strong><br> Se assinalado, todas as palavras (n&atilde;o parciais) dentro do mesmo ficheiro de texto que correspondam &agrave; palavra selecionada ser&atilde;o automaticamente real&ccedil;adas.</li>

<li><strong>Mostrar n&uacute;meros das linhas</strong><br> Se assinalado, os n&uacute;meros das linhas ser&atilde;o apresentados.</li>

<li><strong>Ativar dobragem de c&oacute;digo</strong><br> Se assinalado, certas linhas dos c&oacute;digos podem ser ocultas com base em determinadas caracter&iacute;sticas. Esta funcionalidade funciona bem para linguagens estruturadas, tais como C++ ou XML. Se <b>Ocultar widgets de divulga&ccedil;&atilde;o automaticamente</b> estiver selecionado, determinadas linhas de c&oacute;digos ser&atilde;o dobradas automaticamente. Tamb&eacute;m pode optar por marcar apenas o par&ecirc;ntese de abertura ou ambos os par&ecirc;nteses de abertura e de fecho com os widgets de divulga&ccedil;&atilde;o.</li>  

<li><strong>Moldagem do Texto</strong><br> Especifique se pretende que o texto seja moldado na margem da janela ou num determinado n&uacute;mero de coluna personalizado sem inserir uma quebra de par&aacute;grafo.</li>

<li><strong>Acrescentar caracteres de fecho automaticamente</strong><br> Se assinalado, os par&ecirc;nteses de fecho (caracteres) ser&atilde;o acrescentados automaticamente aos seus c&oacute;digos.</li>

<li><strong>Inserir espa&ccedil;os em vez de tabula&ccedil;&otilde;es</strong><br> Se assinalado, ao premir a tecla Tab, ser&atilde;o inseridos espa&ccedil;os em vez de tabula&ccedil;&otilde;es. A <b>Largura da tabula&ccedil;&atilde;o</b> pode ser definida pelo n&uacute;mero de caracteres em <b>Prefer&ecirc;ncias</b> &gt; <b>Tipo de letra e cor</b>.</li>

<li><strong>Codifica&ccedil;&atilde;o predefinida</strong><br> A codifica&ccedil;&atilde;o predefinida &eacute; utilizada para guardar ficheiros com uma codifica&ccedil;&atilde;o de caracteres espec&iacute;fica para suportar idiomas bidireccionais. Tamb&eacute;m pode especificar uma codifica&ccedil;&atilde;o ao abrir um ficheiro para que seja apresentado corretamente pelo Editor de Texto.</li>

<li>O <strong>Tipo de letra e cor</strong><br> <b>Largura da tabula&ccedil;&atilde;o</b>, <b>Tamanho do tipo de letra</b> e <b>Tema</b> podem ser personalizados de acordo com as suas prefer&ecirc;ncias pessoais. A <b>Largura da tabula&ccedil;&atilde;o</b> &eacute; definida pelo n&uacute;mero de espa&ccedil;os.</li>
</ul>

<div class="section">
<h4>Formatos de Ficheiro Suportados</h4>
<p>O Editor de Texto apenas suporta ficheiros de texto simples. Os ficheiros de texto com formata&ccedil;&atilde;o avan&ccedil;ada, como *.doc e *.pdf, n&atilde;o s&atilde;o suportados.</p>
</div>

</body>
</html>
