<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Montar pastas remotas</h2>

<p>
Voc&ecirc; pode montar pastas remotas de servidores remotos (como computadores de rede ou outro DiskStation) para navegar facilmente pelos recursos dispon&iacute;veis da rede com o File Station.
</p>

<h4>Para montar uma pasta remota:</h4>
<ol>
<li>Clique em <b>Ferramentas</b> &gt; <b>Montar pasta remota</b>.</li>


<li>Digite &quot;<b>\\Remote_Server\Remote_Folder</b>&quot; no campo <b>Pasta</b> para especificar o caminho da pasta remota. Por exemplo, &quot;\\192.168.0.2\share&quot; ou &quot;\\chad\cheeseburger\pictures&quot;.</li>
<li>Se privil&eacute;gio para a pasta remota for exigido pelo servidor remoto, digite suas credenciais de usu&aacute;rio do servidor remoto nos campos <b>Nome da conta</b> e <b>Senha</b>.</li>
<li>Clique em <b>Procurar</b> para selecionar ou criar uma pasta de destino vazia em seu DiskStation para montar a pasta remota.</li>


<li>Marque <b>Montar automaticamente ao iniciar</b> se desejar que o DiskStation monte essa pasta remota a cada inicializa&ccedil;&atilde;o ou reinicializa&ccedil;&atilde;o do sistema.</li>
<li>Clique em <b>Montar</b>. Agora voc&ecirc; pode navegar at&eacute; a pasta de destino em que a pasta remota est&aacute; montada e acessar o conte&uacute;do das pastas remotas.</li>
</ol>


<h4>Para desmontar uma pasta remota:</h4>
<ol>
<li>Selecione a pasta remota que voc&ecirc; deseja desmontar e clique em <b>Ferramentas</b> &gt; <b>Desmontar</b>.</li>


<li>Como alternativa, basta clicar com o bot&atilde;o direito na pasta remota e selecionar <b>Desmontar</b>.</li>


</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>O n&uacute;mero m&aacute;ximo de pastas remotas concomitantes &eacute; de 100.</li>
<li>Voc&ecirc; s&oacute; tem permiss&atilde;o para montar pastas remotas de um servidor remoto que suporte o protocolo CIFS.
</li>
</ul>
</div>
</body>
</html>
