<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>File Station</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Compartilhar links do arquivo</h2>

<p>Os arquivos ou pastas armazenados no seu DiskStation podem ser compartilhados r&aacute;pida e facilmente. Basta clicar com o bot&atilde;o direito no arquivo ou pasta e selecionar <strong>Compartilhar links do arquivo</strong>. Isso gera um link e um c&oacute;digo QR, que podem ser enviados para amigos ou outros usu&aacute;rios. Eles podem seguir o link para baixar o arquivo ou pasta selecionada, independentemente de terem ou n&atilde;o uma conta DSM.</p>


<h4>Para compartilhar links do arquivo:</h4>
<ol>
<li>Selecione os arquivos ou pastas para compartilhar.</li>
<li>Clique com o bot&atilde;o direito em um arquivo ou pasta selecionada, ou clique no menu <b>A&ccedil;&atilde;o</b>. Em seguida, selecione <b>Compartilhar links do arquivo</b>.</li>
<li>Os links compartilhados e c&oacute;digos QR s&atilde;o exibidos na janela que &eacute; aberta.</li>
<li>As seguintes op&ccedil;&otilde;es tamb&eacute;m podem ser modificadas:
<ul>
 <li><strong>Per&iacute;odo de validade</strong>: Voc&ecirc; pode personalizar os per&iacute;odos de acesso v&aacute;lidos e tempos de acesso para links compartilhados. 
  <ul>
<li><strong>Personalizar per&iacute;odo de validade</strong>: Voc&ecirc; pode determinar quanto tempo um link compartilhado permanecer&aacute; ativo ap&oacute;s a cria&ccedil;&atilde;o. O link se tornar&aacute; inv&aacute;lido quando passar o per&iacute;odo especificado.</li>
<li><strong>Personalize tempos de acesso v&aacute;lidos</strong>: Voc&ecirc; pode determinar quantas vezes um link compartilhado pode ser acessado. O link se tornar&aacute; inv&aacute;lido quando passar as vezes especificadas.</li>
</ul>
</li>
<li><strong>Compartilhar com os usu&aacute;rios do DSM</strong>: Voc&ecirc; pode compartilhar o link com usu&aacute;rios ou grupos do DSM selecionando-os na lista suspensa. Observe que n&atilde;o &eacute; poss&iacute;vel compartilhar com a conta de convidado e grupos de usu&aacute;rios.</li>

<li><strong>Compartilhar com outros</strong>: Voc&ecirc; pode compartilhar links protegidos por senhas com outras pessoas, incluindo usu&aacute;rios n&atilde;o DSM.</li>

</ul>
</li>
</ol>

<h4> Para habilitar os links de gofile.me: </h4> 
<ol>
<li>V&aacute; para <strong>Painel de Controle</strong> &gt; <strong>QuickConnect</strong> e verifique se <strong>Ativar QuickConnect</strong> est&aacute; marcado. Se voc&ecirc; n&atilde;o configurou o QuickConnect, poder&aacute; faz&ecirc;-lo nessa p&aacute;gina.</li>
<li>Em seguida, clique em <strong>Avan&ccedil;ado</strong> e verifique se <strong>Compartilhamento de arquivos</strong> est&aacute; marcado.</li>
<li>V&aacute; para <strong>Painel de Controle</strong> &gt; <strong>Rede</strong> <strong>Configura&ccedil;&otilde;es do DSM</strong> e verifique se <strong>Ativar conex&atilde;o HTTPS</strong> est&aacute; marcado. Os arquivos compartilhados podem ser baixados sem ter uma conta DSM acessando o link de compartilhamento de gofile.me.</li> 
</ol>

<h3>Gerenciando links compartilhados</h3>
<p>Os links compartilhados existentes podem ser gerenciados indo para <strong>Ferramentas</strong> &gt; <strong>Gerenciadores de links compartilhados</strong>. Na janela que aparece, existem op&ccedil;&otilde;es para editar, compartilhar ou remover os links compartilhados existentes.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ol>
  <li>Voc&ecirc; pode criar at&eacute; 1000 links compartilhados.</li>
  <li>A se&ccedil;&atilde;o <strong>Status</strong> de cada link compartilhado exibe uma das seguintes op&ccedil;&otilde;es:
<ul>
<li><b>V&aacute;lido</b>: O link compartilhado est&aacute; funcionando adequadamente.</li>
<li><b>Expirado</b>: O per&iacute;odo de validade do link compartilhado expirou.</li>
<li><b>Inv&aacute;lido</b>: O arquivo ou pasta compartilhada n&atilde;o existe mais ou voc&ecirc; n&atilde;o tem privil&eacute;gio suficiente para acess&aacute;-lo(a).</li>
<li><b>Ainda n&atilde;o em vigor</b>: O link compartilhado ainda n&atilde;o se tornou ativo.</li>
</ul>
</li>
</ol>

</div>
</body>
</html>
