<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Editor de Texto</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Editor de Texto</h1>
<p>O Editor de Texto &eacute; um editor de texto e c&oacute;digo altamente vers&aacute;til, permitindo acessar rapidamente e editar arquivos de texto ou c&oacute;digos em seu DiskStation direto de um navegador da Web.</p>

<h3>Gerenciamento de arquivos</h3>
<h4>Para criar arquivos novos:</h4> 
<p>Clique em <b>Arquivo</b> e escolha <b>Novo</b>. Uma nova guia vazia aparecer&aacute; com o t&iacute;tulo <b>Novo Documento.txt</b>.</p>

<h4>Para abrir arquivos do Editor de Texto:</h4> 
<p>Simplesmente clique em <b>Arquivo</b> e escolha <b>Abrir</b>. Uma caixa de di&aacute;logo aparecer&aacute; e voc&ecirc; pode selecionar um arquivo com a codifica&ccedil;&atilde;o de caractere espec&iacute;fica e necess&aacute;ria para abrir em uma guia. Se o arquivo j&aacute; estiver aberto, o Editor de Texto mostrar&aacute; que o arquivo est&aacute; em seu estado atual.</p> 

<h4>Para abrir arquivos do File Station:</h4> 
<p>No File Station, simplesmente clique com o bot&atilde;o direito no arquivo selecionado e, em seguida, clique em <b>Abrir com Editor de Texto</b> no menu de contexto. Se o arquivo j&aacute; estiver aberto, o Editor de Texto mostrar&aacute; que o arquivo est&aacute; em seu estado atual. Outra forma de abrir um arquivo &eacute; arrastar um ou v&aacute;rios arquivos do File Station para o Editor de Texto usando o cursor.</p><br><div class="section">
<p><b>Observa&ccedil;&atilde;o:</b></p>
<p>O Editor de Texto n&atilde;o pode abrir arquivos que excedam 10 MB.</p>
</div>

<h4>Para salvar arquivos:</h4> 
<p>Simplesmente clique em <b>Arquivo</b> e escolha <b>Salvar</b>. Se for um arquivo existente, ele ser&aacute; substitu&iacute;do pelo conte&uacute;do atual. Se deseja salvar todos os arquivos que abriu de uma s&oacute; vez, pode ir para <b>Arquivo</b> &gt; <b>Salvar todos</b>. Se o arquivo ainda n&atilde;o tiver nome (um arquivo novo), ou se voc&ecirc; selecionou <b>Arquivo</b> &gt; <b>Salvar como</b>, uma caixa de di&aacute;logo ser&aacute; exibida, solicitando o nome do arquivo. Voc&ecirc; pode escolher o local, o nome do arquivo e a codifica&ccedil;&atilde;o para salvar o arquivo.</p>

<h4>Para fechar os arquivos:</h4> 
<p>Simplesmente clique em <b>Arquivo</b> e escolha <b>Fechar</b>. Outra forma de fechar um arquivo &eacute; clicando no bot&atilde;o fechar em cada guia. Se houver dados n&atilde;o salvos em um arquivo, o Editor de Texto sempre perguntar&aacute; se voc&ecirc; deseja fechar sem salvar as altera&ccedil;&otilde;es.</p>

</ul>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>Voc&ecirc; pode salvar arquivos com a codifica&ccedil;&atilde;o de caractere espec&iacute;fica para suportar idiomas bidirecionais. Tamb&eacute;m pode especificar uma codifica&ccedil;&atilde;o ao abrir um arquivo, assim o Editor de Texto abrir&aacute; o arquivo corretamente.</p>
</div>

<h3>Editar</h3>
<ul>
<li><strong>Opera&ccedil;&otilde;es padr&atilde;o</strong><br> O controle de edi&ccedil;&atilde;o suporta Desfazer, Refazer e Selecionar todos. Essas opera&ccedil;&otilde;es podem ser encontradas na maior parte dos editores e funcionam de maneira muito parecida. Voc&ecirc; pode executar essas opera&ccedil;&otilde;es selecionando o item de menu correspondente no menu <b>Editar</b>. Al&eacute;m disso, por padr&atilde;o as opera&ccedil;&otilde;es Cortar, Copiar e Colar est&atilde;o dispon&iacute;veis por meio do menu de contexto do navegador.</li>

<li><strong>Recuo</strong><br> Recuar o texto &eacute; uma opera&ccedil;&atilde;o comum quando se trata de edi&ccedil;&atilde;o de c&oacute;digo fonte. O recuo &eacute; a adi&ccedil;&atilde;o de espa&ccedil;o em branco extra no come&ccedil;o da linha para separar blocos de texto, adicionando uma hierarquia. Normalmente ao editar, pressionando a tecla Tab ser&aacute; inserido um caractere de tabula&ccedil;&atilde;o no local atual. Entretanto, se algum texto for selecionado, pressionando a tecla Tab ser&aacute; adicionado espa&ccedil;o em branco no in&iacute;cio de cada linha que possui um texto selecionado, permitindo que voc&ecirc; recue blocos inteiros de texto de uma s&oacute; vez. Pressionando Shift e Tab ao mesmo tempo remover&aacute; o recuo.</li>

<li><strong>Sobrescrever</strong><br> Voc&ecirc; pode ativar ou desativar esta fun&ccedil;&atilde;o pressionando a tecla Insert. Ou seja, em vez de inserir caracteres na posi&ccedil;&atilde;o do cursor, voc&ecirc; os substitui. O cursor exibido mudar&aacute; de formato de acordo com o status da substitui&ccedil;&atilde;o.</li>

<li><strong>Edi&ccedil;&atilde;o de modo de coluna</strong><br> Uma maneira especial de editar arquivos &eacute; a edi&ccedil;&atilde;o no modo de coluna. Isso significa que o texto pode ser selecionado em colunas, em vez de linhas. Para iniciar uma sele&ccedil;&atilde;o no modo de coluna, solte a tecla Alt quando selecionar o texto, movendo o cursor para baixo ou para cima, conforme necess&aacute;rio. Quando o texto &eacute; selecionado no chamado modo de coluna, a digita&ccedil;&atilde;o alterar&aacute; cada coluna de caracteres selecionada para o caractere digitado.</li>
</ul>


<h3>Pesquisando</h3>
<ul>
<li><strong>Pesquisa normal</strong><br> Voc&ecirc; pode pesquisar texto como em muitos programas, usando a caixa de di&aacute;logo Localizar. Voc&ecirc; pode abrir essa caixa de di&aacute;logo selecionando <b>Pesquisar</b> &gt; <b>Localizar</b>. Essa caixa de di&aacute;logo sempre fica na parte superior da p&aacute;gina, e n&atilde;o &eacute; poss&iacute;vel continuar editando o texto se ela estiver aberta. No campo de pesquisa, digite o texto que deseja localizar.</li>

<li><strong>Substituir</strong><br> Voc&ecirc; pode localizar e substituir texto como em muitos programas, usando a caixa de di&aacute;logo Substituir. Voc&ecirc; pode abrir essa caixa de di&aacute;logo selecionando <b>Pesquisar</b> &gt; <b>Substituir</b>. <b>Substituir tudo</b> substituir&aacute; todas as ocorr&ecirc;ncias da consulta pelo texto de substitui&ccedil;&atilde;o. </li>

<li><strong>Diferenciar mai&uacute;sculas de min&uacute;sculas</strong><br> Refor&ccedil;a que as dicas t&ecirc;m exatamente a mesma capitaliza&ccedil;&atilde;o que a consulta. Se n&atilde;o estiver marcada, a pesquisa n&atilde;o diferencia mai&uacute;sculas de min&uacute;sculas.</li>

<li><strong>Apenas palavras inteiras</strong><br> Resultar&aacute; em uma dica somente se corresponder &agrave; palavra inteira, e n&atilde;o a uma parte dela. Por exemplo, se voc&ecirc; procurar por &quot;exem&quot; com a op&ccedil;&atilde;o <strong>Apenas palavras inteiras</strong>, ent&atilde;o localizar&aacute; &quot;exem&quot; somente, em vez de &quot;exemplo&quot;.</li>

<li><strong>Express&atilde;o regular</strong><br> A consulta ser&aacute; tratada como uma express&atilde;o regular.</li>
</ul>


<div class="section">
<h4>O que &eacute; uma express&atilde;o regular?</h4>
<p>Uma express&atilde;o regular &eacute; uma sequ&ecirc;ncia de caracteres que forma um padr&atilde;o de pesquisa para uma t&eacute;cnica de economia de tempo poderosa. Um uso muito simples de uma express&atilde;o regular seria localizar a mesma palavra com duas ortografias diferentes em um editor de texto, por exemplo N[&oacute;s]oz.</p>
</div>

<h3>Configurador de Estilo</h3>
<p>O configurador de estilo &eacute; usado principalmente para controlar a apar&ecirc;ncia do texto no Editor de Texto.<br> A lista suspensa na parte direita inferior cont&eacute;m todas linguagens de programa&ccedil;&atilde;o suportadas que podem ser configuradas para ajud&aacute;-lo a construir um ambiente de codifica&ccedil;&atilde;o apropriado.</p>

<h3>Prefer&ecirc;ncias</h3>
<ul>
<li><strong>Exibir caracteres invis&iacute;veis</strong><br> Se marcada, os caracteres de espa&ccedil;os, tabula&ccedil;&otilde;es, novas linhas ou retornos de linha ser&atilde;o exibidos.</li>

<li><strong>Exibir guias de indenta&ccedil;&atilde;o</strong><br> Se marcada, as guias de indenta&ccedil;&atilde;o ser&atilde;o exibidas. Isso &eacute; &uacute;til para alinhar c&oacute;digos na linguagem de codifica&ccedil;&atilde;o.</li>

<li><strong>Destacar linha atual</strong><br> Se marcada, a linha em que o cursor est&aacute; ser&aacute; apresentada com uma cor de plano de fundo especial.</li>

<li><strong>Destacar palavra selecionada</strong><br> Se marcada, todas as palavras (n&atilde;o parte delas) dentro do mesmo arquivo de texto que correspondem &agrave; palavra selecionada ser&atilde;o automaticamente destacadas.</li>

<li><strong>Exibir n&uacute;meros de linha</strong><br> Se marcada, os n&uacute;meros de linha ser&atilde;o exibidos.</li>

<li><strong>Ativar dobra de c&oacute;digo</strong><br> Se marcada, certas linhas de seus c&oacute;digos podem ficar ocultas, de acordo com determinadas peculiaridades. Esse recurso funciona bem para linguagens estruturadas, como C++ ou XML. Quando <b>Esconder expansores de visualiza&ccedil;&atilde;o automaticamente</b> estiver marcada, certas linhas de c&oacute;digos ser&atilde;o dobradas automaticamente. Voc&ecirc; tamb&eacute;m pode escolher marcar somente colchetes iniciais ou ambos, de in&iacute;cio e fechamento, com os expansores de visualiza&ccedil;&atilde;o.</li>  

<li><strong>Ajustar Palavra</strong><br> Especifica se seu texto &eacute; ajustado ao limite da janela ou em um n&uacute;mero de coluna espec&iacute;fico, sem inserir um retorno de linha.</li>

<li><strong>Anexar automaticamente caracteres de fechamento</strong><br> Se marcada, colchetes de fechamento (caracteres) ser&atilde;o anexados automaticamente em seus c&oacute;digos.</li>

<li><strong>Inserir espa&ccedil;os em vez de tabula&ccedil;&otilde;es</strong><br> Se marcada, ao pressionar a tecla Tab ser&atilde;o adicionados caracteres de espa&ccedil;o em vez de um caractere de tabula&ccedil;&atilde;o. <b>Largura da aba</b> pode ser definida pelo n&uacute;mero de caracteres em <b>Prefer&ecirc;ncias</b> &gt; <b>Fonte e cor</b>.</li>

<li><strong>Codifica&ccedil;&atilde;o padr&atilde;o</strong><br> A codifica&ccedil;&atilde;o padr&atilde;o &eacute; usada para salvar arquivos com codifica&ccedil;&atilde;o de caractere espec&iacute;fica para suportar idiomas bidirecionais. Tamb&eacute;m pode especificar uma codifica&ccedil;&atilde;o ao abrir um arquivo, assim o Editor de Texto abrir&aacute; o arquivo corretamente.</li>

<li><strong>Fonte e Cor</strong><br> <b>Largura da aba</b>, <b>Tamanho da fonte</b> e <b>Tema</b> podem ser personalizados de acordo com sua prefer&ecirc;ncia pessoal. <b>Largura da aba</b> &eacute; definida pelo n&uacute;mero de caracteres de espa&ccedil;o.</li>
</ul>

<div class="section">
<h4>Formatos de arquivo suportados</h4>
<p>O Editor de Texto suporta somente arquivos de texto simples. Os arquivos de texto com formata&ccedil;&atilde;o RTF como *.doc e *.pdf n&atilde;o ser&atilde;o suportados.</p>
</div>

</body>
</html>
