<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Centre des journaux</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Recherche des journaux</h2>
<p>Sur la page <strong>Centre des journaux</strong> &gt; <strong>Recherche de journaux</strong>, vous pouvez voir, rechercher et exporter des journaux.  </p>

<h4>Pour rechercher des journaux&nbsp;:</h4>

<ol>
<li>Choisissez d'afficher les journaux du syst&egrave;me local ou les journaux d'autres services en s&eacute;lectionnant l'onglet <strong>Locaux</strong> ou <strong>Provenant d'autres serveurs</strong>.
<li>Si n&eacute;cessaire,  choisissez d'afficher <strong>Derniers journaux</strong> ou ouvrez une archive de journal existante en s&eacute;lectionnant <strong>Ouvrir archive journal</strong>.
<li>Dans le menu d&eacute;roulant de recherche, vous pouvez sp&eacute;cifier les crit&egrave;res suivants selon la situation&nbsp;: 
  <ul>
  <li><b>Mot-cl&eacute; </b>: Saisissez un mot cl&eacute; pour rechercher les messages de journal contenant le mot cl&eacute; correspondant.
  	<div class="section">
	<h4>Remarque&nbsp;:</h4>
	<p>Vous pouvez utiliser des mod&egrave;les d'expressions r&eacute;guli&egrave;res comme [<strong>*</strong>] (ce qui signifie un nombre quelconque de caract&egrave;res al&eacute;atoires) ou [<strong>?</strong>] (ce qui signifie 1 caract&egrave;re al&eacute;atoire) dans le champ du mot-cl&eacute; lors de la recherche. Par exemple, [a<span class="note_head">*</span>n] peut repr&eacute;senter [a<span class="note_head">ctio</span>n], [a<span class="note_head">ttentio</span>n], ou [an].</p>
	</div>
  </li>
  <li><strong>Plage de date&nbsp;: </strong>Recherche les journaux selon la p&eacute;riode sp&eacute;cifi&eacute;e.
  <li><b>Niveau </b>: Recherche les journaux selon le niveau sp&eacute;cifi&eacute;.</li>
  <li><b>Nom d'h&ocirc;te </b>: Recherche les journaux selon le nom d'h&ocirc;te sp&eacute;cifi&eacute;.</li>
  <li><b>Programme </b>: Recherche les journaux selon le nom de programme sp&eacute;cifi&eacute;.</li>
  <li><b>Cat&eacute;gorie </b>: Recherche les journaux selon le nom de cat&eacute;gorie sp&eacute;cifi&eacute;.</li>
  </ul>
<li>Cliquez sur <strong>Recherche</strong> pour rechercher les journaux correspondant aux crit&egrave;res sp&eacute;cifi&eacute;s.</li>
</ol>

<h4>Pour exporter des journaux&nbsp;:</h4>

<ol>
<li>Cliquez sur la fl&egrave;che &agrave; c&ocirc;t&eacute; du bouton <strong>Export</strong>.</li>
<li>Choisissez <strong>HTML</strong> ou <strong>CSV</strong> pour t&eacute;l&eacute;charger les journaux &agrave; l'aide du format d&eacute;sir&eacute;. </li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Le cryptage des caract&egrave;res des fichiers journaux export&eacute;s CSV est UTF-8. Vous devez ouvrir le fichier avec un programme qui prend en charge le cryptage UTF-8. </li>
</ul>
</div>

</body></html>
