<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Programportal</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Programportal</h1>
<p>Med Programportal kan du konfigurere tilkoblingsinnstillingene for ulike programmer, slik at du f&aring;r tilgang til og kan kj&oslash;re disse programmet i egne nettleserfaner eller -vinduer. </p>
<p>For eksempel, kan du &aring;pne File Station ved &aring; skrive inn <strong>http://:diskstation:5000/file/</strong> i nettleseren din. Tilgjengelige tilkoblingsinnstillinger omfatter egendefinerte aliaser, HTTP- og HTTPS-porter. For &aring; finne disse innstillingene, g&aring;r du til <strong>Kontrollpanel</strong> &gt; <strong>Programportal</strong>.</p>

<div class="section">
<h4>Merk:</h4>
<p>Programportal lar deg redigere tilgangsinnstillinger for ulike programmer, som Audio Station, Download Station, Surveillance Station, Video Station, File Station og andre.</p>
</div>


<h2><a name="session"></a>Egendefiner alias</h2>
<p>Med et egendefinert alias kan et program som File Station &aring;pnes ved &aring; angi en adresse som <b>http://:diskstation:5000/file/</b> i nettleseren din. </p>
<h4>Slik aktiverer du et egendefinert alias:</h4>
<ol>
<li>Velg et program.</li>
<li>Klikk p&aring; <b>Rediger</b>.</li>
<li>I vinduet som &aring;pnes merker du av for <b>Aktiver egendefinert alias</b>.</li>
<li>Spesifiser et egendefinert alias.</li>
</ol>

<div class="section">
<h4>Merk:</h4>
<ul>
<li>Du kan merke av for <strong>Omdiriger fra</strong> og bruke et kortere alias som er enklere &aring; huske til &aring; f&aring; tilgang til det valgte programmet. </li>
<li>F&oslash;lgende er de respektive standardaliasene til programmene Audio Station, Download Station, Surveillance Station, Video Station, File Station: <strong>audio</strong>, <strong>download</strong>, <strong>cam</strong>,<strong> video</strong>, <strong>file</strong>.</li>
<li>Aliasnavn kan ikke v&aelig;re de samme som dem som er reservert for systemet eller nettlesere eller brukes av andre programmer, og antall tegn m&aring; v&aelig;re begrenset til mellom 2 og 20. </li>
<li>Aliasnavn kan best&aring; av sm&aring; eller store bokstaver, numeriske tegn og to spesialtegn (-), (_), men disse to tegnene kan bare brukes mellom de andre tegnene, og ikke som f&oslash;rste eller siste tegn.
</li>
</ul>
</div>

<h2><a name="session"></a>Tilpassede HTTP- eller HTTPS-porter</h2>
<p>Med tilpassede HTTP- eller HTTPS-porter kan et program &aring;pnes ved &aring; angi en adresse som <b>http://diskstation:7000</b> eller <b>http://diskstation:7001</b>.</p>
<h4>Slik aktiverer du en tilpasset HTTP- eller HTTPS-port:</h4>
<ol>
<li>Velg et program.</li>
<li>Klikk p&aring; <b>Rediger</b>.</li>
<li>I vinduet som &aring;pnes merker du av for <b>Aktiver tilpasset port (HTTP)</b> eller <b>Aktiver tilpasset port (HTTPS)</b>.</li>
<li>Spesifiser et tilpasset portnummer.</li></ol>
<div class="section">
  <h4>Merk:</h4>
<ol>
<li>Omr&aring;det for portnummer kan v&aelig;re fra 1 til 65535, men f&oslash;lgende porter skal ekskluderes fordi de er reservert for systembruk: 20, 21, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002, standard eMule-porter: 4662 (TCP), 4672(UDP) og standard FTP-portomr&aring;de: Det faktiske omr&aring;det kan variere etter modell.</li>
</ol>
</div>
</body> </html>
