<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="download"></a>Descargar archivos</h2>

<p>Siga los siguientes pasos para descargar archivos o carpetas desde DiskStation a su ordenador.</p>
<h4>Para descargar archivos a su ordenador local:</h4>
<ol>
<li>Seleccione los archivos o carpetas que desee descargar. (Pulse y mantenga pulsada la tecla May&uacute;s o Ctrl para seleccionar varios elementos.)</li>
<li>Elija <b>Descargar</b> desde el men&uacute; <b>Acci&oacute;n</b> y luego elija una de las siguientes opciones:</li>
<ul>
<li><b>Descargar</b>: Elija esta opci&oacute;n para descargar los archivos con ayuda de la funcionalidad de descarga de su navegador Web.</li>
<li><b>Agregar a la cola</b> - <b>Sobrescribir</b> o <b>Agregar a la cola</b> - <b>Omitir</b>: En funci&oacute;n de si desea sobrescribir archivos o carpeta con el mismo nombre en el destino, elija cualquiera de las opciones para a&ntilde;adir los archivos a la cola de descarga (que aparecer&aacute;n haciendo clic en la flecha de descarga en la esquina superior derecha).</ul>
</li>
</ol>

<ol><span class="note_head">Nota:</span><li>En el entorno Windows, los caracteres <span class="note_content">\ * ? &quot; < > | :</span></span>  contenidos en el nombre de archivo ser&aacute;n sustituidos por <span class="note_content">-</span> despu&eacute;s de la descarga.</li>
<li>Si selecciona descargar varios archivos, los archivos seleccionados se archivar&aacute;n en un archivo .zip con la p&aacute;gina de c&oacute;digo de File Station indicada en <strong>Configuraci&oacute;n</strong> &gt; <strong>General</strong> antes de realizar la descarga.</li>
</ol>
<h2><a name="link"></a>Obtener el v&iacute;nculo de descarga del archivo o carpeta</h2>
<p>Puede obtener el v&iacute;nculo de descarga de un archivo o carpeta y compartirlo con otros usuarios.</p>
<h4>Para obtener el v&iacute;nculo de descarga de un archivo o carpeta:</h4>
<ol>
<li>Seleccione el archivo o carpeta del cual desea obtener un v&iacute;nculo de descarga.</li>
<li>Realice una de las siguientes opciones para abrir la ventana Propiedades:</li>
<ul>
<li>Elija <b>Propiedades</b> en el men&uacute; <b>Acci&oacute;n</b>.</li>
<li>Haga clic con el bot&oacute;n secundario en los archivos y carpetas y elija <b>Propiedades</b>.</li>
</ul>
<li>Haga clic con el bot&oacute;n derecho en el v&iacute;nculo de descarga y elija la funci&oacute;n correspondiente del men&uacute; contextual para copiar el v&iacute;nculo de descarga. El nombre de la funci&oacute;n podr&aacute; variar en funci&oacute;n del navegador web que utilice.</li>

<li>Env&iacute;e el v&iacute;nculo a otros usuarios por correo electr&oacute;nico o por mensajer&iacute;a instant&aacute;nea. Podr&aacute;n descargar el archivo o carpeta vinculada escribiendo su nombre de usuario y contrase&ntilde;a.</li>
</ol>
<p><span class="note_head">Nota:</span> Para descargar un archivo o carpeta con el v&iacute;nculo de descarga, es necesario un nombre de usuario y una contrase&ntilde;a v&aacute;lidos.</p>
</body>
</html>
