<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Buscar archivos o carpetas</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Buscar archivos o carpetas</h2>
<p>El <strong>Filtro</strong> de File Station le ofrece opciones para buscar y visualizar archivos o carpetas que cumplen sus criterios. Puede filtrar archivos o carpetas en la carpeta actual, o bien realizar una b&uacute;squeda avanzada que abarque todas las subcarpetas para obtener unos resultados m&aacute;s refinados. </p>
<h4>Buscar archivos o carpetas en la carpeta actual:</h4>

<ol>
<li>Utilice File Station para ir a la carpeta que contiene contenido que desea buscar.</li>
<li>En el campo <b>Filtrar</b> en la esquina superior derecha del campo, escriba una palabra clave y ver&aacute; los resultados filtrados en el &aacute;rea principal de la ventana.</li>
</ol>
<h4>Para realizar una b&uacute;squeda avanzada:</h4>
<ol>
<li>Utilice File Station para ir a la carpeta que contiene contenido que desea buscar.</li>
<li>Haga clic en el icono de lupa que hay junto al campo <b>Filtro</b> en la esquina superior derecha para ver el men&uacute; de b&uacute;squeda avanzada.</li>

<li>Introduzca la informaci&oacute;n o elija de los men&uacute;s desplegables para los siguientes criterios de b&uacute;squeda:</li>
<ul>
<li><b>Palabra clave</b>: Introduzca una palabra clave para buscar archivos o carpetas con los nombres coincidentes.<div class="section">
<h4>Nota:</h4>
<ul>
<li>Puede utilizar los comodines [*] (que significa 0 o m&aacute;s caracteres) y [?] (que significa un car&aacute;cter aleatorio) en los teclados. Por ejemplo, [a<span class="note_content">*</span>n] puede representar [a<span class="note_content">ctio</span>n], [a<span class="note_content">ttentio</span>n], o [an].</li>
<li>Puede utilizar comas (,) para separar varias palabras clave. Por ejemplo, [<span class="note_content">a,tion</span>] puede representar [<span class="note_content">a</span>c<span class="note_content">tion</span>], [<span class="note_content">a</span> func<span class="note_content">tion</span>], [func<span class="note_content">tion</span> <span class="note_content">a</span>dded], o n<span class="note_content">ation</span>.</li>
<li>Puede a&ntilde;adir comillas [&quot;] al principio y final de las palabras clave para buscar coincidencias exactas. Por ejemplo, [<span class="note_content">&quot;a typ&quot;</span>] puede representar [<span class="note_content">a typ</span>e], pero no puede representar [<span class="note_content">typ</span>ic<span class="note_content">a</span>l].</li>
</ul>
</div>
</li>


<li><b>Ubicaci&oacute;n</b>: Seleccione en el men&uacute; desplegable para establecer el rango y la profundidad de la b&uacute;squeda avanzada. Tambi&eacute;n puede personalizar el &aacute;mbito de b&uacute;squeda seleccionando cualquier otra carpeta compartida de la lista.</li>
<li><b>Tipo de archivo</b>: Elija <b>Extensi&oacute;n</b> para limitar el &aacute;mbito de b&uacute;squeda a tipos de archivos espec&iacute;ficos; tambi&eacute;n puede elegir <b>Cualquier carpeta</b> para buscar solo en carpetas.</li>
<li><b>Fecha:</b> Elija <b>Fecha de modificaci&oacute;n</b>, <b>Fecha de creaci&oacute;n</b> o <b>&Uacute;ltimo acceso</b>, y luego elija una fecha del calendario para buscar archivos con fechas coincidentes.</li>
<li><b>Tama&ntilde;o (MB)</b>: Elija entre <b>igual a</b>, <b>es mayor que</b>, y <b>es menor que</b>, e introduzca un tama&ntilde;o para buscar archivos con los tama&ntilde;os coincidentes. (Si elige <strong>igual a</strong>, los resultados de la b&uacute;squeda incluir&aacute;n archivos de aproximadamente el mismo tama&ntilde;o especificado).</li>
<li><b>Propietario/Grupo</b>: Elija <b>Propietario</b> o <b>Grupo</b>, y luego elija del men&uacute; desplegable para buscar archivos o carpetas que pertenezcan al propietario o grupo seleccionados.<div class="section">
<h4>Nota:</h4>
<ul>
<li>Para realizar b&uacute;squedas avanzadas deber&aacute; especificar una <b>Ubicaci&oacute;n</b> y al menos otro criterio de b&uacute;squeda.</li>
<li>Si se monta una carpeta ISO en una carpeta remota o en una carpeta compartida indexada, no podr&aacute; encontrar los archivos en su interior con la b&uacute;squeda avanzada.</li>
</ul>
</div>
</li>

<li>Haga clic en <b>Buscar</b> para iniciar la b&uacute;squeda, o haga clic en <b>Restablecer</b> y vuelva a especificar los criterios de b&uacute;squeda. Una vez completada la b&uacute;squeda, los archivos coincidentes se enumerar&aacute;n en el &aacute;rea principal de File Station.</li>

</ol>
</body>
</html>
