<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Sauvegarder vos donn&eacute;es sur le NAS Synology pour garantir la s&eacute;curit&eacute; des donn&eacute;es</title>
</head>

<body class="tutorial-content-box" >

<h1>Sauvegarder vos donn&eacute;es sur le NAS Synology pour garantir la s&eacute;curit&eacute; des donn&eacute;es</h1>
<div class="tutorials_content">
<img src="../../images/Backup/1x/Backup/back_up_your_data_on_synology_nas_to_ensure_data_security.jpg" />
<h2>Vue d'ensemble</h2>
<p>Une d&eacute;faillance impr&eacute;visible du serveur ou un plantage de volume repr&eacute;sente un risque grave pour vos donn&eacute;es primordiales. Le NAS Synology fournit aux utilisateurs des alternatives, que ce soit en local ou &agrave; distance, pour sauvegarder des copies de s&eacute;curit&eacute; de vos donn&eacute;es les plus importantes, ainsi, vous &ecirc;tes toujours pr&ecirc;t pour le pire. Vous pouvez choisir de sauvegarder d'une ou plusieurs mani&egrave;res pour r&eacute;duire le risque de perte de donn&eacute;es, en fonction des besoins et situations de votre entreprise.</p>

<h3 class="list_head">1. Sauvegarder sur un p&eacute;riph&eacute;rique de stockage externe</h3>
<p> Lorsque vous sauvegardez en local, vous pouvez choisir de d&eacute;finir la destination de sauvegarde dans un autre dossier dans le m&ecirc;me volume, un groupe RAID, ou m&ecirc;me le m&ecirc;me disque physique. Dans ce cas, si vos donn&eacute;es sont supprim&eacute;es par erreur, vous pourrez les r&eacute;cup&eacute;rer depuis les copies sauvegard&eacute;es dans un autre dossier. Cependant, face &agrave; des pannes malheureuses du serveur ou un plantage de volume, vos donn&eacute;es, ainsi que les copies sauvegard&eacute;es, peuvent &ecirc;tre perdues. Par cons&eacute;quent, il est toujours sugg&eacute;r&eacute; de sauvegarder vos donn&eacute;es importantes sur un p&eacute;riph&eacute;rique de stockage externe, plut&ocirc;t que sur le m&ecirc;me serveur. Le NAS Synology permet aux utilisateurs de d&eacute;finir leur destination de sauvegarde non seulement sur des disques locaux, mais aussi sur des p&eacute;riph&eacute;riques USB externes. La fonction est disponible dans <b>Menu principal &gt; Sauvegarde et r&eacute;plication</b>. Pour des instructions d&eacute;taill&eacute;es, veuillez voir <a href="http://help.ecore.cloud/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=fre#local_backup">ici</a>.</p>

<h3 class="list_head">2. Sauvegarder sur un autre NAS Synology sur le r&eacute;seau</h3>
<p>Sauvegarder vos donn&eacute;es sur un p&eacute;riph&eacute;rique de stockage externe am&eacute;liore la disponibilit&eacute; des donn&eacute;es, mais pensez au risque de catastrophes telles que les incendies ou les tremblements de terre, sur le lieu o&ugrave; se trouvent votre serveur et les p&eacute;riph&eacute;riques de stockage. Le NAS Synology permet aux utilisateurs de configurer une sauvegarde hors site par le transfert des copies de vos donn&eacute;es vers un autre serveur ailleurs sur le r&eacute;seau, minimisant ainsi le risque de perte de donn&eacute;es due aux catastrophes sur le lieu du serveur. Le transfert des donn&eacute;es de sauvegarde peut &ecirc;tre chiffr&eacute; pour prot&eacute;ger vos donn&eacute;es importantes avec un niveau de s&eacute;curit&eacute; plus &eacute;lev&eacute;. Avec l'option de sauvegarde au niveau des blocs, votre NAS ne sauvegardera que les blocs modifi&eacute;s, ce qui est particuli&egrave;rement pratique quand la sauvegarde est ex&eacute;cut&eacute;e sur Internet. La fonction est disponible dans <b>Menu principal &gt; Sauvegarde et r&eacute;plication</b>. Pour des instructions d&eacute;taill&eacute;es, veuillez voir <a href="http://help.ecore.cloud/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=fre#network_backup">ici</a>.</p>

<h3 class="list_head">3. Sauvegarder sur un stockage public sur le cloud</h3>
<p>La sauvegarde distante entre diff&eacute;rents NAS n&eacute;cessite deux serveurs ou plus, y compris un certain nombre de disques int&eacute;gr&eacute;s, et des lieux pour installer vos serveurs. La situation de votre entreprise peut ne pas vous permettre de configurer une sauvegarde hors site avec plusieurs NAS. Pour apporter une solution &agrave; la question du d&eacute;ploiement NAS non viable pour la sauvegarde r&eacute;seau, la fonction de sauvegarde de Synology offre une prise en charge de plusieurs services de cloud public, ce qui vous permet de sauvegarder les donn&eacute;es directement sur votre compte de cloud public. La fonction est disponible dans <b>Sauvegarde et r&eacute;plication</b> ou <b>Centre de paquets</b> selon votre stockage en cloud public pr&eacute;f&eacute;r&eacute;. Pour des instructions d&eacute;taill&eacute;es, veuillez voir <a href="http://help.ecore.cloud/dsm/?section=DSM&version=5.2&link=BackupApp%2Frepository.html&lang=fre#cloudservice_backup">ici</a>.</p>
</div>

</body>

</html>