<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta content="en-us" http-equiv="Content-Language" />
<meta content="text/html; charset=UTF-8" http-equiv="Content-Type" />
<title>Zač&iacute;n&aacute;me s Cloud Station</title>
</head>

<body class="tutorial-content-box" >

<h1>Synchronizujte soubory mezi Synology NAS a poč&iacute;tačem pomoc&iacute; Cloud Station</h1>
<div class="tutorials_content">

<img src="../../images/BuildCloud/1x/cloud_sync_files/02_1_build_your_private_cloud_CloudStation.png"/>

<h2>Přehled</h2>
<p>Cloud Station pro zař&iacute;zen&iacute; Synology NAS je aplikace pro synchronizaci souborů, kter&aacute; v&aacute;m umožn&iacute; jednodu&scaron;e synchronizovat soubory na va&scaron;em zař&iacute;zen&iacute; Synology NAS s ostatn&iacute;mi zař&iacute;zen&iacute;mi, jako jsou poč&iacute;tače nebo mobiln&iacute; zař&iacute;zen&iacute; (s aplikac&iacute; DS cloud). Jakmile budete m&iacute;t službu Cloud Station nainstalovanou na Synology NAS i na poč&iacute;tači, budou soubory uložen&eacute; v určit&eacute; složce na poč&iacute;tači automaticky synchronizov&aacute;ny se zař&iacute;zen&iacute;m Synology NAS.</p>


<iframe width="640" height="360" src="//www.youtube.com/embed/kZX8XK9Wy2Y" frameborder="0" allowfullscreen></iframe>

<h3 class="list_head">1. Instalace aplikace Cloud&nbsp;Station</h3>
<ol>
<li>Přejděte na <b>Centrum bal&iacute;čků</b>, vyhledejte <b>Cloud Station</b>, potom klepněte na možnost <strong>Instalovat</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/1.png" />
</ol>

<h3 class="list_head">2. Povolen&iacute; aplikace&nbsp;Cloud&nbsp;Station</h3>
<ol>
<li>Spusťte aplikaci <b>Cloud Station</b>.

<li>Pokud jste nepovolili funkci složky uživatele, budete k&nbsp;tomuto kroku vyzv&aacute;ni. Klepněte na tlač&iacute;tko <b>OK</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/01.png" />
<li>Budete přesměrov&aacute;ni na str&aacute;nku nastaven&iacute; uživatele. Povolte uživatele homes a&nbsp;klikněte na možnost <b>Použ&iacute;t</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/02.png" />
<li>Nyn&iacute; přejděte zpět do aplikace <b>Cloud Station</b>, kde&nbsp;budete vyzv&aacute;ni k&nbsp;tomu, abyste ji povolili. Klikněte na možnost <b>Ano</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/03.png" />
<li>Přejděte do č&aacute;sti <b>Opr&aacute;vněn&iacute;</b> a&nbsp;zadat, kteř&iacute; uživatel&eacute; mohou použ&iacute;vat aplikaci Cloud Station. Klepněte na možnost <b>Uložit</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/04.png" />
</ol>

<h3 class="list_head">3. Instalace a povolen&iacute; klienta</h3>
<ol>
<li>Přejděte do č&aacute;sti <b>Cloud Station</b> &gt; <b>Přehled</b> a&nbsp;klikněte na tlač&iacute;tko <b>Poč&iacute;tače</b>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/05.png" />
<li>Kliknut&iacute;m na tlač&iacute;tko st&aacute;hnete aplikaci Cloud Station pro v&aacute;&scaron; operačn&iacute; syst&eacute;m. (Aplikaci Cloud Station si můžete st&aacute;hnout tak&eacute; z&nbsp;webu <a href="https://www.synology.com/en-us/support/download" target="_blank">Centrum pro stahov&aacute;n&iacute; společnosti Synology</a>.)</li>
<li>Spusťte na poč&iacute;tači instalačn&iacute; program a&nbsp;nainstalujte aplikaci Cloud Station podle pokynů na obrazovce.</li>
<li>Po instalaci na poč&iacute;tači aplikaci <strong>Cloud Station</strong> spusťte. Klikněte na možnost <strong>Zač&iacute;t nyn&iacute;</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/06.png" />
<li>Zadejte adresu serveru Synology&nbsp;NAS se spu&scaron;těnou aplikac&iacute; Cloud Station (nebo QuickConnect ID), uživatelsk&eacute; jm&eacute;no a&nbsp;heslo. IP v r&aacute;mci sv&eacute; s&iacute;tě LAN můžete vyhledat klepnut&iacute;m na ikonu vyhled&aacute;v&aacute;n&iacute; vpravo. Klikněte na možnost <strong>Dal&scaron;&iacute;</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/07.png" />
<li>Vyberte, jak chcete nastavit &uacute;lohu (zde vybereme možnost <strong>Rychl&eacute; nastaven&iacute;</strong>), potom klepněte na možnost <strong>Dal&scaron;&iacute;</strong>. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/08.png" />
<li>Klepnut&iacute;m na tlač&iacute;tko <strong>Dokončit</strong> nastavov&aacute;n&iacute; složky Cloud Station dokonč&iacute;te.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/09.png" />
<li>Klepnut&iacute;m na tlač&iacute;tko <strong>Otevř&iacute;t</strong> složku Cloud Station otevřete.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/10.png" />
<li>Na hlavn&iacute;m panelu se objev&iacute; ikona Cloud Station. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/14.png" />
<li>Poklep&aacute;n&iacute;m na ikonu Cloud Station otevřete nab&iacute;dku hlavn&iacute;ho panelu. Zde můžete sledovat postup a stav sv&yacute;ch souborů. Klepnut&iacute;m na možnost <strong>Hlavn&iacute; aplikace</strong> spust&iacute;te Cloud Station. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/15.png" />
<li>Po spu&scaron;těn&iacute; se zobraz&iacute; několik tipů k použ&iacute;v&aacute;n&iacute; Cloud Station. Klepnut&iacute;m na &scaron;ipku doprava zobraz&iacute;te dal&scaron;&iacute; tipy, klepnut&iacute;m na možnost <strong>Přej&iacute;t k online n&aacute;vodům</strong> z&iacute;sk&aacute;te v&iacute;ce informac&iacute;. Pokud tipy nepotřebujete, klepněte na možnost <strong>Př&iacute;&scaron;tě již nezobrazovat</strong>.</li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/16.png" />
<li>Nyn&iacute; můžete v aplikaci Cloud Station spravovat sv&eacute; synchronizačn&iacute; &uacute;lohy. </li>
<img src="../../images/BuildCloud/1x/cloud_sync_files/17.png" />
</ol>

<h3 class="list_head">4. Synchronizace dat s mobiln&iacute;mi zař&iacute;zen&iacute;mi</h3>
<p>Služba DS cloud je dostupn&aacute; zdarma v obchodech <a href="https://itunes.apple.com/us/app/ds-cloud/id590216612?mt=8" target="_blank">Apple App Store</a> a <a href="https://play.google.com/store/apps/details?id=com.synology.dscloud" target="_blank">Google Play Store</a>. Pokud ji chcete st&aacute;hnout okamžitě, můžete naskenovat n&aacute;sleduj&iacute;c&iacute; QR k&oacute;d.</p>
<img src="../../images/BuildCloud/1x/cloud_sync_files/13.png" width="475" height="219" />
</div>
<div class="page-info">
  <ul>
    <li>Další část tohoto tématu: <a href="cloud_set_up_quickconnect.html">Přístup k zařízení Synology NAS přes Internet a sdílení souborů</a> </li>
  </ul>
</div>
</body>

</html>
