<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Modification des photos</h2>

<p>Avec File Station, vous pouvez modifier des photos &agrave; l&apos;aide des &eacute;diteurs de photos externes en ligne, comme Pixlr Editor ou Pixlr Express.</p>
<h4>Pour modifier une photo avec un &eacute;diteur de photos en ligne&nbsp;:</h4>

<ol>
<li>Recherchez le dossier dans lequel se trouve la photo.</li>
<li>Faites un clic droit sur la photo et s&eacute;lectionnez <b>Modifier dans Pixlr Editor</b> ou <b>Modifier dans Pixlr Express</b>.<ul><span class="note_head">Remarque&nbsp;: </span><li>Pixlr Editor prend en charge les formats suivants&nbsp;: jpg, gif, png, psd, pxd (images en couches Pixlr)</li>
<li>Pixlr Express prend en charge les formats suivants&nbsp;: jpg, gif, png</li>
</ul>
</li>
<li>L&apos;&eacute;diteur de photo s&eacute;lectionn&eacute; s&apos;ouvrira dans une nouvelle fen&ecirc;tre du navigateur. Vous pouvez voir votre photo en un instant puis la modifier &agrave; l&apos;aide des outils fournis.</li>
<li>Une fois la modification de votre photo termin&eacute;e, proc&eacute;dez comme suit pour l&apos;enregistrer.</li>
<ul>
<li>Pour Pixlr Express&nbsp;: Cliquez sur <b><b>Termin&eacute;</b></b>pour enregistrer votre photo dans son format et &agrave; son emplacement d&apos;origine sur DiskStation.</li>
<li>Pour Pixlr Editor&nbsp;: S&eacute;lectionnez <b>Fichier</b> &gt; <b>Sauvegarder</b>, s&eacute;lectionnez l&apos;emplacement (pouvant &ecirc;tre l&apos;emplacement d&apos;origine de la photo sur DiskStation, sur votre ordinateur, ou autres r&eacute;seaux sociaux) pour l&apos;enregistrer depuis le panneau gauche, attribuez un nouveau nom ou choisissez un nouveau format selon vos pr&eacute;f&eacute;rences puis cliquez sur <b><b>OK</b></b>.</li>
</ul>
</ol>
<p><span class="note_head">Remarque&nbsp;: </span>Afin d&apos;&eacute;diter vos photos sur n&apos;importe quel &eacute;diteur de photos en ligne, assurez-vous que l&apos;adresse IP externe de DiskStation ait bien &eacute;t&eacute; r&eacute;cup&eacute;r&eacute;e (dans <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <strong>Acc&egrave;s externe</strong> &gt; <b>DDNS</b> ou <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>R&eacute;seau</b> &gt; <b>Interface r&eacute;seau</b> &gt; <b>PPPoE</b>, selon la configuration de votre r&eacute;seau). Si votre DiskStation d&eacute;pend d&apos;un routeur, assurez-vous d&apos;avoir bien sp&eacute;cifi&eacute; la r&egrave;gle du port de transmission de DSM dans <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <strong>Acc&egrave;s externe</strong> &gt; <b>Configuration du routeur</b>. Si des probl&egrave;mes persistent pour ouvrir les &eacute;diteurs de photo, il vous faudra peut-&ecirc;tre sp&eacute;cifier le port du routeur pour DSM dans <b>Menu principal</b> &gt; <b>Panneau de configuration</b> &gt; <b>Acc&egrave;s externe</b> &gt; <b>Avanc&eacute;</b>.</p>
</body>
</html>
