<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>&Eacute;diteur de texte</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>&Eacute;diteur de texte</h1>
<p>L&apos;&eacute;diteur de texte est un &eacute;diteur de texte et de code hautement polyvalent, qui vous permet d&apos;acc&eacute;der et de modifier rapidement des fichiers ou des codes de texte sur votre DiskStation depuis un navigateur Web.</p>

<h3>Gestion de fichier</h3>
<h4>Pour cr&eacute;er de nouveaux fichiers :</h4> 
<p>Cliquez sur <b>Fichier</b> et choisissez <b>Nouveau</b>. Un nouvel onglet vide apparaitra avec le titre <b>Nouveau Document.txt</b>.</p>

<h4>Pour ouvrir les fichiers depuis l&apos;&eacute;diteur de texte :</h4> 
<p>Cliquez simplement sur <b>Fichier</b> et choisissez <b>Ouvrir</b>. Une bo&icirc;te de dialogue appara&icirc;tra et vous pourrez s&eacute;lectionner un fichier avec un codage de caract&egrave;re sp&eacute;cifique qui doit &ecirc;tre ouvert dans un onglet. SI le fichier a d&eacute;j&agrave; &eacute;t&eacute; ouvert, l&apos;&eacute;diteur de texte vous montrera ce fichier dans son &eacute;tat actuel.</p> 

<h4>Pour ouvrir les fichier depuis File Station :</h4> 
<p>Dans File Station, cliquez-droit simplement sur le fichier s&eacute;lectionn&eacute; et cliquez ensuite sur <b>Ouvrir avec &eacute;diteur de texte</b> depuis le menu de contexte. SI le fichier a d&eacute;j&agrave; &eacute;t&eacute; ouvert, l&apos;&eacute;diteur de texte vous montrera ce fichier dans son &eacute;tat actuel. L&apos;autre fa&ccedil;on d&apos;ouvrir un fichier est de le ou les faire glisser depuis File Station vers l&apos;&eacute;diteur de texte en utilisant le curseur.</p><br><div class="section">
<p><b>Remarque&nbsp;:</b></p>
<p>L&apos;&eacute;diteur de texte ne peut pas ouvrir un fichier d&eacute;passant 10 Mo. </p>
</div>

<h4>Pour sauvegarder les fichiers :</h4> 
<p>Cliquez simplement sur <b>Fichier</b> et choisissez <b>Sauvegarder</b>. Si c&apos;est un fichier existant, il doit &ecirc;tre effac&eacute; avec les contenus actuels. Si vous voulez sauvegarder tous les fichiers que vous avez ouverts simultan&eacute;ment, vous pouvez aller dans <b>Fichier</b> &gt; <b>Sauvegarder tout</b> Si le fichier n&apos;a pas encore de nom (un nouveau fichier), ou vous s&eacute;lectionnez <b>Fichier</b> &gt; <b>Sauvegarder en tant que</b>, une bo&icirc;te de dialogue s&apos;ouvrira, vous demandant le nom du fichier. Vous pouvez alors choisir l&apos;emplacement, le nom du fichier, et le codage pour sauvegarder le fichier.</p>

<h4>Pour fermer les fichiers :</h4> 
<p>Cliquez simplement sur <b>Fichier</b> et choisissez <b>Fermer</b>. L&apos;autre fa&ccedil;on de fermer un fichier est de cliquer sur le bouton fermer sur chaque onglet. Si vous avez des donn&eacute;es non sauvegard&eacute;es dans un fichier, l&apos;&eacute;diteur de texte vous demandera si vous voulez le fermer sans sauvegarder les modifications.</p>

</ul>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>Vous pouvez &eacute;galement sauvegarder les fichiers avec un codage de caract&egrave;re sp&eacute;cifique pour prendre en charge les langues bidirectionnelles. Vous pouvez &eacute;galement sp&eacute;cifier un codage lors de l&apos;ouverture d&apos;un fichier afin que l&apos;&eacute;diteur de texte affiche correctement le fichier.</p>
</div>

<h3>Modification</h3>
<ul>
<li><strong>Op&eacute;rations standards</strong><br> Le contr&ocirc;le de modification prend en charge Annuler, R&eacute;tablir et S&eacute;lectionner tout. Ces op&eacute;rations peuvent &ecirc;tre trouv&eacute;es dans la plupart des &eacute;diteurs et effectu&eacute;es dans des fa&ccedil;ons tr&egrave;s semblables. Vous pouvez effectuer ces op&eacute;rations en s&eacute;lectionnant l&apos;&eacute;l&eacute;ment du menu correspondant dans le menu <b>Modifier</b>. De plus, les options Couper, Copier et Coller par d&eacute;faut sont disponibles dans le menu de contexte du navigateur.</li>

<li><strong>Indentation</strong><br> Le texte indent&eacute; est une op&eacute;ration commune lors du traitement avec la modification du code source. L&apos;indentation est l&apos;addition de l&apos;espacement suppl&eacute;mentaire au d&eacute;but d&apos;une ligne vers des blocs de texte s&eacute;par&eacute;s, ajoutant une hi&eacute;rarchie. Normalement lors de la modification, une tabulation sera ins&eacute;r&eacute;e sur l&apos;emplacement actuel en appuyant sur la touche Tab. Cependant, si du texte est s&eacute;lectionn&eacute;, appuyer sur la touche Tab ajoutera un espacement suppl&eacute;mentaire au d&eacute;but de chaque ligne qui a du texte s&eacute;lectionn&eacute;, vous permettant d&apos;indenter des blocs de texte entiers en m&ecirc;me temps. L&apos;indentation sera retir&eacute; en appuyant sur Shift et Tab en m&ecirc;me temps.</li>

<li><strong>Remplacer</strong><br> Vous pouvez activer et d&eacute;sactiver le remplacement en appuyant sur la touche Insert. Par ce fait, au lieu d&apos;ins&eacute;rer des caract&egrave;res au curseur, vous les remplacez. Le curseur affich&eacute; modifiera la forme avec selon l&apos;&eacute;tat de remplacement.</li>

<li><strong>Modification mode colonne</strong><br>Une fa&ccedil;on sp&eacute;ciale de modification des fichiers est la modification du mode colonne. Ce qui signifie que le texte peut &ecirc;tre &ecirc;tre s&eacute;lectionn&eacute; dans des colonnes plut&ocirc;t qu&apos;en lignes. Pour lancer une s&eacute;lection en mode colonne, rel&acirc;chez la touche Alt lors de la s&eacute;lection du texte, en d&eacute;pla&ccedil;ant le curseur de haut en bas autant de fois que n&eacute;cessaire. Quand un texte est s&eacute;lectionn&eacute; dans ce mode appel&eacute; colonne, la frappe changera chaque colonne de caract&egrave;res s&eacute;lectionn&eacute;e dans le caract&egrave;re typ&eacute;.</li>
</ul>


<h3>Recherche</h3>
<ul>
<li><strong>Recherche normale</strong><br> Vous pouvez rechercher du texte comme dans la plupart des programmes utilisant la bo&icirc;te de dialogue Trouver. Vous pouvez ouvrir cette bo&icirc;te de dialogue en s&eacute;lectionnant <b>Recherche</b> &gt; <b>Trouver</b>. Cette bo&icirc;te de dialogue restera toujours en haut du texte et vous ne pourrez pas garder sur modification le texte si elle est ouverte. Dans le champs de recherche, tapez le texte que vous voulez trouver.</li>

<li><strong>Remplacer</strong><br> Vous pouvez trouver et remplacer le texte comme dans la plupart des programmes utilisant la bo&icirc;te de dialogue Remplacer. Vuos pouvez ouvrir cette bo&icirc;te de dialogue en s&eacute;lectionnant <b>Recherche</b> &gt; <b>Remplacer</b>. <b>Remplacer tout</b> remplacera toutes les &eacute;v&egrave;nements de la demande avec le texte de remplacement. </li>

<li><strong>Sensible &agrave; la casse</strong><br> Il applique les frappes qui ont exactement la m&ecirc;me casse que la demande. Si la case n&apos;est pas coch&eacute;e, la recherche n&apos;est pas sensible &agrave; la casse.</li>

<li><strong>Mot entier uniquement</strong><br> Le r&eacute;sultat sera dans une frappe uniquement si la correspondance consiste en un mot entier, non une partie de ce mot. Par exemple, sir vous recherchez le mot « examen » <strong>Mot entier uniquement</strong> alors vous trouverez « examen » uniquement au lieu de « exemple ».</li>

<li><strong>Expression r&eacute;guli&egrave;re</strong><br> La demande sera trait&eacute;e comme une expression r&eacute;guli&egrave;re.</li>
</ul>


<div class="section">
<h4>Qu&apos;est-ce qu&apos;une expression r&eacute;guli&egrave;re?</h4>
<p>Une expression r&eacute;guli&egrave;re est une s&eacute;quence de caract&egrave;res qui forme un mod&egrave;le de recherche pour une technique compl&egrave;te de sauvegarde de temps. Une utilisation tr&egrave;s simple d&apos;une expression r&eacute;guli&egrave;re serait de situer le m&ecirc;me mot &eacute;pel&eacute; de deux fa&ccedil;ons diff&eacute;rentes dans un &eacute;diteur de texte, par exemple M[ea]rry.</p>
</div>

<h3>Configurateur de style</h3>
<p>Le configurateur de style est principalement utilis&eacute; pour contr&ocirc;ler l&apos;apparence du texte dans l&apos;&eacute;diteur de texte.<br> La liste d&eacute;roulant inf&eacute;rieure droite contient toutes les langues programmables prises en charge qui peuvent &ecirc;tre styl&eacute;es pour vous aider &agrave; former un environnement de codage adapt&eacute;.</p>

<h3>Pr&eacute;f&eacute;rences</h3>
<ul>
<li><strong>Afficher les caract&egrave;res invisibles</strong><br> Si coch&eacute;e, l&apos;espace, la tabulation ou les caract&egrave;res de retour seront affich&eacute;s.</li>

<li><strong>Afficher les guides d&apos;indention</strong><br> Si coch&eacute;e, les guides d&apos;indention seront affich&eacute;s. C&apos;est utile pour les codes d&apos;alignement dans le langage cod&eacute;.</li>

<li><strong>Surligner la ligne actuelle</strong><br>SI coch&eacute;e, la ligne sur laquelle le curseur clignotant est pr&eacute;sent sera mise en valeur avec une couleur de fond sp&eacute;ciale.</li>

<li><strong>Surligner le mot s&eacute;lectionn&eacute;</strong><br>Si coch&eacute;, tous les mots (non partiel) dans le m&ecirc;me fichier de texte correspondant au mot s&eacute;lectionn&eacute; seront automatiquement soulign&eacute;s.</li>

<li><strong>Afficher les num&eacute;ros de ligne</strong><br>Si coch&eacute;e, les num&eacute;ros de ligne seront affich&eacute;s.</li>

<li><strong>Activer le pliage de code</strong><br> Si coch&eacute;e, certaines lignes de vos codes seront cach&eacute;es sur la base de certains traits. Ce param&egrave;tre fonctionne bien pour les langues structur&eacute;es telles que C++ ou XML. Quand <b>Masquer les widgets automatiquement</b> est coch&eacute;e, certaines lignes seront automatiquement masqu&eacute;es. Vous pouvez &eacute;galement choisir de marquer uniquement le guillemet d&apos;ouverture ou les guillemets d&apos;ouverture et de fermeture avec les widgets.</li>  

<li><strong>Retour de mots</strong><br> Sp&eacute;cifiez si votre texte est revenu au bord de la fen&ecirc;tre ou dans un num&eacute;ro de colonne sp&eacute;cifique sans l&apos;insertion d&apos;un retour &agrave; la ligne.</li>

<li><strong>Ajouter les caract&egrave;res de fin automatiquement</strong><br>Si coch&eacute;e, les crochets de fermeture (caract&egrave;res) seront automatiquement ajout&eacute;s dans vos codes.</li>

<li><strong>Ins&eacute;rer des espaces au lieu d&apos;onglets</strong><br>Si coch&eacute;e, les caract&egrave;res d&apos;espace seront ins&eacute;r&eacute;s en appuyant sur la touche Tab au lieu d&apos;une tabulation. <b>Largeur d&apos;onglet</b> peut &ecirc;tre d&eacute;finie par le nombre de caract&egrave;res dans <b>Pr&eacute;f&eacute;rences</b> &gt; <b>Police et couleur</b>.</li>

<li><strong>Codage par d&eacute;faut</strong><br> Le codage par d&eacute;faut est utilis&eacute; pour sauvegarder les fichiers avec un codage de caract&egrave;re sp&eacute;cifique pour prendre en charge les langues bidirectionnelles. Vous pouvez &eacute;galement sp&eacute;cifier un codage lors de l&apos;ouverture d&apos;un fichier afin que l&apos;&eacute;diteur de texte affiche correctement le fichier.</li>

<li><strong>Police et couleur</strong><br> <b>Largeur d&apos;onglet</b>, <b>Taille de police</b> et <b>Personnalisation</b> peuvent &ecirc;tre personnalis&eacute;s selon votre pr&eacute;f&eacute;rence personnelle. La <b>Largeur d&apos;onglet</b> est d&eacute;finie par le nombre des caract&egrave;res d&apos;espace.</li>
</ul>

<div class="section">
<h4>Formats de fichier pris en charge</h4>
<p>L&apos;&eacute;diteur de texte prend en charge les fichiers en texte simple. Les fichiers en texte avec un format de texte enrichie comme *.doc et *.pdf ne seront pas pris en charge.</p>
</div>

</body>
</html>
