<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Vis&atilde;o Geral do Consultor de Seguran&ccedil;a</title>

<link href="../../help.css" rel="stylesheet" type="text/css">
<link href="../../scrollbar/flexcroll.css" rel="stylesheet" type="text/css">
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>

<h2>Vis&atilde;o geral</h2>

	<p>Voc&ecirc; pode verificar o status atual do DSM, checar o sistema e o andamento da verifica&ccedil;&atilde;o e o resumo do resultado. O Consultor de seguran&ccedil;a verifica o DSM e seu DiskStation verificando v&aacute;rias regras de seguran&ccedil;a. O n&uacute;mero e os tipos das regras dependem de como voc&ecirc; configura sua <strong>Linha de base de seguran&ccedil;a</strong>. Sua <strong>Linha de base de seguran&ccedil;a</strong> &eacute; determinada por suas necessidades. Voc&ecirc; est&aacute; usando o DiskStation para trabalho e neg&oacute;cios ou em casa e para uso pessoal? O sistema pedir&aacute; que voc&ecirc; escolha uma <strong>Linha de base de seguran&ccedil;a</strong> na primeira vez que ele iniciar uma verifica&ccedil;&atilde;o. Isso pode ser alterado posteriormente na p&aacute;gina <strong>Avan&ccedil;ado</strong>.</p>
<h3>Status do sistema</h3>
	  <p>O Consultor de seguran&ccedil;a tem um total de sete status. Assim que uma verifica&ccedil;&atilde;o for conclu&iacute;da, voc&ecirc; ver&aacute; um resumo dos resultados em cinco categorias. Os diferentes status incluem:</p>
	  <ul>
	    <li><strong>Pronto para verificar</strong>: Esse status &eacute; exibido quando voc&ecirc; ainda n&atilde;o realizou uma verifica&ccedil;&atilde;o em seu DiskStation. Clique em		 <strong>Verificar</strong> para iniciar a verifica&ccedil;&atilde;o.</li>
	    <li><strong>Verificando</strong>: Uma verifica&ccedil;&atilde;o est&aacute; em andamento. Voc&ecirc; pode visualizar o andamento da verifica&ccedil;&atilde;o. Clique em		 <strong>Parar</strong> para parar a verifica&ccedil;&atilde;o.</li>
	    <li><strong>Bom</strong>: A verifica&ccedil;&atilde;o atual est&aacute; conclu&iacute;da. O Consultor de Seguran&ccedil;a n&atilde;o encontrou configura&ccedil;&otilde;es fracas ou riscos de seguran&ccedil;a. Seu DiskStation est&aacute; seguro atualmente.</li>
	    <li><strong>Aviso</strong>: A verifica&ccedil;&atilde;o atual est&aacute; conclu&iacute;da. Por causa de algumas configura&ccedil;&otilde;es de seguran&ccedil;a vulner&aacute;veis, o Consultor de Seguran&ccedil;a informou sobre alguns riscos de seguran&ccedil;a baixos/moderados. Aconselhamos voc&ecirc; a tomar as a&ccedil;&otilde;es recomendadas para tornar seu DiskStation mais seguro. </li>
	    <li><strong>Em Risco</strong>: A verifica&ccedil;&atilde;o atual est&aacute; conclu&iacute;da. Por causa de algumas configura&ccedil;&otilde;es de seguran&ccedil;a vulner&aacute;veis, o Consultor de Seguran&ccedil;a informou sobre alguns riscos de seguran&ccedil;a elevados. Aconselhamos enfaticamente que voc&ecirc; tome as precau&ccedil;&otilde;es recomendadas para tornar seu DiskStation mais seguro. </li>
	    <li><strong>Perigo</strong>: A verifica&ccedil;&atilde;o atual est&aacute; conclu&iacute;da. O Consultor de Seguran&ccedil;a encontrou um malware em seu DiskStation. Voc&ecirc; deve tomar as medidas recomendadas para evitar quaisquer outras consequ&ecirc;ncias indesej&aacute;veis em seu DiskStation. </li>
	    <li><strong>Desatualizado</strong>: Sua vers&atilde;o do DSM est&aacute; desatualizada. Recomendamos que voc&ecirc; atualize o DSM para receber os recursos, aprimoramentos e corre&ccedil;&otilde;es de seguran&ccedil;a mais recentes para aprimorar sua experi&ecirc;ncia e manter seu DiskStation seguro.</li></ul>
<p>O Consultor de Seguran&ccedil;a agrupa as verifica&ccedil;&otilde;es em cinco categorias:</p>
        <ul>
	    <li><strong>Malware</strong>: Detecte se existe malware em seu DiskStation e se ele est&aacute; sendo atacado.</li>
	    <li><strong>Conta</strong>: Detecta configura&ccedil;&otilde;es de seguran&ccedil;a de conta e senha.</li>
	    <li><strong>Rede</strong>: Detecte configura&ccedil;&otilde;es de seguran&ccedil;a relacionados com a rede. </li>
	    <li><strong>Configura&ccedil;&otilde;es</strong>: Detecte outras configura&ccedil;&otilde;es de seguran&ccedil;a relacionadas &agrave; rede.</li>
	    <li><strong>Atualiza&ccedil;&atilde;o</strong>: Detecta se o DSM e outros pacotes instalados est&atilde;o atualizados, bem como verifique as configura&ccedil;&otilde;es relacionadas &agrave; atualiza&ccedil;&atilde;o.</li>
</ul>
<p>Assim que a verifica&ccedil;&atilde;o for conclu&iacute;da, voc&ecirc; poder&aacute; visualizar os resultados detalhados de relat&oacute;rio em relat&oacute;rio, clicando em <strong>Exibir resultados</strong>.</p></body>
</html>
