<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Logcenter</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Logfils&oslash;gning</h2>
<p>P&aring; siden <strong>Logcenter</strong> &gt; <strong>Logfils&oslash;gning</strong> kan du se, s&oslash;ge efter og eksportere logfiler. </p>

<h4>S&aring;dan s&oslash;ger du efter logfiler:</h4>

<ol>
<li>V&aelig;lg at vise lokale systemlogfiler eller logfiler fra andre enheder ved at v&aelig;lge fanen <strong>Lokal</strong> eller <strong>Fra andre servere</strong>.
<li>Efter behov kan du v&aelig;lge at vise <strong>Seneste logfiler</strong> eller &aring;bne et eksisterende logarkiv ved at v&aelig;lge <strong>&Aring;bn logfilsarkiv</strong>.
<li>I s&oslash;gningens rullemenu kan du angive f&oslash;lgende kriterier, afh&aelig;ngigt af situationen:
  <ul>
  <li><b>S&oslash;geord</b>: Indtast s&oslash;geord for at s&oslash;ge efter logmeddelelser, der indeholder det matchende s&oslash;geord.
  	<div class="section">
	<h4>Bem&aelig;rk:</h4>
	<p>Du kan bruge almindelige udtryksm&oslash;nstre som [<strong>*</strong>] (hvilket betyder et hvilket som helst antal vilk&aring;rlige tegn) eller [<strong>?</strong>] (hvilket betyder 1 vilk&aring;rligt tegn) i s&oslash;geordsfeltet, n&aring;r du s&oslash;ger. F.eks. [h<span class="note_head"> *</span> n] kan st&aring; for [h<span class="note_head"> a</span> n] eller [h<span class="note_head"> u</span> n]</p>
	</div>
  </li>
  <li><strong>Datointerval: </strong>S&oslash;g efter logfiler efter den angivne datointerval.
  <li><b>Niveau</b>: S&oslash;g efter logfiler efter det angivne niveau.</li>
  <li><b>V&aelig;rtsnavn</b>: S&oslash;g efter logfiler efter det angivne v&aelig;rtsnavn.</li>
  <li><b>Program</b>: S&oslash;g efter logfiler efter det angivne programnavn.</li>
  <li><b>Kategori</b>: S&oslash;g efter logfiler efter den angivne programkategori.</li>
  </ul>
<li>Klik p&aring; <strong>S&oslash;g</strong> for at s&oslash;ge efter logfiler, der matcher de angivne kriterier.</li>
</ol>

<h4>S&aring;dan eksporterer du logfiler:</h4>

<ol>
<li>Klik p&aring; pilen ved siden af knappen <strong>Eksporter</strong>.</li>
<li>V&aelig;lg <strong>HTML</strong> eller <strong>CSV</strong> for at downloade logfilerne med det &oslash;nskede format.</li>
</ol>

<div class="section">
<h4>Bem&aelig;rk:</h4>
<ul>
<li>Tegnkodningen for eksporterede CSV-logfiler er UTF-8. Du skal &aring;bne filen med et program, der underst&oslash;tter UTF-8-tegnkodning. </li>
</ul>
</div>

</body></html>
