<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Felhaszn&aacute;l&oacute;</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="UTF-8">
</head>
<body>
<h2>Felhaszn&aacute;l&oacute; szerkeszt&eacute;se</h2>
<p>Keresse meg a felhaszn&aacute;l&oacute;i fi&oacute;kot (a Keres&eacute;s mezőben megadva a felhaszn&aacute;l&oacute;nevet), kattintson r&aacute; dupl&aacute;n, vagy kattintson a <b>Szerkeszt&eacute;s</b> gombra, &eacute;s akkor szerkesztheti a fi&oacute;kj&aacute;nak adatait.</p>
<ol><span class="note_head">Megjegyz&eacute;s:</span><li>Ha letilt egy fi&oacute;kot, akkor a fi&oacute;k megszűnik műk&ouml;dni.</li>

<li class="disable-eds14">A <b>Kv&oacute;ta</b> mező &eacute;rt&eacute;k&eacute;nek 0 vagy enn&eacute;l nagyobb eg&eacute;sz sz&aacute;mnak kell lennie, &eacute;s kevesebbnek, mint a lemez/k&ouml;tet kapacit&aacute;sa. A 0 kv&oacute;ta&eacute;rt&eacute;k azt jelenti, hogy a <b>T&eacute;nyleges kv&oacute;ta</b> a <strong>Csoport hat&aacute;r&eacute;rt&eacute;k</strong> alapj&aacute;n ker&uuml;l meghat&aacute;roz&aacute;sra.</li>

<li class="disable-eds14">Ha egyn&eacute;l t&ouml;bb k&ouml;tet<span style="display: inline;" class="enable-rc18015xsp enable-rs18016xsp enable-rs2416p enable-rs2416rpp enable-ds1616p">/megosztott mappa</span> van a szerveren, akkor minden k&ouml;teten<span style="display: inline;" class="enable-rc18015xsp enable-rs18016xsp enable-rs2416p enable-rs2416rpp enable-ds1616p">/megosztott mapp&aacute;n</span> be&aacute;ll&iacute;that egy kv&oacute;t&aacute;t a felhaszn&aacute;l&oacute; sz&aacute;m&aacute;ra.</li>
<li>Az e-mail inform&aacute;ci&oacute;nak helyesen kell be&aacute;ll&iacute;tva lennie az &bdquo;&Eacute;rtes&iacute;t&eacute;s&rdquo; oldalon annak &eacute;rdek&eacute;ben, hogy a rendszer e-mailben &eacute;rtes&iacute;thesse a felhaszn&aacute;l&oacute;t a fi&oacute;kinform&aacute;ci&oacute;k l&eacute;trehoz&aacute;sa vagy m&oacute;dos&iacute;t&aacute;sa ut&aacute;n.</li>
<li>Ha egy felhaszn&aacute;l&oacute;nak &aacute;ll&iacute;t fel sebess&eacute;ghat&aacute;rt, az <strong>Eredm&eacute;ny</strong> ponton sz&aacute;mokat l&aacute;t, hogy az illető felhaszn&aacute;l&oacute;ra vonatkozik-e m&aacute;r csoportos sebess&eacute;ghat&aacute;r.<li>A felhaszn&aacute;l&oacute;hoz rendelt sebess&eacute;ghat&aacute;r nem ker&uuml;l besz&aacute;m&iacute;t&aacute;sra annak a csoportnak a sebess&eacute;ghat&aacute;r&aacute;ba, amelyikhez a felhaszn&aacute;l&oacute; tartozik.</ol>

</body>
</html>
