<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Csoport</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="UTF-8">
</head>
<body>
<h2>Csoport szerkeszt&eacute;se</h2>
<p>Egy csoport inform&aacute;ci&oacute;j&aacute;t &eacute;s a megosztott mapp&aacute;khoz val&oacute; hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gait szerkesztheti</p>
<h4>A csoportinform&aacute;ci&oacute;k szerkeszt&eacute;s&eacute;re:</h4>
<ol>
<li>Jel&ouml;lje ki a szerkeszteni k&iacute;v&aacute;nt csoportot.</li>
<li>Kattintson a <b>Szerkeszt&eacute;s</b> gombra, &eacute;s szerkessze a csoportinform&aacute;ci&oacute;t.</li>
<li>A befejez&eacute;shez kattintson az <b>OK</b> gombra</li>
</ol>
<h4>Egy csoport megosztott mapp&aacute;khoz t&ouml;rt&eacute;nő hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gainak szerkeszt&eacute;se:</h4>
<ol>
<li>Jel&ouml;lje ki a szerkeszteni k&iacute;v&aacute;nt csoportot.</li>
<li>Kattintson a <b>Szerkeszt&eacute;s</b>, majd az <b>Enged&eacute;lyek</b> gombra.</li>
<li>Jel&ouml;lje be vagy t&ouml;r&ouml;lje a k&ouml;vetkező jogosults&aacute;gok bejel&ouml;lts&eacute;g&eacute;t, ha hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gokat szeretne rendelni a csoporthoz:</li>
<ol>
<li><b>&Iacute;r&aacute;s/olvas&aacute;s</b>: A csoport hozz&aacute;f&eacute;rhet a megosztott mapp&aacute;hoz &eacute;s megv&aacute;ltoztathatja azt.</li>
<li><b>Csak olvashat&oacute;</b>: A csoport hozz&aacute;f&eacute;rhet a megosztott mapp&aacute;hoz, de nem v&aacute;ltoztathatja meg azt.</li>
<li><b>Nincs hozz&aacute;f&eacute;r&eacute;s</b>: A csoport nem f&eacute;rhet hozz&aacute; a megosztott mapp&aacute;hoz.</li>
</ol>
<li>A befejez&eacute;shez kattintson az <b>OK</b> gombra</li>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<p>Ha jogosults&aacute;g&uuml;tk&ouml;z&eacute;s fordul elő, akkor a jogosults&aacute;gi priorit&aacute;s a k&ouml;vetkező: Nincs hozz&aacute;f&eacute;r&eacute;s &gt; &Iacute;r&aacute;s/olvas&aacute;s &gt; Csak olvashat&oacute;.</p>
</div>


<h4>Csoport felhaszn&aacute;l&aacute;si kv&oacute;t&aacute;j&aacute;nak m&oacute;dos&iacute;t&aacute;sa:</h4>
<ol>
<li>Jel&ouml;lje ki a szerkeszteni k&iacute;v&aacute;nt csoportot.</li>
<li>Kattintson a <strong>Szerkeszt&eacute;s</strong> gombra, majd l&eacute;pjen a <strong>Kv&oacute;ta</strong> lapra.</li>
<li>Minden egyes k&ouml;tet<span style="display: inline;" class="enable-rc18015xsp enable-rs18016xsp enable-rs2416p enable-rs2416rpp enable-ds1616p">/megosztott mappa</span> eset&eacute;ben ellenőrizze a <strong>Kv&oacute;ta enged&eacute;lyez&eacute;se</strong> jel&ouml;lőn&eacute;gyzetet. Majd adjon meg egy felhaszn&aacute;l&aacute;si kv&oacute;t&aacute;t a <strong>Kv&oacute;ta</strong> mezőben (pl. 10 GB).</li>
</ol>
<div class="section disable-eds14">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Az &ouml;sszes csoporttag a csoport sz&aacute;m&aacute;ra meghat&aacute;rozott felhaszn&aacute;l&aacute;si kv&oacute;t&aacute;t &ouml;r&ouml;kli. A csoport felhaszn&aacute;l&aacute;si kv&oacute;t&aacute;ja nem ker&uuml;l megoszt&aacute;sra az egyes csoporttagok k&ouml;z&ouml;tt.</li>
<li>Az egyes csoportok sz&aacute;m&aacute;ra megadhat&oacute; maxim&aacute;lis t&aacute;rol&oacute;felhaszn&aacute;l&aacute;si kv&oacute;ta k&ouml;r&uuml;lbel&uuml;l 4 TB (4095 GB).</li>
</ul>
</div>


<h4>Egy csoport alkalmaz&aacute;sokhoz t&ouml;rt&eacute;nő hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gainak szerkeszt&eacute;se:</h4>
<ol>
<li>Jel&ouml;lje ki a szerkeszteni k&iacute;v&aacute;nt csoportot.</li>
<li>Kattintson a <b>Szerkeszt&eacute;s</b> gombra, majd ugorjon az <strong>Alkalmaz&aacute;sok</strong> lapra.</li>
<li>Minden egyes szolg&aacute;ltat&aacute;shoz kiv&aacute;laszthatja a k&ouml;vetkező lehetős&eacute;gek egyik&eacute;t:<ul>
<li><strong>Enged&eacute;lyez:</strong> Hozz&aacute;f&eacute;rhet a csoport az alkalmaz&aacute;shoz.</li>
<li><strong>Tilt:</strong> Nem f&eacute;rhet a csoport az alkalmaz&aacute;shoz.</li>
<li><strong>Egyedi:</strong> A rendszer a hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;gokat IP-c&iacute;m szerint hat&aacute;rozza meg.</li>
</ul>
</li>
<li>A befejez&eacute;shez kattintson az <b>OK</b> gombra</li>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Ha jogosults&aacute;g&uuml;tk&ouml;z&eacute;s fordul elő, akkor a jogosults&aacute;gi priorit&aacute;s a k&ouml;vetkező: Tilt &gt; Enged&eacute;lyez.</li>
<li>Nem az &ouml;sszes csomag &eacute;s szolg&aacute;ltat&aacute;s t&aacute;mogatja az <strong>IP-c&iacute;m szerint</strong> hozz&aacute;f&eacute;r&eacute;si jogosults&aacute;g be&aacute;ll&iacute;t&aacute;sok haszn&aacute;lat&aacute;t.</li>
</ul>
</div>

<h4>A csoport sebess&eacute;ghat&aacute;r&aacute;nak szerkeszt&eacute;se:</h4>
<p>Csoport sebess&eacute;ghat&aacute;rt enged&eacute;lyezhet k&uuml;l&ouml;nb&ouml;ző szolg&aacute;ltat&aacute;sokhoz (pl. File Station, FTP, stb.) az egyes szolg&aacute;ltat&aacute;sok seg&iacute;ts&eacute;g&eacute;vel f&aacute;jlokat tov&aacute;bb&iacute;t&oacute; csoporttagok &aacute;ltal felhaszn&aacute;lt s&aacute;vsz&eacute;less&eacute;g-mennyis&eacute;g korl&aacute;toz&aacute;sa &eacute;rdek&eacute;ben. A csoport sebess&eacute;ghat&aacute;rokon valamennyi csoporttag osztozik.</p>
<ol>
<li>Jel&ouml;lje ki a szerkeszteni k&iacute;v&aacute;nt csoportot.</li>
<li>Kattintson a <b>Szerkeszt&eacute;s</b> gombra, majd ugorjon a <strong>Sebess&eacute;ghat&aacute;r</strong> lapra.</li>
<li>Minden egyes szolg&aacute;ltat&aacute;shoz kiv&aacute;laszthatja a k&ouml;vetkező lehetős&eacute;gek egyik&eacute;t:<ul>
<li><strong>Nincs:</strong> Nem ker&uuml;l sebess&eacute;ghat&aacute;r alkalmaz&aacute;sra, amikor a csoport tagjai a szolg&aacute;ltat&aacute;st haszn&aacute;lj&aacute;k.</li>
<li><strong>&Aacute;lland&oacute;:</strong> Fix, &aacute;lland&oacute; sebess&eacute;ghat&aacute;r ker&uuml;l alkalmaz&aacute;sra a csoporttagok eset&eacute;ben. A baloldali mezőkben hat&aacute;rozza meg a fel- &eacute;s let&ouml;lt&eacute;si sebess&eacute;ghat&aacute;rokat.</li>
<li><strong>V&aacute;ltoz&oacute;:</strong> Egy &uuml;temterv szerint k&eacute;t k&uuml;l&ouml;nb&ouml;ző sebess&eacute;ghat&aacute;r hat&aacute;rozhat&oacute; meg &eacute;s alkalmazhat&oacute; a csoporttagok eset&eacute;n. A sebess&eacute;ghat&aacute;r-be&aacute;ll&iacute;t&aacute;sok &eacute;s az &uuml;temterv m&oacute;dos&iacute;t&aacute;s&aacute;hoz kattintson a <strong>Testreszab&aacute;s</strong> gombra.</li>
</ul>
</li>
<li>A befejez&eacute;shez kattintson az <b>OK</b> gombra</li>
</ol>

<div class="section">
<h4>Sebess&eacute;ghat&aacute;r t&ouml;bb csoporthoz tartoz&oacute; felhaszn&aacute;l&oacute;k sz&aacute;m&aacute;ra</h4>

<p>Ha egy felhaszn&aacute;l&oacute; t&ouml;bb csoporthoz tartozik, akkor sebess&eacute;ghat&aacute;ra a f&aacute;jlok &aacute;tvitele idej&eacute;n a legnagyobb el&eacute;rhető s&aacute;vsz&eacute;less&eacute;ggel rendelkező csoportnak az alapj&aacute;n ker&uuml;l meghat&aacute;roz&aacute;sra. Mivel a s&aacute;vsz&eacute;less&eacute;g egyenlő ar&aacute;nyban van elosztva az &eacute;ppen f&aacute;jlokat tov&aacute;bb&iacute;t&oacute; felhaszn&aacute;l&oacute;k k&ouml;z&ouml;tt, az el&eacute;rhető s&aacute;vsz&eacute;less&eacute;g annak alapj&aacute;n v&aacute;ltozik, hogy pillanatnyilag &eacute;ppen h&aacute;ny felhaszn&aacute;l&oacute; fogyasztja a csoport megosztott s&aacute;vsz&eacute;less&eacute;g&eacute;t.</p>

<p>P&eacute;ld&aacute;ul egy &bdquo;John&rdquo; nevű felhaszn&aacute;l&oacute; az &bdquo;1. csoporthoz&rdquo; (sebess&eacute;ghat&aacute;r 500KB/s; &ouml;sszesen &ouml;t felhaszn&aacute;l&oacute;) &eacute;s a &bdquo;2. csoporthoz&rdquo; (sebess&eacute;ghat&aacute;r 400KB/s; &ouml;sszesen k&eacute;t felhaszn&aacute;l&oacute;) tartozik.</p>
<ul>
<li>Ha az 1. csoport &eacute;s a 2. csoport felhaszn&aacute;l&oacute;i mind ugyanabban az időben tov&aacute;bb&iacute;tanak f&aacute;jlokat, akkor John sebess&eacute;ghat&aacute;ra 200KB/s lesz, &eacute;s fogyaszt&aacute;s&aacute;t a 2. csoport megosztott s&aacute;vsz&eacute;less&eacute;g-kv&oacute;t&aacute;j&aacute;hoz m&eacute;rik.</li>
<li>Amikor az 1. csoport t&ouml;bbi felhaszn&aacute;l&oacute;ja befejezte a f&aacute;jlok tov&aacute;bb&iacute;t&aacute;s&aacute;t, akkor John sebess&eacute;ghat&aacute;ra azonnal 500KB/s-ra v&aacute;ltozik, a fogyaszt&aacute;s&aacute;t pedig az 1. csoport megosztott s&aacute;vsz&eacute;less&eacute;g-kv&oacute;t&aacute;j&aacute;hoz m&eacute;rik.</li>
</ul>
</div>


</body>
</html>
