<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Op&ccedil;&otilde;es</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_user"></a>Outras</h2>
<p>Pode personalizar outras op&ccedil;&otilde;es pessoais da conta em <strong>Op&ccedil;&otilde;es</strong> &gt; <strong>Outras</strong>.</p>

<h4>Para personalizar outras op&ccedil;&otilde;es pessoais:</h4>
<ol>
<li>Escolha uma das seguintes:
<ul>
<li><b>N&atilde;o exibir caixa de di&aacute;logo de confirma&ccedil;&atilde;o ao sair do DSM:</b> Avan&ccedil;a a caixa de di&aacute;logo de confirma&ccedil;&atilde;o quando fechar a janela do navegador.</li>
<li><b>Retomar o DSM para o meu estado de encerramento de sess&atilde;o anterior quando iniciar sess&atilde;o:</b> Memoriza as aplica&ccedil;&otilde;es e pacotes abertos e restaura-os da pr&oacute;xima vez que iniciar sess&atilde;o ou actualizar a janela do navegador.</li>
<li><b>Activar pr&eacute;-visualiza&ccedil;&atilde;o imediata na barra de tarefas:</b> Apresenta uma pr&eacute;-visualiza&ccedil;&atilde;o r&aacute;pida de uma aplica&ccedil;&atilde;o aberta quando passa o rato sobre o &iacute;cone da aplica&ccedil;&atilde;o na barra de tarefas.

</li>
<li><strong>Activar notifica&ccedil;&otilde;es de ambiente de trabalho do navegador:</strong> Mostra notifica&ccedil;&otilde;es do navegador Web no ambiente de trabalho do DSM.
  
  As notifica&ccedil;&otilde;es de ambiente de trabalho do navegador s&atilde;o suportadas apenas pelo Google Chrome e Safari. Dependendo da vers&atilde;o do seu navegador Web, a p&aacute;gina de defini&ccedil;&otilde;es de notifica&ccedil;&otilde;es poder&aacute; ser diferente. V&aacute; para a p&aacute;gina de defini&ccedil;&otilde;es do seu navegador para gerir as defini&ccedil;&otilde;es de notifica&ccedil;&atilde;o.</li>
</ul>
<li>
Clique em <b>OK</b>.
</li>
</ol>

<div class="section">
<h4>Nota:</h4>
<ul>
<li>A pr&eacute;-visualiza&ccedil;&atilde;o imediata n&atilde;o &eacute; suportada no Internet Explorer.</li>
</ul>
</div>

</body>
</html>