<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Alternativ</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_user"></a>&Ouml;vriga</h2>
<p>Du kan anpassa andra personliga alternativ f&ouml;r kontot i <strong>Alternativ</strong> &gt; <strong>&Ouml;vriga</strong>.</p>

<h4>S&aring; h&auml;r anpassar du andra personliga alternativ:</h4>
<ol>
<li>V&auml;lj n&aring;got av f&ouml;ljande:
<ul>
<li><b>Visa inte bekr&auml;ftelsedialogruta n&auml;r DSM avslutas:</b> Hoppar &ouml;ver dialogrutan f&ouml;r bekr&auml;ftelse n&auml;r webbl&auml;sarf&ouml;nstret st&auml;ngs.</li>
<li><b>&Aring;terst&auml;ll DSM till min tidigare utloggningsstatus vid inloggning:</b> Kommer ih&aring;g &ouml;ppna applikationer och filpaket och &aring;terst&auml;ller dem n&auml;sta g&aring;ng du loggar in eller uppdaterar webbl&auml;sarf&ouml;nstret.</li>
<li><b>Aktivera direkt f&ouml;rhandsgranskning i verktygsf&auml;ltet:</b> Visar en snabb f&ouml;rhandsgranskning av en &ouml;ppen applikation n&auml;r du f&ouml;r musens mark&ouml;r &ouml;ver dess applikationsikon p&aring; verktygsraden.

</li>
<li><strong>Aktivera skrivbordsmeddelanden f&ouml;r webbl&auml;sare:</strong> Visar meddelanden fr&aring;n din webbl&auml;sare p&aring; ditt skrivbord i DSM.
  
  Skrivbordsmeddelanden f&ouml;r webbl&auml;sare st&ouml;ds endast av Google Chrome och Safari. Beroende p&aring; vilken version av webbl&auml;sare du har kan meddelandeinst&auml;llningarna variera. G&aring; till din webbl&auml;sares inst&auml;llningssida f&ouml;r att hantera meddelandeinst&auml;llningar.</li>
</ul>
<li>
Klicka p&aring; <b>OK</b>.
</li>
</ol>

<div class="section">
<h4>Obs!</h4>
<ul>
<li>Omedelbar f&ouml;rhandsgranskning st&ouml;ds inte i Internet Explorer.</li>
</ul>
</div>

</body>
</html>