<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
</head>
<body>
<br>
<p>
O DSM m&oacute;vel permite que o <b>admin</b> do DSM (ou um utilizador pertencente ao grupo <b>administrators</b>) fa&ccedil;a a est&atilde;o das defini&ccedil;&otilde;es do DSM e verifique a informa&ccedil;&atilde;o do DSM num dispositivo com iOS<sup>&reg;</sup> (iPhone<sup>&reg;</sup>, iPad<sup>&reg;</sup>, ou iPod touch<sup>&reg;</sup>) ou Android<sup>&reg;</sup>. Esta Ajuda do DSM m&oacute;vel disponibiliza-lhe os seguintes t&oacute;picos e recursos para o ajudar a iniciar.
</p>
<h2><a name="login" href="javascript:SYNO.Utils.ToggleContent('login');" >Iniciar e Terminar sess&atilde;o</a></h2>
<div name="contents" id="login" class="x-hidden-display">
<p>
Ap&oacute;s se ligar ao DSM com o navegador de Internet no seu dispositivo iOS ou Android, ir&aacute; visualizar o ecr&atilde; de in&iacute;cio de sess&atilde;o onde pode introduzir as suas informa&ccedil;&otilde;es de conta do DSM.
</p>
<h4>Para iniciar sess&atilde;o no DSM mobile:</h4>

<p>Introduza as suas credenciais do utilizador do DSM e clique em <b>Iniciar sess&atilde;o</b>. Se pretender guardar as suas informa&ccedil;&otilde;es de in&iacute;cio de sess&atilde;o e iniciar sess&atilde;o automaticamente da pr&oacute;xima vez, active a op&ccedil;&atilde;o <b>Recordar-me</b> antes de iniciar sess&atilde;o.</p>

<h4>Para terminar a sess&atilde;o no DSM m&oacute;vel:</h4>
<p>
Ap&oacute;s iniciar sess&atilde;o no DSM m&oacute;vel, ir&aacute; visualizar a p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) no painel esquerdo (iPad ou tablet Android) contendo uma lista de op&ccedil;&otilde;es e aplica&ccedil;&otilde;es m&oacute;veis da Synology instaladas no seu dispositivo iOS ou Android. Clique em <b>Terminar sess&atilde;o</b> para terminar sess&atilde;o e voltar ao ecr&atilde; de in&iacute;cio de sess&atilde;o.
</p>
</div>

<h2><a name="user" href="javascript:SYNO.Utils.ToggleContent('user');" >Gerir Utilizadores do DSM</a></h2>
<div name="contents" id="user" class="x-hidden-display">
<p>
Clique em <b>Utilizador</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para visualizar a lista de utilizadores.
</p>
<h4>Para criar um utilizador:</h4>

<ol>
<li>
Clique em <b>+</b> e de seguida introduza o nome de utilizador, palavra-passe e endere&ccedil;o de e-mail do novo utilizador.
</li>
<li>
Active <b>Enviar Notifica&ccedil;&atilde;o</b> para enviar um e-mail de notifica&ccedil;&atilde;o para o endere&ccedil;o de e-mail do utilizador quando a sua conta de utilizador no DSM for criada. <br><span class="note_head">Nota: </span>Antes de enviar a notifica&ccedil;&atilde;o, certifique-se de que as defini&ccedil;&otilde;es de notifica&ccedil;&atilde;o foram introduzidas na sua DiskStation. Inicie sess&atilde;o na edi&ccedil;&atilde;o do ambiente de trabalho do DSM com o navegador de Internet do seu computador e aceda a <b>Menu Principal</b> &gt; <b>Painel de Controlo</b> &gt; <b>Notifica&ccedil;&atilde;o</b> &gt; <b>E-mail</b> para modificar as defini&ccedil;&otilde;es.
</li>

<li>
Toque em <b>Conclu&iacute;do</b> para confirmar ou toque em <b>Cancelar</b> para cancelar.
</li>
</ol>
<h4>Para encontrar um utilizador rapidamente:</h4>
<p>Introduza o nome do utilizador no campo de procura.</p>
<h4>Para modificar a informa&ccedil;&atilde;o de um utilizador:</h4>
<ol>
<li>
Toque no nome do utilizador e proceda de uma das seguintes formas:
<ul>
<li>
Modifique o nome do utilizador ou a palavra-passe no campo <b>Nome</b> ou <b>Palavra-passe</b>.
</li>
<li>
Ligue <b>Desactivar</b> para desactivar o utilizador. Pode escolher activar o utilizador mais tarde sem perder as suas defini&ccedil;&otilde;es.
</li>
<li>
Ligue <b>Administrador</b> para adicionar o utilizador ao grupo <b>admin</b>. A qualquer utilizador que perten&ccedil;a ao grupo <b>admin</b> ser&atilde;o atribu&iacute;dos os privil&eacute;gios de administrador para modificar as defini&ccedil;&otilde;es do DSM com o DSM m&oacute;vel ou atrav&eacute;s do navegador de internet do computador.
</li>
</ul>
<li>
Em <b>Privil&eacute;gios</b>, proceda de uma das seguintes formas e de seguida toque em <b>Retroceder</b>:
<ul>
<li>
Clique em <b>Pasta Partilhada</b> e clique no nome de uma pasta partilhada para modificar o privil&eacute;gio de acesso do utilizador: <b>Ler/Escrever</b>: O utilizador pode efectuar altera&ccedil;&otilde;es aos ficheiros e sub-pastas na pasta partilhada; <b>S&oacute; de leitura</b>. O utilizador pode aceder aos ficheiros e sub-pastas na pasta partilhada, mas n&atilde;o pode efectuar altera&ccedil;&otilde;es; <b>Sem acesso</b>: O utilizador n&atilde;o pode aceder aos ficheiros e sub-pastas na pasta partilhada. <br> <span class="note_head">Nota: </span>Se ocorrem conflitos de privil&eacute;gios, a prioridade de privil&eacute;gios ser&aacute;: <span class="note_content">Sem acesso &gt; Ler/Escrever &gt; S&oacute; de leitura</span>.
</li>
<li>
Clique em <b>Aplica&ccedil;&atilde;o</b> para modificar o privil&eacute;gio de acesso do utilizador &agrave;s aplica&ccedil;&otilde;es do DSM.
</li>
</ul>
</li>
<li>
Toque em <b>Conclu&iacute;do</b> para confirmar ou toque em <b>Cancelar</b> para cancelar.
</li>
</ol>
</div>


<h2><a name="shared" href="javascript:SYNO.Utils.ToggleContent('shared');" >Gerir Pastas Partilhadas</a></h2>
<div name="contents" id="shared" class="x-hidden-display">
<p>
Clique em <b>Pasta partilhada</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para visualizar a lista de pastas partilhadas na sua DiskStation.
</p>
<h4>Para criar uma pasta partilhada:</h4>
<ol>
<li>
Clique em <b>+</b> e de seguida introduza o nome da nova pasta.
</li>
<li>
Toque em <b>Conclu&iacute;do</b> para confirmar ou toque em <b>Cancelar</b> para cancelar.
</li>
</ol>
<h4>Para modificar uma pasta partilhada:</h4>
<p>
Toque no nome da pasta partilhada e proceda de uma das seguintes formas:
</p>
<ul>
<li>
Modifique o nome da pasta partilhada no campo <b>Nome</b>.
</li>
<li>
Em <b>Privil&eacute;gios</b>, clique em <b>Utilizador</b> e clique num utilizador para modificar o privil&eacute;gio de acesso &agrave; pasta partilhada: <b>Ler/Escrever</b>: O utilizador pode efectuar altera&ccedil;&otilde;es aos ficheiros e sub-pastas na pasta partilhada; <b>S&oacute; de leitura</b>. O utilizador pode aceder aos ficheiros e sub-pastas na pasta partilhada, mas n&atilde;o pode efectuar altera&ccedil;&otilde;es; <b>Sem acesso</b>: O utilizador n&atilde;o pode aceder aos ficheiros e sub-pastas na pasta partilhada. <br> <span class="note_head">Nota: </span>Se ocorrem conflitos de privil&eacute;gios, a prioridade de privil&eacute;gios ser&aacute;: <span class="note_content">Sem acesso &gt; Ler/Escrever &gt; S&oacute; de leitura</span>.
</li>
</ul>
</div>


<h2><a name="services" href="javascript:SYNO.Utils.ToggleContent('services');" >Activar Servi&ccedil;os</a></h2>
<div name="contents" id="services" class="x-hidden-display">
<p>
Clique em <b>Servi&ccedil;o</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para activar ou desactivar servi&ccedil;os da DiskStation.
</p>
<h4>Para gerir os servi&ccedil;os na LAN da DiskStation:</h4>
<ol>
<li>
Active ou desactive um dos seguintes:
<ul>
<li>
<b>Servi&ccedil;o de Ficheiros Windows</b> permite que a sua DiskStation se torne num servidor de ficheiros Windows (CIFS) na LAN.
</li>
<li>
<b>Servi&ccedil;o de Ficheiros Mac</b> permite que a sua DiskStation se torne num servidor de ficheiros Mac (AFP) na LAN.
</li>
<li>
<b>Servi&ccedil;o NFS</b> permite que um cliente Linux na LAN aceda aos dados da DiskStation.
</li>
<li>
<b>Impressora Bonjour</b> permite que os clientes Mac imprimam para a(s) impressora(s) ligada(s) &agrave; sua DiskStation.
</li>
<li>
<b>Servidor Multim&eacute;dia</b> permite que os dispositivos dom&eacute;sticos DLNA/UPnP na LAN pesquisem e reproduzam conte&uacute;dos multim&eacute;dia na sua DiskStation.
</li>
<li>
<b>iTunes</b> permite que clientes iTunes na LAN procurem e reproduzam m&uacute;sica ou v&iacute;deos na sua DiskStation.
</li>
</ul>
</li>
<li>
Toque em <b>Conclu&iacute;do</b> para confirmar.
</li>
</ol>
<h4>Para gerir os Servi&ccedil;os de Internet da DiskStation:</h4>
<ol>
<li>
Active ou desactive um dos seguintes:
<ul>
<li>
O <b>Bloqueio Autom&aacute;tico</b> permite-lhe evitar qualquer tentativa de in&iacute;cio de sess&atilde;o n&atilde;o autorizada.
</li>
<li>
<b>FTP</b> permite que a sua DiskStation se torne num servidor FTP.
</li>
<li>
A op&ccedil;&atilde;o <b>Servi&ccedil;os na Internet</b> permite-lhe alojar p&aacute;ginas de Internet (com suporte de PHP+MySQL) na sua DiskStation.
</li>
<li>
A <b>WebDAV</b> permite que programas cliente fa&ccedil;am a gest&atilde;o e editem ficheiros na DiskStation atrav&eacute;s do protocolo HTTP.
</li>
<li>
A <b>WebDAV (HTTPS)</b> permite que programas cliente fa&ccedil;am a gest&atilde;o e editem ficheiros na DiskStation atrav&eacute;s do protocolo HTTPS.
</li>
<li>
A <b><a name="filestationservice"></a>File Station</b> &eacute; uma aplica&ccedil;&atilde;o baseada na Internet que lhe permite gerir os ficheiros na DiskStation atrav&eacute;s de uma porta personalizada sem iniciar sess&atilde;o no DSM.
</li>
<li>
A <b>File Station (HTTPS)</b> permite-lhe ligar a uma File Station atrav&eacute;s do protocolo HTTPS.
</li>
<li>
A <b>Surveillance Station</b> &eacute; uma aplica&ccedil;&atilde;o baseada na Internet que pode gerir c&acirc;maras IP para salvaguardar o seu ambiente dom&eacute;stico ou do escrit&oacute;rio.
</li>
<li>
A <b>Audio Station</b> &eacute; uma aplica&ccedil;&atilde;o baseada na Internet que lhe permite aceder &agrave; biblioteca de m&uacute;sica na sua DiskStation.
</li>
<li>
A <b>Photo Station</b> &eacute; um &aacute;lbum de fotos online integrada com um blogue guardado na sua DiskStation.
</li>
<li>
A <b><a name="downloadsationservice"></a>Download Station</b> (BT/HTTP/FTP/NZB/RSS) &eacute; uma aplica&ccedil;&atilde;o baseada na Internet que o ajuda a transferir ficheiros da Internet para a sua DiskStation.
</li>
<li>
O <b>eMule</b> activa o suporte do eMule da Download Station.
</li>
</ul>
</li>
<li>
Toque em <b>Conclu&iacute;do</b> para confirmar.
</li>
</ol>
<p>
<span class="note_head">Nota: </span>Para obter mais informa&ccedil;&otilde;es acerca dos servi&ccedil;os acima, proceda de uma das seguintes formas:
</p>
<ul>
<li>
<b>Ajuda do DSM</b> (dispon&iacute;vel iniciando sess&atilde;o na edi&ccedil;&atilde;o do ambiente de trabalho do DSM com o navegador de Internet do seu computador e acedendo a <b>Menu Principal</b> &gt; <b>Ajuda do DSM</b>)
</li>
<li>
<b>Guia do Utilizador da Synology DiskStation</b> (dispon&iacute;vel no <a href="http://www.synology.com/support/download.php" target="_blank">Centro de Transfer&ecirc;ncias</a> da Synology)
</li>
</ul>
</div>

<h2><a name="services" href="javascript:SYNO.Utils.ToggleContent('block');" >Gerir Bloqueio Autom&aacute;tico</a></h2>
<div name="contents" id="block" class="x-hidden-display">
<p>
Toque em <b>Bloqueio Autom&aacute;tico</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para evitar in&iacute;cios de sess&atilde;o n&atilde;o autorizados.
</p>
<h4>Para gerir o bloqueio autom&aacute;tico:</h4>
<ol>
<li>Ligue <b>Activar</b> para activar o Bloqueio Autom&aacute;tico.</li>
<li>Introduza um n&uacute;mero para <b>Hora das tentativas</b> e <b>No espa&ccedil;o de (minutos)</b> para bloquear um endere&ccedil;o IP ap&oacute;s o n&uacute;mero especificado de tentativas para iniciar sess&atilde;o falhadas no espa&ccedil;o do n&uacute;mero especificado de minutos.</li>
<li>Especifique <b>Dias bloqueados</b> para desbloquear um endere&ccedil;o IP ap&oacute;s o n&uacute;mero de dias especificado. Se introduzir aqui &quot;0&quot;, o endere&ccedil;o IP bloqueado assim permanecer&aacute; de forma indefinida at&eacute; o remover da lista de bloqueio.</li>
<li>
Se desejar gerir a lista de bloqueio ou remover um endere&ccedil;o IP bloqueado da lista, toque em <b>Lista de bloqueio</b>.
</li>
<li>
Toque em <b>Conclu&iacute;do</b>.
</li>
</ol>
</div>
<h2><a name="services" href="javascript:SYNO.Utils.ToggleContent('package');" >Gerir o Centro de Pacotes</a></h2>
<div name="contents" id="package" class="x-hidden-display">
<p>A Synology integrou aplica&ccedil;&otilde;es de terceiros ou concebidas pela Synology transformadas em pacotes que podem ser instalados na DiskStation.</p>
<h4>Para gerir o Centro de Pacotes:</h4>
<p>
Inicie a sess&atilde;o na edi&ccedil;&atilde;o ambiente de trabalho do DSM com o navegador de Internet do seu computador e aceda a <b>Menu Principal</b> &gt; <b>Centro de Pacotes</b> para modificar os pacotes. Para instru&ccedil;&otilde;es detalhadas, consulte a Ajuda.
</p>
<h4>Para executar ou parar pacotes instalados:</h4>
<ol>
<li>
Ligue ou desligue os interruptores para executar ou parar os pacotes.
</li>
<li>
Toque em <b>Conclu&iacute;do</b>.
</li>
</ol>
</div>

<h2><a name="sysinfo" href="javascript:SYNO.Utils.ToggleContent('sysinfo');" >Visualizar Informa&ccedil;&otilde;es do Sistema</a></h2>
<div name="contents" id="sysinfo" class="x-hidden-display">
<p>
Toque em <b>Inf. do Sistema</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para obter uma vis&atilde;o geral sobre o estado da sua DiskStation.
</p>
<h4>Para visualizar as informa&ccedil;&otilde;es de sistema da sua DiskStation:</h4>
<ol>
<li>
Proceda de uma das seguintes formas:
<ul>
<li>
Toque em <b>Geral</b> para visualizar as informa&ccedil;&otilde;es b&aacute;sicas sobre a sua DiskStation, incluindo o n&uacute;mero de s&eacute;rie, o nome do modelo, a quantidade de mem&oacute;ria f&iacute;sica, a vers&atilde;o do DSM, bem como a informa&ccedil;&atilde;o sobre a hora e o estado t&eacute;rmico.
</li>
<li>
Toque em <b>Rede</b> para visualizar a configura&ccedil;&atilde;o de rede da sua DiskStation e o estado de cada interface de rede.
</li>
<li>
Toque em <b>Armazenamento</b> para visualizar a utiliza&ccedil;&atilde;o do volume da DiskStation.
</li>
</ul>
</li>
<li>
Toque no bot&atilde;o <b>Actualizar</b> no canto superior direito para manter as informa&ccedil;&otilde;es sobre o sistema actualizadas.
</li>
</ol>
</div>


<h2><a name="resourcemonitor" href="javascript:SYNO.Utils.ToggleContent('resourcemonitor');" >Monitorizar os Recursos de Sistema</a></h2>
<div name="contents" id="resourcemonitor" class="x-hidden-display">
<p>
Toque em <b>Monitor de Recurso</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para monitorizar o CPU da DiskStation e a utiliza&ccedil;&atilde;o da mem&oacute;ria.
</p>
</div>

<h2><a href="javascript:SYNO.Utils.ToggleContent('log');">Visualizar Registos ou Liga&ccedil;&otilde;es Atuais</a></h2>
<div name="contents" id="log" class="x-hidden-display">
<p>Toque em <b>Registo</b> na p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) ou o painel esquerdo (iPad ou tablet Android) para monitorizar liga&ccedil;&otilde;es atuais ou visualizar os registos dos servi&ccedil;os da DiskStation.</p>
<h4>Para monitorizar liga&ccedil;&otilde;es atuais:</h4>
Toque em <b>Liga&ccedil;&otilde;es atuais</b> na sec&ccedil;&atilde;o <b>Monitorizar</b> para ver a lista dos utilizadores a aceder de momento servi&ccedil;os da DiskStation.
<h4>Para visualizar as grava&ccedil;&otilde;es dos registos do servi&ccedil;o espec&iacute;fico:</h4>
<p>
Toque em qualquer item na sec&ccedil;&atilde;o <b>Registos de Eventos</b> ou <b>Registos de Transfer&ecirc;ncia de Ficheiros</b> para ver a lista dos registos relevantes.
</p>

</div>
<h2><a href="javascript:SYNO.Utils.ToggleContent('launch');">Iniciar Aplica&ccedil;&otilde;es M&oacute;veis</a></h2>
<div name="contents" id="launch" class="x-hidden-display">
<p>
O DSM m&oacute;vel disponibiliza um local conveniente para iniciar as aplica&ccedil;&otilde;es m&oacute;veis da Synology instaladas no seu iOS ou dispositivo Android.
</p>
<h4>Para iniciar as aplica&ccedil;&otilde;es m&oacute;veis da Synology com o DSM m&oacute;vel:</h4>
<p>
Toque numa das seguintes aplica&ccedil;&otilde;es na sec&ccedil;&atilde;o inferior da p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) no painel esquerdo (tablet Android ou iPad):
</p>
<ul>
<li>
<b>DS photo+</b> (dispon&iacute;vel quando o servi&ccedil;o <b>Photo Station</b> estiver activo)
</li>
<li>
<b>DS audio</b> (dispon&iacute;vel quando o servi&ccedil;o <b>Audio Station</b> estiver activo)
</li>
<li>
<b>DS cam</b> (dispon&iacute;vel quando o servi&ccedil;o <b>Surveillance Station</b> estiver activo)
</li>
<li>
<b>DS file</b> (dispon&iacute;vel quando o servi&ccedil;o <b>WebDAV</b> estiver activo)
</li>
</ul>
<p>
<span class="note_head">Nota: </span>Para obter mais informa&ccedil;&otilde;es sobre essas aplica&ccedil;&otilde;es, consulte os ficheiros de Ajuda fornecidos com as aplica&ccedil;&otilde;es.
</p>
</div>


<h2><a name="restart" href="javascript:SYNO.Utils.ToggleContent('restart');">Definir Ac&ccedil;&atilde;o na DiskStation<br><span style="font-size:80%;">(Reiniciar, Desligar ou Sinal Sonoro)</span></a></h2>
<div name="contents" id="restart" class="x-hidden-display">
<p>
O DSM m&oacute;vel permite-lhe reiniciar ou desligar a sua DiskStation com o seu dispositivo iOS ou Android. Para al&eacute;m disso, quando diversas DiskStations estiverem pr&oacute;ximas de si, pode identificar rapidamente a sua DiskStation, solicitando que esta emita sinais sonoros.
</p>
<h4>Para definir ac&ccedil;&atilde;o na sua DiskStation:</h4>
<ol>
<li>
Toque no bot&atilde;o de ac&ccedil;&atilde;o no canto superior direito da p&aacute;gina de in&iacute;cio (iPhone/iPod touch ou telem&oacute;vel Android) no painel esquerdo (tablet Android ou iPad).
</li>
<li>
Proceda de uma das seguintes formas:
<ul>
<li>
Toque em <b>Reiniciar</b> e de seguida toque em <b>Sim</b> para reiniciar a sua DiskStation.
</li>
<li>
Toque em <b>Desligar</b> e de seguida toque em <b>Sim</b> para desligar a sua DiskStation.
</li>
<li>
Toque em <b>Localizar</b> para solicitar que a DiskStation emita sinais sonoros. Toque em <b>OK</b> para parar o sinal sonoro.
</li>
</ul>
</li>
</ol>
</div>
<h2><a name="desktopedition" href="javascript:SYNO.Utils.ToggleContent('desktopedition');">Alterar para a Edi&ccedil;&atilde;o do Ambiente de Trabalho do DSM</a></h2>
<div name="contents" id="desktopedition" class="x-hidden-display">
<p>
Toque no bot&atilde;o de ac&ccedil;&atilde;o no canto superior direito do painel esquerdo e de seguida toque em <b>Edi&ccedil;&atilde;o do Ambiente de Trabalho</b> para alterar para a Edi&ccedil;&atilde;o do Ambiente de Trabalho do DSM.</p>
</div>

<h2><a href="javascript:SYNO.Utils.ToggleContent('contents11');">Mais Informa&ccedil;&atilde;o</a></h2>
<div name="contents" id="contents11" class="x-hidden-display">
<p>Se necessitar de informa&ccedil;&otilde;es sobre resolu&ccedil;&atilde;o de problemas ou pretender aprender mais acerca da Synology, toque nas liga&ccedil;&otilde;es seguinte para obter recursos online da Synology:
</p>
<ul>
<li>
<a href="https://www.synology.com/knowledgebase/faq" target="_blank">FAQ</a>
</li>
<li>
<a href="http://forum.synology.com/wiki" target="_blank">Wiki</a>
</li>
<li>
<a href="http://forum.synology.com" target="_blank">F&oacute;rum</a>
</li>
<li>
<a href="http://www.synology.com/support/download.php" target="_blank">Centro de Transfer&ecirc;ncias</a>
</li>
<li>
<a href="https://account.synology.com/support/support_form.php" target="_blank">Suporte T&eacute;cnico</a>
</li>
</ul>
</div>
<h2><a href="javascript:SYNO.Utils.ToggleContent('contents12');">Acerca</a></h2>
<div name="contents" id="contents12" class="x-hidden-display">
<p>
<p>Copyright &copy; 2004-2015 Synology Inc. Todos os direitos reservados.</p>
<p> Todos os t&iacute;tulos, os direitos de autor e outros direitos de propriedade intelectual inclu&iacute;dos e anexados ao Produto de Software (incluindo, entre outros, qualquer meio de suporte de dados relevante, imagens, fotografias, anima&ccedil;&otilde;es, v&iacute;deos, &aacute;udio, m&uacute;sica, textos e mini-aplica&ccedil;&otilde;es incorporados no produto de software), os manuais e outros documentos que o acompanham e documentos online ou electr&oacute;nicos, se existirem (colectivamente, &quot;Produto de Software&quot;), s&atilde;o propriedade da Synology Inc. Excepto se de outra forma expressamente licenciada pela Synology Inc., por escrito, qualquer fornecimento do Produto de Software n&atilde;o representa qualquer licenciamento dos direitos acima referidos.</p>
<p>Copyright &copy;</p>
<p> Os direitos de autor e outros direitos de propriedade intelectual dos ficheiros multim&eacute;dia incluindo, entre outros, as fotos, v&iacute;deos, m&uacute;sica, v&iacute;deos em rede e ficheiros electr&oacute;nicos, guardados com a utiliza&ccedil;&atilde;o das aplica&ccedil;&otilde;es fornecidas com o Produto de Software pelo utilizador, s&atilde;o propriedade do utilizador ou de outras entidades terceiras.</p>
</p>
</div>
</body>
</html>