<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Opci&oacute;k</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="leaf_user"></a>Egyebek</h2>
<p>Az <strong>Opci&oacute;k</strong> &gt; <strong>Egyebek</strong> men&uuml;pontban testreszabhatja egy&eacute;b szem&eacute;lyes fi&oacute;kopci&oacute;it.</p>

<h4>Egy&eacute;b szem&eacute;lyes be&aacute;ll&iacute;t&aacute;sok testreszab&aacute;sa:</h4>
<ol>
<li>V&aacute;lassza a k&ouml;vetkezők egyik&eacute;t:
<ul>
<li><b>Ne mutassa a megerős&iacute;tő p&aacute;rbesz&eacute;dpanelt a DSM elhagy&aacute;sakor:</b> A b&ouml;ng&eacute;szőablak bez&aacute;r&aacute;sakor &aacute;tugorja a j&oacute;v&aacute;hagy&oacute; p&aacute;rbesz&eacute;dablakot.</li>
<li><b>DSM vissza&aacute;ll&iacute;t&aacute;sa az előző kijelentkez&eacute;si &aacute;llapotra bejelentkez&eacute;skor:</b> Eml&eacute;kszik a megnyitott alkalmaz&aacute;sokra &eacute;s csomagokra, &eacute;s vissza&aacute;ll&iacute;tja azokat, amikor &ouml;n legk&ouml;zelebb bejelentkezik vagy friss&iacute;ti a b&ouml;ng&eacute;szőablakot.</li>
<li><b>Azonnali előn&eacute;zet enged&eacute;lyez&eacute;se a t&aacute;lc&aacute;n:</b> Megjelen&iacute;ti egy megnyitott alkalmaz&aacute;s gyors előn&eacute;zet&eacute;t, amikor az eg&eacute;rmutat&oacute;t az alkalmaz&aacute;s ikonja f&ouml;l&eacute; viszi a t&aacute;lc&aacute;n.

</li>
<li><strong>B&ouml;ng&eacute;sző asztali &eacute;rtes&iacute;t&eacute;sek enged&eacute;lyez&eacute;se:</strong> &Eacute;rtes&iacute;t&eacute;seket mutat meg a webb&ouml;ng&eacute;szőtől a DSM asztalon.
  
  A b&ouml;ng&eacute;sző asztali &uuml;zeneteket csak a Google Chrome &eacute;s a Safari t&aacute;mogatja. A webb&ouml;ng&eacute;sző verzi&oacute;j&aacute;nak f&uuml;ggv&eacute;ny&eacute;ben az &eacute;rtes&iacute;t&eacute;sek be&aacute;ll&iacute;t&aacute;sainak oldala k&uuml;l&ouml;nb&ouml;ző lehet. Az &eacute;rtes&iacute;t&eacute;sek be&aacute;ll&iacute;t&aacute;sainak kezel&eacute;s&eacute;hez menjen a b&ouml;ng&eacute;szője be&aacute;ll&iacute;t&aacute;sok oldal&aacute;ra.</li>
</ul>
<li>
Kattintson az <b>OK</b> gombra.
</li>
</ol>

<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Az azonnali előn&eacute;zet az Internet Exploreren nem t&aacute;mogatott.</li>
</ul>
</div>

</body>
</html>