<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Restaurar</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Restaurar</h2>
<p>V&aacute; para <strong>Backup e replica&ccedil;&atilde;o</strong> &gt; <strong>Restaurar</strong> para restaurar os dados de backup.</p>
<h4><a name="restore"></a>Para restaurar uma tarefa de backup:</h4>
<ol class="disable-eds14">
<li>Selecione uma tarefa de backup e clique em <b>Restaurar</b>. Se a tarefa for um backup multivers&atilde;o, selecione <strong> Restaurar</strong> &gt; <strong>Tarefa inteira</strong>.</li>
<li>Voc&ecirc; pode ser solicitado a selecionar a configura&ccedil;&atilde;o do sistema, as diversas vers&otilde;es de dados de backup ou outras. Isso depende se a tarefa for de backup de dados, tarefa de backup do LUN*, destino de backup de uma &uacute;nica vers&atilde;o (ou seja, pasta compartilhada) ou destino de backup de diversas vers&otilde;es (ou seja, volume).</li>
<li>Siga o assistente para concluir a configura&ccedil;&atilde;o.</li>
</ol>
<ol class="enable-eds14">
<li>Selecione uma tarefa de backup e clique em <b>Restaurar</b>.</li>
<li>Voc&ecirc; pode ser solicitado a selecionar a configura&ccedil;&atilde;o do sistema, as diversas vers&otilde;es de dados de backup ou outras. Depende do tipo de tarefa de backup.</li>
<li>Siga o assistente para concluir a configura&ccedil;&atilde;o.</li>
</ol>
<div class="section enable-eds14">
<h4>Nota:</h4>
<ul>
<li>A restaura&ccedil;&atilde;o de determinados aplicativos &eacute; suportada. Para saber se um pacote espec&iacute;fico suporta a restaura&ccedil;&atilde;o e conhecer suas limita&ccedil;&otilde;es, consulte a ajuda de cada aplicativo.</li>
<li>Durante a restaura&ccedil;&atilde;o de um pacote, se o pacote n&atilde;o estiver instalado, o sistema instalar&aacute; automaticamente a vers&atilde;o mais recente ou a mesma vers&atilde;o do aplicativo. Se o aplicativo estiver instalado, mas for de uma vers&atilde;o mais antiga que a vers&atilde;o de backup, o sistema ir&aacute; atualiz&aacute;-lo automaticamente para a vers&atilde;o de backup original.</li>
<li>Os aplicativos de backup do DSM 5.1 ou superior n&atilde;o podem ser restaurados no DSM 5.0 ou inferior. </li>
</ul>
</div>
<div class="section disable-eds14">
<h4>Nota:</h4>
<ul>
<li>Ap&oacute;s a restaura&ccedil;&atilde;o ser conclu&iacute;da, o backup do LUN ser&aacute; restaurado para um LUN baseado em arquivo no volume de destino selecionado.*</li>
<li>A restaura&ccedil;&atilde;o de determinados aplicativos &eacute; suportada. Para saber se um pacote espec&iacute;fico suporta a restaura&ccedil;&atilde;o e conhecer suas limita&ccedil;&otilde;es, consulte a ajuda de cada aplicativo.</li>
<li>Durante a restaura&ccedil;&atilde;o de um pacote, se o pacote n&atilde;o estiver instalado, o sistema instalar&aacute; automaticamente a vers&atilde;o mais recente ou a mesma vers&atilde;o do aplicativo. Se o aplicativo estiver instalado, mas for de uma vers&atilde;o mais antiga que a vers&atilde;o de backup, o sistema ir&aacute; atualiz&aacute;-lo automaticamente para a vers&atilde;o de backup original.</li>
<li>Os aplicativos de backup do DSM 5.1 ou superior n&atilde;o podem ser restaurados no DSM 5.0 ou inferior. </li>
</ul>
</div>
<h4><a name="restore"></a>Para restaurar um &uacute;nico arquivo ou pasta para tarefa de backup multivers&atilde;o:</h4>
<ol>
<li>Abra a <strong>Vers&atilde;o do navegador de arquivos</strong>. Voc&ecirc; pode fazer isso com um dos m&eacute;todos abaixo:</li>
<ul>
<li>Clique em <strong>Restaurar</strong> e selecione <strong>Arquivos/pastas individuais</strong> do menu suspenso. </li>
<li>V&aacute; para <strong>Destino de backup</strong> e expanda o destino de backup selecionado. Clique no &iacute;cone <strong>Informa&ccedil;&otilde;es de vers&atilde;o do backup</strong>. Na janela que aparece, selecione a vers&atilde;o do backup que voc&ecirc; deseja restaurar e clique no &iacute;cone <strong>Vers&atilde;o do navegador de arquivos</strong>.</li>
</ul>
<li>Voc&ecirc; pode procurar as vers&otilde;es de um arquivo ou pasta que desejar usando a linha do tempo ou o &iacute;cone do calend&aacute;rio na parte inferior da tela. </li>
<li>Selecione a vers&atilde;o que deseja gerenciar e clique em <strong>Restaurar</strong>. </li>
<li>Como alternativa, voc&ecirc; pode copiar um arquivo ou pasta para outro local ou baix&aacute;-lo usando o bot&atilde;o <strong> Copiar para...</strong> ou <strong> Baixar</strong>. </li>
<li>Voc&ecirc; tamb&eacute;m pode clicar com o bot&atilde;o direito no arquivo ou pasta e selecionar essas op&ccedil;&otilde;es do menu suspenso. </li>
</ol>
<h4>Para pesquisar uma vers&atilde;o espec&iacute;fica:</h4>
<ol>
  <li>Clique na seta na barra de filtros no canto superior direito.</li>
  <li>No menu suspenso, voc&ecirc; pode filtrar os arquivos por:</li>
  <ul>
    <li><strong>Palavra-chave:&nbsp;</strong>digite o nome de qualquer arquivo ou pasta. Voc&ecirc; pode usar curingas [*] (representando um ou mais caracteres) e [?] (representando um caractere aleat&oacute;rio) em suas palavras-chave. Por exemplo, [a<span class="note_content">*</span>n] pode representar [a<span class="note_content">ctio</span>n], [a<span class="note_content">ttentio</span>n], ou [an].</li>
    <li><strong>Tipo de arquivo:</strong> no menu suspenso voc&ecirc; pode selecionar de <strong>Qualquer</strong>, <strong>Qualquer pasta</strong> ou <strong>Qualquer arquivo</strong> para refinar sua pesquisa.</li>
    <li><strong>Tamanho:</strong> selecione <strong>Qualquer, </strong>ou selecione <strong>igual a</strong>, <strong>maior que</strong>, <strong>menor que </strong>e digite um valor.</li>    
    <li><strong>Intervalo de datas:&nbsp;</strong>selecione entre <strong>Hoje</strong>, <strong>Ontem</strong>, <strong>Semana passada</strong> ou <strong>M&ecirc;s passado</strong>, ou <strong>Personalizar</strong> para digitar uma data de in&iacute;cio e final a fim de localizar registros dentro de um intervalo espec&iacute;fico.</li>
  </ul>
  <li>Para aplicar seus filtros, clique em <strong>Filtro</strong>. </li>
  <li>Para restabelecer sua pesquisa filtrada, clique no bot&atilde;o <strong>Redefinir</strong>.</li>
</ol>
<div class="section">
<h4>Nota:</h4>
<ul>
<li>Apenas as tarefas de backup multivers&atilde;o fornecem a fun&ccedil;&atilde;o Vers&atilde;o do navegador de arquivos.</li>
<li>A vers&atilde;o do navegador de arquivos te apenas fun&ccedil;&otilde;es parciais no DSM 5.1 ou inferior.</li>
<li dir="ltr">A configura&ccedil;&atilde;o e os aplicativos do sistema podem ser restaurados apenas atrav&eacute;s de <strong>Restaurar</strong> &gt; <strong>Tarefa inteira</strong>. </li>
<li>Os metadados n&atilde;o ser&atilde;o inclu&iacute;dos nas a&ccedil;&otilde;es <strong>Copiar para...</strong> e <strong>Baixar</strong>. </li>
</ul>
</div>
<h4><a name="restore"></a>Para restaurar tarefas de backup de outro destino de backup:</h4>
<ol>
<li>Clique em <b>Restaurar de...</b>.</li>
<li>Selecione um dos itens a seguir para localizar a tarefa de backup e clique em <b>Pr&oacute;ximo</b>:</li>
<ul>
<li><b>Restaura&ccedil;&atilde;o local</b>: Selecione esta op&ccedil;&atilde;o para restaurar os dados de uma pasta compartilhada local ou disco externo.</li>
<li><b>Restaura&ccedil;&atilde;o de rede</b>: Selecione esta op&ccedil;&atilde;o para restaurar os dados de outro DiskStation ou de um servidor compat&iacute;vel de rsync.</li>
<li><b>Restaura&ccedil;&atilde;o do servi&ccedil;o de nuvem p&uacute;blica</b>: Selecione essa op&ccedil;&atilde;o para restaurar os dados de um servidor de nuvem p&uacute;blica. </li>
</ul>
<li>Quando solicitado, selecione a origem onde a tarefa de backup &eacute; mantida e selecione o destino para restaurar os dados.</li>
<li>Siga o assistente para concluir.</li>
</ol>
<div class="section enable-eds14">
<h4>Nota:</h4>
<ul>
  <li>O Embedded DataStation s&oacute; pode restaurar pastas compartilhadas para dispositivos externos ext3/ext4.</li>
  
<li>O Embedded DataStation n&atilde;o suporta a restaura&ccedil;&atilde;o de aplicativos sem um dispositivo externo ext3/ext4.</li>
</ul>
</div>
<p>____<br /> * Dispon&iacute;vel apenas em modelos espec&iacute;ficos.</p>
</body></html>
