 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Cria&ccedil;&atilde;o de Volumes - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on Synology NAS using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Cria&ccedil;&atilde;o do volume</h2>

<p>Este artigo explica como criar volumes em seu DiskStation. Ao criar um novo volume, &eacute; poss&iacute;vel selecionar um dos seguintes m&eacute;todos:</p>

<ul>
  <li><b>R&aacute;pido:</b> Essa &eacute; a melhor op&ccedil;&atilde;o para iniciantes. Selecione esse m&eacute;todo se voc&ecirc; desejar otimizar automaticamente a capacidade de armazenamento e desempenho sem se preocupar com os aspectos t&eacute;cnicos, como n&iacute;veis de RAID. </li>

<li><b>Personalizado:</b> Para usu&aacute;rios avan&ccedil;ados que queiram controlar os aspectos mais detalhados da cria&ccedil;&atilde;o do volume, como tipos de RAID e atribui&ccedil;&atilde;o de capacidade. Essa op&ccedil;&atilde;o oferece suporte a diferentes tipos de RAID, permite que voc&ecirc; crie volumes &uacute;nicos ou m&uacute;ltiplos e fornece op&ccedil;&otilde;es para alocar quantidades espec&iacute;ficas de capacidade para cada volume (somente ao criar v&aacute;rios volumes em RAID).
</li>
</ul>

<div class="section">
<h4>Volumes &Uacute;nicos ou M&uacute;ltiplos em RAID?</h4>
<p>Ao criar um volume com o modo personalizado, &eacute; poss&iacute;vel selecionar uma das seguintes op&ccedil;&otilde;es:</p>
<ul>
  <li><b>Volume &uacute;nico no RAID</b>
    <ul>
      <li>Cria um &uacute;nico volume usando toda a capacidade dispon&iacute;vel dos discos r&iacute;gidos selecionados.</li>
      <li>Proporciona melhor velocidade e desempenho.</li>
      <li>Suporta diferentes tipos de RAID.</li>
    </ul>
  </li>
  <li><b>Volumes m&uacute;ltiplos no RAID</b>
    <ul>
      <li>Permite que voc&ecirc; crie v&aacute;rios volumes em um grupo de discos.</li>
      <li>Suporta a aloca&ccedil;&atilde;o de quantidades espec&iacute;ficas da capacidade para cada volume.</li>
      <li>Fornece excelente flexibilidade de gerenciamento de armazenamento.</li>
      <li>Suporta diferentes tipos de RAID.</li>
    </ul>
  </li>
</ul>
</div>


<div class="section">
<h4>Antes de Come&ccedil;ar:</h4>
<ul>
<li>Antes de come&ccedil;ar, verifique se n&atilde;o h&aacute; dados importantes nos discos r&iacute;gidos. Todos os dados existentes ser&atilde;o apagados durante o processo de cria&ccedil;&atilde;o.</li>
<li>V&aacute; para a p&aacute;gina <b>HDD/SSD</b> e verifique se o status de cada disco r&iacute;gido &eacute; <b>Normal</b> ou <strong>N&atilde;o inicializado.</strong></li>
</ul>
</div>


<h4>Para criar um volume:</h4>
<ol>
<li>Abra o <b>Gerenciador de armazenamento</b>.</li>
<li>V&aacute; para <b>Volume</b> e clique em <b>Criar.</b></li>
<li>Voc&ecirc; ver&aacute; o assistente de cria&ccedil;&atilde;o de volumes. Selecione <strong>R&aacute;pida</strong> ou <strong>Personalizada</strong> de acordo com suas necessidades. Em seguida, siga as etapas no assistente para finalizar a cria&ccedil;&atilde;o do volume.</li>
</ol>

</body>
</html>
