<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Ayuda de DSM - Administrador de protecci&oacute;n de datos</title>
<meta name="author" content="Synology Inc.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="utf-8">
</head>
<body>
<h1>Administrador de protecci&oacute;n de datos</h1>
<p>El administrador de protecci&oacute;n de datos es un experto en copias de seguridad y recuperaci&oacute;n de datos. Las empresas necesitan la protecci&oacute;n de datos para evitar su p&eacute;rdida a causa de borrados accidentales, aver&iacute;as de aplicaciones, da&ntilde;os de datos y virus.</p>

<p>La &ldquo;<strong>instant&aacute;nea</strong>&rdquo; es una copia realizada en un determinado momento puntual que se almacena en el mismo volumen y se utiliza para registrar el estado de todos los datos en el momento en que se toma. Las instant&aacute;neas s&oacute;lo utilizan una peque&ntilde;a cantidad de espacio de almacenamiento adicional y no tienen ning&uacute;n impacto en el rendimiento. </p>

<p>Con ellas, si un usuario modifica o elimina accidentalmente datos de un volumen con instant&aacute;neas, podr&aacute; restaurar r&aacute;pidamente los datos al momento en el que se tom&oacute; la instant&aacute;nea. Adem&aacute;s, permite a los usuarios recuperar sus propios archivos eliminados o modificados en carpetas compartidas sin tener que pedir ayuda al administrador.</p>

<p>El administrador de protecci&oacute;n de datos le ayuda a supervisar las instant&aacute;neas en su DiskStation.</p>

<p>Seg&uacute;n las funciones compatibles con el DiskStation, el <strong>Administrador de protecci&oacute;n de datos</strong> le ayuda a completar las siguientes tareas:</p>
<ul>
	<li>Tomar y administrar instant&aacute;neas de <strong>carpetas compartidas*</strong> e <strong>iSCSI LUNs</strong>.</li>
	<li>Configurar <strong>instant&aacute;neas programadas</strong> y la <strong>configuraci&oacute;n de retenci&oacute;n</strong>. Esta configuraci&oacute;n determinar&aacute; cu&aacute;ndo y c&oacute;mo se debe tomar, retener y/o eliminar una instant&aacute;nea.</li>
	<li>Visualizar los registros de eventos relacionados con instant&aacute;neas.</li>
</ul>

<p>_____<br/> <strong>*</strong> Las instant&aacute;neas de carpetas compartidas s&oacute;lo se pueden tomar cuando el almacenamiento utiliza el sistema de archivos <strong>Btrfs</strong>.</p>

</body>
</html>