<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="download"></a>Stažen&iacute; souborů</h2>

<p>Stažen&iacute; souborů nebo složek z&nbsp;DiskStation do poč&iacute;tače provedete n&aacute;sleduj&iacute;c&iacute;m způsobem.</p>
<h4>Stažen&iacute; souborů do m&iacute;stn&iacute;ho poč&iacute;tače:</h4>
<ol>
<li>Vyberte soubory nebo složky, kter&eacute; chcete st&aacute;hnout. (Pokud chcete vybrat v&iacute;ce položek, stiskněte a&nbsp;podržte kl&aacute;vesu Shift nebo Ctrl.)</li>
<li>Z&nbsp;nab&iacute;dky <b>Akce</b> vyberte možnost <b>St&aacute;hnout</b> a&nbsp;pot&eacute; vyberte některou z&nbsp;n&aacute;sleduj&iacute;c&iacute;ch možnost&iacute;:</li>
<ul>
<li><b>St&aacute;hnout</b>: V&yacute;běrem t&eacute;to možnosti můžete st&aacute;hnout soubory pomoc&iacute; funkce stahov&aacute;n&iacute; ve webov&eacute;m prohl&iacute;žeči.</li>
<li><b>Přidat do fronty</b> &ndash; <b>Přepsat</b> nebo <b>Přidat do fronty</b> &ndash; <b>Přeskočit</b>: Pokud chcete přepsat soubory nebo složky se stejn&yacute;m n&aacute;zvem v&nbsp;c&iacute;lov&eacute;m um&iacute;stěn&iacute;, vyberte podle toho některou z&nbsp;možnost&iacute; a&nbsp;přidejte soubory do fronty stahov&aacute;n&iacute; (kter&aacute; se zobraz&iacute; klepnut&iacute;m na symbol stahov&aacute;n&iacute; ve tvaru &scaron;ipky v&nbsp;prav&eacute;m horn&iacute;m rohu).</ul>
</li>
</ol>

<ol><span class="note_head">Pozn&aacute;mka:</span><li>V&nbsp;prostřed&iacute; syst&eacute;mu Windows budou znaky <span class="note_content">\ * ? &ldquo; < > | :</span></span> v&nbsp;n&aacute;zvu souboru nahrazeny po stažen&iacute; znakem <span class="note_content">-</span>.</li>
<li>Pokud zvol&iacute;te stahov&aacute;n&iacute; v&iacute;ce souborů, budou vybran&eacute; soubory archivov&aacute;ny do .zip souboru s využit&iacute;m k&oacute;dov&eacute; str&aacute;nky File Station zvolen&eacute; před stažen&iacute;m v č&aacute;sti <strong>Nastaven&iacute;</strong> &gt; <strong>Obecn&eacute;</strong>.</li>
</ol>
<h2><a name="link"></a>Z&iacute;sk&aacute;n&iacute; odkazu pro stažen&iacute; souboru/složky</h2>
<p>Můžete z&iacute;skat odkaz pro stažen&iacute; souboru či složky a sd&iacute;let odkaz s ostatn&iacute;mi uživateli.</p>
<h4>Z&iacute;sk&aacute;n&iacute; odkazu pro stažen&iacute; souboru či složky:</h4>
<ol>
<li>Vyberte soubor či složku, pro kterou chcete z&iacute;skat odkaz pro stažen&iacute;.</li>
<li>Otevřete okno Vlastnosti jedn&iacute;m z těchto způsobů:</li>
<ul>
<li>Vyberte možnost <b>Vlastnosti</b> z nab&iacute;dky <b>Akce</b>.</li>
<li>Klepněte prav&yacute;m tlač&iacute;tkem na jeden soubor či složku a vyberte možnost <b>Vlastnosti</b>.</li>
</ul>
<li>Klepněte prav&yacute;m tlač&iacute;tkem na odkaz pro stažen&iacute; a vyberte z kontextov&eacute; nab&iacute;dky př&iacute;slu&scaron;nou funkci na zkop&iacute;rov&aacute;n&iacute; odkazu pro stažen&iacute;. N&aacute;zev funkce se může li&scaron;it v z&aacute;vislosti na webov&eacute;m prohl&iacute;žeči, kter&yacute; použ&iacute;v&aacute;te.</li>

<li>Odkaz za&scaron;lete ostatn&iacute;m uživatelům e-mailem nebo pomoc&iacute; rychl&eacute; zpr&aacute;vy. Tito uživatel&eacute; si mohou st&aacute;hnout odkazovan&yacute; soubor nebo složku na z&aacute;kladě zad&aacute;n&iacute; jejich uživatelsk&eacute;ho jm&eacute;na a hesla.</li>
</ol>
<p><span class="note_head">Pozn&aacute;mka:</span> Aby bylo možn&eacute; st&aacute;hnout soubor nebo složku přes odkaz pro stažen&iacute;, je vyžadov&aacute;no platn&eacute; uživatelsk&eacute; jm&eacute;no a heslo.</p>
</body>
</html>
