<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Hled&aacute;n&iacute; souborů nebo složek</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>Hled&aacute;n&iacute; souborů nebo složek</h2>
<p><strong>Filtr</strong> pro File Station obsahuje možnosti hled&aacute;n&iacute; a&nbsp;zobrazen&iacute; souborů nebo složek, kter&eacute; odpov&iacute;daj&iacute; zadan&yacute;m krit&eacute;ri&iacute;m. Můžete filtrovat soubory nebo složky v&nbsp;r&aacute;mci aktu&aacute;ln&iacute; složky, nebo spustit roz&scaron;&iacute;řen&eacute; hled&aacute;n&iacute; v&nbsp;r&aacute;mci v&scaron;ech podsložek a&nbsp;z&iacute;skat přesněj&scaron;&iacute; v&yacute;sledky. </p>
<h4>Hled&aacute;n&iacute; souborů nebo složek v&nbsp;aktu&aacute;ln&iacute; složce:</h4>

<ol>
<li>Pomoc&iacute; aplikace File Station přejděte do složky s&nbsp;obsahem, kter&yacute; chcete prohledat.</li>
<li>V&nbsp;poli <b>Filtr</b> v&nbsp;prav&eacute;m horn&iacute;m rohu okna zadejte kl&iacute;čov&eacute; slovo. T&iacute;m zobraz&iacute;te filtrovan&eacute; v&yacute;sledky v&nbsp;hlavn&iacute; oblasti okna.</li>
</ol>
<h4>Postup spu&scaron;těn&iacute; roz&scaron;&iacute;řen&eacute;ho hled&aacute;n&iacute;:</h4>
<ol>
<li>Pomoc&iacute; aplikace File Station přejděte do složky s&nbsp;obsahem, kter&yacute; chcete prohledat.</li>
<li>Kliknut&iacute;m na ikonu lupy vedle pole <b>Filtr</b> v&nbsp;prav&eacute;m horn&iacute;m rohu File Station zobraz&iacute;te nab&iacute;dku roz&scaron;&iacute;řen&eacute;ho hled&aacute;n&iacute;.</li>

<li>Zadejte informace nebo vyberte krit&eacute;ria hled&aacute;n&iacute; z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky:</li>
<ul>
<li><b>Kl&iacute;čov&eacute; slovo</b>: Zad&aacute;n&iacute;m kl&iacute;čov&eacute;ho slova můžete vyhledat soubory nebo složky s&nbsp;odpov&iacute;daj&iacute;c&iacute;mi n&aacute;zvy.<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>V kl&iacute;čov&yacute;ch slovech můžete použ&iacute;t masky [*] (znamenaj&iacute;c&iacute; ž&aacute;dn&yacute; znak nebo několik znaků) a [?] (znamenaj&iacute;c&iacute; jeden n&aacute;hodn&yacute; znak). Např&iacute;klad formule [p<span class="note_content">*</span>a] může zastupovat slova [p<span class="note_content">r&aacute;v</span>a], [p<span class="note_content">oruch</span>a] nebo [pa].</li>
<li>Jednotliv&aacute; kl&iacute;čov&aacute; slova můžete oddělit č&aacute;rkou (,). Např&iacute;klad formule [<span class="note_content">a,tion</span>] může zastupovat slova [<span class="note_content">a</span>c<span class="note_content">tion</span>], [<span class="note_content">a</span>func<span class="note_content">tion</span>], [func<span class="note_content">tion</span> <span class="note_content">a</span>dded] nebo [n<span class="note_content">ation</span>].</li>
<li>Pokud chcete hledat přesn&eacute; shody, přidejte na zač&aacute;tek a&nbsp;konec kl&iacute;čov&eacute;ho slova dvojit&eacute; uvozovky [&quot;]. Např&iacute;klad [<span class="note_content">&quot;a kol&quot;</span>] může zastupovat spojen&iacute; [<span class="note_content">a kol</span>ektiv], ale nemůže zastupovat spojen&iacute; [<span class="note_content">kol</span>eg<span class="note_content">a</span>].</li>
</ul>
</div>
</li>


<li><b>Um&iacute;stěn&iacute;</b>: V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce nastavte rozsah a&nbsp;m&iacute;ru podrobnosti roz&scaron;&iacute;řen&eacute;ho hled&aacute;n&iacute;. Rozsah hled&aacute;n&iacute; můžete upravit tak, že vyberete jakoukoli dal&scaron;&iacute; sd&iacute;lenou složku ze seznamu.</li>
<li><b>Typ souboru</b>: Pomoc&iacute; možnosti <b>Př&iacute;pona</b> můžete omezit oblast hled&aacute;n&iacute; na určit&yacute; typ souborů. Zvolen&iacute;m možnosti <b>Libovoln&aacute; složka</b> můžete vyhled&aacute;vat jen složky.</li>
<li><strong>Datum</strong>: Vyberte možnost <b>Datum &uacute;pravy</b>, <b>Datum vytvořen&iacute;</b> nebo <strong>Posledn&iacute; př&iacute;stup</strong> a&nbsp;na z&aacute;kladě konkr&eacute;tn&iacute;ho data z&nbsp;kalend&aacute;ře zah&aacute;j&iacute;te hled&aacute;n&iacute; souborů s&nbsp;odpov&iacute;daj&iacute;c&iacute;mi daty.</li>
<li><b>Velikost (MB)</b>: Soubory s&nbsp;odpov&iacute;daj&iacute;c&iacute; velikost&iacute; můžete vyhledat pomoc&iacute; možnost&iacute; <b>rovn&aacute; se</b>, <b>je vět&scaron;&iacute; než</b> nebo <b>je men&scaron;&iacute; než</b> a&nbsp;zad&aacute;n&iacute;m velikosti. (Pokud vyberete možnost <strong>rovn&aacute; se</strong>, budou v&yacute;sledky hled&aacute;n&iacute; obsahovat soubory, kter&eacute; maj&iacute; přibližně stejnou velikost odpov&iacute;daj&iacute;c&iacute; zadan&eacute; hodnotě.)</li>
<li><b>Vlastn&iacute;k/skupina</b>: Pomoc&iacute; možnosti <b>Vlastn&iacute;k</b> nebo <b>Skupina</b> a&nbsp;př&iacute;slu&scaron;n&eacute; položky z&nbsp;rozev&iacute;rac&iacute; nab&iacute;dky můžete vyhledat soubory nebo složky, kter&eacute; patř&iacute; vybran&eacute;mu vlastn&iacute;kovi nebo skupině.<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>Při roz&scaron;&iacute;řen&eacute;m vyhled&aacute;v&aacute;n&iacute; je třeba zadat <b>Um&iacute;stěn&iacute;</b> a je&scaron;tě alespoň jedno dal&scaron;&iacute; krit&eacute;rium vyhled&aacute;v&aacute;n&iacute;.</li>
<li>Pokud je do indexovan&eacute; sd&iacute;len&eacute; složky připojena ISO složka nebo vzd&aacute;len&aacute; složka, nelze pro hled&aacute;n&iacute; souborů v n&iacute; roz&scaron;&iacute;řen&eacute; vyhled&aacute;v&aacute;n&iacute; použ&iacute;t.</li>
</ul>
</div>
</li>

<li>Kliknut&iacute;m na možnost <b>Hledat</b> můžete zah&aacute;jit hled&aacute;n&iacute; a&nbsp;kliknut&iacute;m na možnost <b>Obnovit</b> můžete znovu zadat krit&eacute;ria hled&aacute;n&iacute;. Po dokončen&iacute; hled&aacute;n&iacute; se př&iacute;slu&scaron;n&eacute; soubory zobraz&iacute; v&nbsp;hlavn&iacute; č&aacute;sti aplikace File Station.</li>

</ol>
</body>
</html>
