<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>File Station</title>


<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2><a name="download"></a>F&aacute;jlok let&ouml;lt&eacute;se</h2>

<p>Helyi sz&aacute;m&iacute;t&oacute;g&eacute;p&eacute;re a k&ouml;vetkezők&eacute;ppen t&ouml;lthet le f&aacute;jlt vagy mapp&aacute;t a(z) DiskStation k&eacute;sz&uuml;l&eacute;kről.</p>
<h4>F&aacute;jl let&ouml;lt&eacute;se a helyi sz&aacute;m&iacute;t&oacute;g&eacute;pre:</h4>
<ol>
<li>V&aacute;lassza ki a let&ouml;lteni k&iacute;v&aacute;nt f&aacute;jlokat vagy mapp&aacute;kat. (T&ouml;bbsz&ouml;r&ouml;s kijel&ouml;l&eacute;s k&ouml;zben tartsa lenyomva a Shift vagy Ctrl billentyűt.)</li>
<li>V&aacute;lassza ki a <b>Let&ouml;lt&eacute;s</b> lehetős&eacute;get a <b>Műveletek</b> men&uuml;ből, majd tegye a k&ouml;vetkezők valamelyik&eacute;t:</li>
<ul>
<li><b>Let&ouml;lt&eacute;s</b>: &Iacute;gy a webb&ouml;ng&eacute;szője let&ouml;lt&eacute;s funkci&oacute;ja r&eacute;v&eacute;n t&ouml;ltheti le a f&aacute;jlokat.</li>
<li><b>Hozz&aacute;ad&aacute;s a sorhoz</b> - <b>Fel&uuml;l&iacute;r&aacute;s</b> vagy <b>Hozz&aacute;ad&aacute;s a sorhoz</b> - <b>Kihagy&aacute;s</b>: Att&oacute;l f&uuml;ggően, hogy a c&eacute;lhelyen tal&aacute;lhat&oacute;, azonos nevű f&aacute;jlokat &eacute;s mapp&aacute;kat fel&uuml;l k&iacute;v&aacute;nja-e &iacute;rni, a let&ouml;lt&eacute;si list&aacute;ra v&eacute;telhez v&aacute;lasszon a k&eacute;t lehetős&eacute;g k&ouml;z&uuml;l (a lista a jobb felső sarokban l&aacute;that&oacute;, lefel&eacute; mutat&oacute; ny&iacute;lra kattintva jelen&iacute;thető meg).</ul>
</li>
</ol>

<ol><span class="note_head">Megjegyz&eacute;s:</span><li>Windows k&ouml;rnyezetben a f&aacute;jln&eacute;vben szereplő <span class="note_content">\ * ? &rdquo; < > | :</span></span> karaktereket let&ouml;lt&eacute;s ut&aacute;n <span class="note_content">-</span> v&aacute;ltja fel.</li>
<li>Amennyiben t&ouml;bb let&ouml;ltendő f&aacute;jlt v&aacute;laszt ki, a <strong>Be&aacute;ll&iacute;t&aacute;sok</strong> &gt; <strong>&Aacute;ltal&aacute;nos </strong>men&uuml;pontn&aacute;l meghat&aacute;rozott File Station k&oacute;dlap let&ouml;lt&eacute;s előtt a kiv&aacute;lasztott f&aacute;jlokat egy .zip &aacute;llom&aacute;nyba csomagolja.</li>
</ol>
<h2><a name="link"></a>A f&aacute;jl/mappa let&ouml;lt&eacute;si linkj&eacute;nek megszerz&eacute;se</h2>
<p>Megszerezheti egy f&aacute;jl vagy mappa let&ouml;lt&eacute;si linkj&eacute;t, &eacute;s megoszthatja a linket m&aacute;s felhaszn&aacute;l&oacute;kkal.</p>
<h4>F&aacute;jl vagy mappa let&ouml;lt&eacute;si linkj&eacute;nek megszerz&eacute;se:</h4>
<ol>
<li>V&aacute;lassza ki azt a f&aacute;jlt vagy mapp&aacute;t, amihez meg szeretn&eacute; szerezni a let&ouml;lt&eacute;si linkj&eacute;t.</li>
<li>Tegye a k&ouml;vetkezők egyik&eacute;t, ha meg szeretn&eacute; nyitni a Tulajdons&aacute;gok ablakot:</li>
<ul>
<li>V&aacute;lassza ki a <b>Tulajdons&aacute;gok</b> lehetős&eacute;get a <b>Műveletek</b> men&uuml;ből.</li>
<li>Kattintson a jobb eg&eacute;rgombbal a f&aacute;jlokra vagy mapp&aacute;kra, majd v&aacute;lassza a <b>Tulajdons&aacute;gok</b> lehetős&eacute;get.</li>
</ul>
<li>Kattintson a let&ouml;lt&eacute;si linkre a jobb eg&eacute;rgombbal, majd a let&ouml;lt&eacute;si link lem&aacute;sol&aacute;s&aacute;hoz v&aacute;lassza a gyorsmen&uuml; megfelelő funkci&oacute;j&aacute;t. A funkci&oacute; neve az &eacute;ppen haszn&aacute;lt webb&ouml;ng&eacute;szőtől f&uuml;ggően v&aacute;ltozhat.</li>

<li>K&uuml;ldje el a linket m&aacute;s felhaszn&aacute;l&oacute;knak e-mailben vagy azonnali &uuml;zenetekben. Ők felhaszn&aacute;l&oacute;nev&uuml;k &eacute;s jelszavuk megad&aacute;s&aacute;val let&ouml;lthetik a belinkelt f&aacute;jlt vagy mapp&aacute;t.</li>
</ol>
<p><span class="note_head">Megjegyz&eacute;s:</span> Egy f&aacute;jl vagy mappa let&ouml;lt&eacute;si link seg&iacute;ts&eacute;g&eacute;vel t&ouml;rt&eacute;nő let&ouml;lt&eacute;s&eacute;hez &eacute;rv&eacute;nyes felhaszn&aacute;l&oacute;n&eacute;v &eacute;s jelsz&oacute; sz&uuml;ks&eacute;ges.</p>
</body>
</html>
