<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>F&aacute;jlok &eacute;s mapp&aacute;k keres&eacute;se</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2>F&aacute;jlok &eacute;s mapp&aacute;k keres&eacute;se</h2>
<p>A File Station <strong>Szűrő</strong> men&uuml;pontja lehetős&eacute;geket biztos&iacute;t a k&ouml;vetelm&eacute;nyeknek megfelelő f&aacute;jlok vagy mapp&aacute;k megkeres&eacute;s&eacute;hez &eacute;s megjelen&iacute;t&eacute;s&eacute;hez. Szűrheti a jelen mapp&aacute;ban tal&aacute;lhat&oacute; f&aacute;jlokat vagy mapp&aacute;kat, vagy ha pontosabb keres&eacute;si eredm&eacute;nyeket szeretne kapni, v&eacute;grehajthat az &ouml;sszes almapp&aacute;ra kiterjedő &ouml;sszetett keres&eacute;st is. </p>
<h4>F&aacute;jlok, illetve mapp&aacute;k keres&eacute;se az aktu&aacute;lis mapp&aacute;ban:</h4>

<ol>
<li>A File Stationnel menjen abba a mapp&aacute;ba, ahol a keresni k&iacute;v&aacute;nt tartalom tal&aacute;lhat&oacute;.</li>
<li>A jobb felső sarokban l&aacute;that&oacute; <b>Szűrő</b> mezőben adjon meg egy kulcssz&oacute;t; az ablak főter&uuml;let&eacute;n megjelennek a szűrt tal&aacute;latok.</li>
</ol>
<h4>&Ouml;sszetett keres&eacute;s v&eacute;grehajt&aacute;sa:</h4>
<ol>
<li>A File Stationnel menjen abba a mapp&aacute;ba, ahol a keresni k&iacute;v&aacute;nt tartalom tal&aacute;lhat&oacute;.</li>
<li>Az &ouml;sszetett keresőmen&uuml; felfed&eacute;s&eacute;hez kattintson a jobb felső sarokban a <b>Szűrő</b> mező mellett tal&aacute;lhat&oacute; nagy&iacute;t&oacute; ikonra.</li>

<li>Adja meg a k&iacute;v&aacute;nt adatokat, vagy a leg&ouml;rd&uuml;lő men&uuml;k seg&iacute;ts&eacute;g&eacute;vel v&aacute;lasszon a k&ouml;vetkező keres&eacute;si felt&eacute;telek k&ouml;z&uuml;l:</li>
<ul>
<li><b>Kulcssz&oacute;</b>: Kulcssz&oacute; alapj&aacute;n keresheti a kulcssz&oacute;nak megfelelő nevű f&aacute;jlokat &eacute;s mapp&aacute;kat.<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>Helyettes&iacute;tő karaktereket is haszn&aacute;lhat [*] (nulla vagy t&ouml;bb karaktert) &eacute;s [?] (egy tetszőleges karaktert) a kulcsszavakban. P&eacute;ld&aacute;ul az [&eacute;<span class="note_content">*</span>s] kifejez&eacute;s az [&eacute;<span class="note_content">r&eacute;</span>s], az [&eacute;<span class="note_content">rvel&eacute;</span>s] &eacute;s az [&eacute;s] sz&oacute;t is jelentheti.</li>
<li>T&ouml;bb kulcssz&oacute; elv&aacute;laszt&aacute;s&aacute;ra haszn&aacute;lhat vesszőket (,). P&eacute;ld&aacute;ul az [<span class="note_content">&eacute; les</span>] kulcsszavak az [<span class="note_content">&eacute; </span><span class="note_content">les</span>&iacute;t], az [<span class="note_content">&eacute;</span>s ez nem <span class="note_content">les</span>], az [<span class="note_content">&eacute;</span>rtve <span class="note_content">les</span>zek] &eacute;s az <span class="note_content">&eacute;les</span>s&eacute;g kifejez&eacute;seket is helyettes&iacute;thetik.</li>
<li>A kulcsszavak el&eacute; &eacute;s m&ouml;g&eacute; dupla felső id&eacute;zőjelet [&quot;] felv&eacute;ve pontos tal&aacute;latra kereshet. P&eacute;ld&aacute;ul az [<span class="note_content">&quot;a k&eacute;p&quot;</span>] kifejez&eacute;s jelentheti azt, hogy [<span class="note_content">a k&eacute;p</span>ernyőv&eacute;dő], de nem jelentheti azt, hogy [<span class="note_content">a</span> f&eacute;ny<span class="note_content">k&eacute;p</span>].</li>
</ul>
</div>
</li>


<li><b>Hely</b>: Az &ouml;sszetett keres&eacute;s tartom&aacute;ny&aacute;nak &eacute;s m&eacute;lys&eacute;g&eacute;nek be&aacute;ll&iacute;t&aacute;s&aacute;hoz v&aacute;lasszon a leg&ouml;rd&uuml;lő men&uuml;ből. B&aacute;rmely m&aacute;s felsorolt megosztott mapp&aacute;b&oacute;l v&aacute;lasztva is testreszabhatja a keres&eacute;si tartom&aacute;nyt.</li>
<li><b>F&aacute;jlt&iacute;pus</b>: A <b>Kiterjeszt&eacute;s</b> elem seg&iacute;ts&eacute;g&eacute;vel a keres&eacute;st adott f&aacute;jlt&iacute;pusokra korl&aacute;tozhatja; a <b>B&aacute;rmely mappa</b> v&aacute;laszt&aacute;s&aacute;val a keres&eacute;st mapp&aacute;kra szűk&iacute;ti le.</li>
<li><strong>D&aacute;tum</strong>: V&aacute;lassza ki a <b>M&oacute;dos&iacute;tott d&aacute;tum</b>, <b>L&eacute;trehoz&aacute;s d&aacute;tuma</b> vagy az <strong>Utols&oacute; hozz&aacute;f&eacute;r&eacute;s</strong> elemet, majd a megfelelő d&aacute;tumokkal rendelkező f&aacute;jlok megkeres&eacute;s&eacute;hez v&aacute;lasszon ki egy d&aacute;tumot a napt&aacute;rb&oacute;l.</li>
<li><b>M&eacute;ret (MB):</b>: V&aacute;lasszon az <b>egyenlő</b>, <b>nagyobb, mint</b> &eacute;s <b>kevesebb, mint</b> elemek k&ouml;z&uuml;l, majd adja meg a keres&eacute;shez haszn&aacute;lni k&iacute;v&aacute;nt f&aacute;jlm&eacute;retet. (Az <strong>egyenlő</strong> v&aacute;laszt&aacute;sakor az eredm&eacute;nyek k&ouml;zt a megk&ouml;zel&iacute;tőleg a megadott m&eacute;retnek megfelelő m&eacute;retű f&aacute;jlok fognak szerepelni.)</li>
<li><b>Tulajdonos/Csoport</b>: V&aacute;lasszon a <b>Tulajdonos</b> &eacute;s a <b>Csoport</b> lehetős&eacute;g k&ouml;z&uuml;l, majd a leg&ouml;rd&uuml;lő men&uuml;ből jel&ouml;lje ki, mely tulajdonoshoz vagy csoporthoz k&ouml;thető f&aacute;jlokat vagy mapp&aacute;kat k&iacute;v&aacute;nja megtal&aacute;lni.<div class="section">
<h4>Megjegyz&eacute;s:</h4>
<ul>
<li>R&eacute;szletes keres&eacute;shez meg kell adnia a <b>Helyet</b> &eacute;s legal&aacute;bb egy m&aacute;sik keresőkifejez&eacute;st.</li>
<li>Ha egy ISO mappa vagy egy t&aacute;voli mappa egy indexelt megosztott mapp&aacute;ra van telep&iacute;tve, a benne tal&aacute;lhat&oacute; f&aacute;jlokat nem lehet r&eacute;szletes keres&eacute;ssel megtal&aacute;lni.</li>
</ul>
</div>
</li>

<li>A keres&eacute;s ind&iacute;t&aacute;s&aacute;hoz kattintson a <b>Keres&eacute;s</b> elemre. A <b>Vissza&aacute;ll&iacute;t&aacute;s</b> elemre kattintva &uacute;jra megadhatja a keres&eacute;si szempontokat. Ha a keres&eacute;s v&eacute;get &eacute;r, a szempontoknak megfelelő f&aacute;jlokat a rendszer kilist&aacute;zza a File Station főablak&aacute;ban.</li>

</ol>
</body>
</html>
