<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Analyseur de stockage</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>G&eacute;rer les profils de rapport</h2>

<p>Vous pouvez cr&eacute;er et modifier des t&acirc;ches planifi&eacute;es pour g&eacute;n&eacute;rer des rapports d&apos;utilisation du volume &agrave; <b>Analyseur de stockage</b> &gt; <b>Profil de rapport</b>.</p>


<h4>Pour cr&eacute;er une t&acirc;che de rapport&nbsp;:</h4>
<ol>
<li>Cliquez sur <b>Cr&eacute;er</b> pour ouvrir la fen&ecirc;tre de configuration.</li>
<li>Sp&eacute;cifiez un nom pour la t&acirc;che de rapport, et entrez l&apos;adresse e-mail &agrave; laquelle vous souhaitez envoyer le rapport.</li>
<li>S&eacute;lectionnez un ou plusieurs types de rapport que vous souhaitez g&eacute;n&eacute;rer.</li>
<li>Effectuez l&apos;une des actions suivantes pour sp&eacute;cifier une heure pour la g&eacute;n&eacute;ration de rapports :</li>
<ul>
<li>Cochez <b>G&eacute;n&eacute;rer des rapports selon une planification</b> et sp&eacute;cifiez l&apos;heure si vous souhaitez que le syst&egrave;me analyse l&apos;utilisation de volume p&eacute;riodiquement.</li>
<li>Cochez <b>G&eacute;n&eacute;rer les rapports maintenant</b> si vous souhaitez d&eacute;marrer la t&acirc;che de rapport imm&eacute;diatement.</li>
</ul>
<li>Si n&eacute;cessaire, sp&eacute;cifiez certains utilisateurs ou dossiers partag&eacute;s &agrave; inclure afin de restreindre les rapports. (Veuillez remarquer que si vous souhaitez sp&eacute;cifier et g&eacute;n&eacute;rer des rapports sur les dossiers partag&eacute;s chiffr&eacute;s, assurez-vous que les partages chiffr&eacute;s ont &eacute;t&eacute; mont&eacute;s avant que la t&acirc;che de rapport ne soit ex&eacute;cut&eacute;e.)</li>
<li>Cliquez sur <b>Appliquer</b> pour enregistrer les param&egrave;tres.</li>
</ol>

<div class="section">
<h4>Remarque&nbsp;:</h4>
<ul>
<li>Appuyez sur <b>Entr&eacute;e</b>/<b>Retour</b> apr&egrave;s chaque adresse e-mail pour s&eacute;parer plusieurs adresses e-mail.</li>
<li>Appuyez sur <b>Entr&eacute;e</b>/<b>Retour</b> apr&egrave;s chaque utilisateur lorsque vous sp&eacute;cifiez les utilisateurs dont les fichiers seront list&eacute;s individuellement par groupes de fichiers.</li>
<li>Le rapport <b>Fichiers par groupe de fichiers</b> listera les types de fichiers suivants&nbsp;:<br> Audio, fichiers d&apos;image disque, documents, fichiers ex&eacute;cutables, images, vid&eacute;os, pages Web, fichiers zipp&eacute;s, autres</li>
<li>La section <b>Fichiers volumineux</b> du rapport liste les 500 fichiers les plus volumineux sur la page du rapport d&apos;utilisation, ou les 200 fichiers les plus volumineux sur la page de rapport compl&egrave;te.</li>

</ul>
</div>


<h4>Pour modifier une t&acirc;che de rapport&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez une t&acirc;che de rapport, et cliquez sur <b>Modifier</b>.</li>
<li>Cliquez sur les diff&eacute;rents onglets pour modifier les param&egrave;tres du rapport.</li>
</ol>

<h4>Pour supprimer une t&acirc;che de rapport&nbsp;:</h4>
<p>S&eacute;lectionnez une t&acirc;che de rapport depuis la liste et cliquez sur <b>Supprimer</b>.</p>

<h4>Pour afficher les rapports d&apos;historique&nbsp;:</h4>
<ol>
<li>S&eacute;lectionnez une t&acirc;che de rapport depuis la liste et cliquez sur <b>Supprimer</b> &gt; <b>Voir les rapports d&apos;historique</b>.</li>
<li>Dans la fen&ecirc;tre qui appara&icirc;t, cliquez sur une heure pour voir le rapport g&eacute;n&eacute;r&eacute; &agrave; ce moment.</li>
</ol>

<h4>Pour g&eacute;n&eacute;rer des rapports imm&eacute;diatement&nbsp;:</h4>
<p>S&eacute;lectionnez une t&acirc;che de rapport, cliquez sur <b>Rapport</b> et choisissez <b>G&eacute;n&eacute;rer les rapports maintenant</b> pour g&eacute;n&eacute;rer les rapports &agrave; la demande.</p>

<h4>Pour changer l&apos;emplacement o&ugrave; les rapports sont enregistr&eacute;s&nbsp;:</h4>
<ol>
<li>Cliquez sur <b>Param&egrave;tres</b>.</li>
<li>S&eacute;lectionnez un nouveau dossier de destination pour modifier l&apos;emplacement o&ugrave; les rapports sont enregistr&eacute;s.</li>
</ol>
<h4>Pour recueillir l&apos;historique d&apos;utilisation du volume avec une planification r&eacute;guli&egrave;re&nbsp;:</h4>
<p>Par d&eacute;faut, les donn&eacute;es d&apos;utilisation du volume sont recueillies chaque fois qu&apos;un rapport Utilisation de volume est g&eacute;n&eacute;r&eacute; et au d&eacute;marrage du syst&egrave;me. En plus des cas ci-dessus, vous pouvez opter pour une nouvelle planification pour recueillir les donn&eacute;es historiques de l&apos;utilisation du volume. Pour ce faire, cliquez sur <b>Param&egrave;tres</b> et cochez la case <b>Recueillir l&apos;historique d&apos;utilisation du volume selon une planification</b> et planifiez une heure.</p>
<div class="section">
<h4>Remarque&nbsp;:</h4>
<p>L&apos;historique collect&eacute; &agrave; l&apos;heure planifi&eacute;e ici sera principalement utilis&eacute; dans le but et comme source des tendances d&apos;utilisation dans la section <b>Utilisation du volume</b>. Lorsque cette option est activ&eacute;e, vous verrez un graphique lin&eacute;aire affichant les tendances d&apos;utilisation du volume et les modification dans le temps; sinon, un graphique &agrave; barres indiquant le pourcentage d&apos;utilisation actuel sera affich&eacute; &agrave; la place.</p>
</div>

<h4>Pour analyser une t&acirc;che de rapport&nbsp;:</h4>
<p>Double-cliquez sur la t&acirc;che de rapport souhait&eacute;e, ou cliquez simplement sur <b>Analyser cette t&acirc;che de rapport</b> (l&apos;ic&ocirc;ne <b>&gt;</b>) &agrave; c&ocirc;t&eacute; de la t&acirc;che de rapport souhait&eacute;e pour ouvrir sa page d&apos;analyse. Veuillez consulter <a href="view_reports.html">Voir l&apos;utilisation et les rapports</a>pour plus d&apos;informations.</p>

</body>
</html>
