<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>DSM S&uacute;g&oacute; - Adatv&eacute;delmi kezelőprogram</title>
<meta name="author" content="Synology Inc.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
<meta charset="utf-8">
</head>
<body>
<h1>Adatv&eacute;delmi kezelőprogram</h1>
<p>Az Adatv&eacute;delmi kezelőprogram a biztons&aacute;gi ment&eacute;s &eacute;s vissza&aacute;ll&iacute;t&aacute;s szak&eacute;rtője. A v&eacute;letlen t&ouml;rl&eacute;s, alkalmaz&aacute;s-&ouml;sszeoml&aacute;sok, adats&eacute;r&uuml;l&eacute;s &eacute;s v&iacute;rusok okozta adatveszt&eacute;s megakad&aacute;lyoz&aacute;sa &eacute;rdek&eacute;ben a v&aacute;llalatoknak adatv&eacute;delemre van sz&uuml;ks&eacute;g&uuml;k.</p>

<p>A &bdquo;<strong>pillanatfelv&eacute;tel</strong>&rdquo; egy adott időpontban l&eacute;trehozott m&aacute;solat, amelynek ugyanazon k&ouml;tet ad helyet, amelyen az adott időben felv&eacute;tel t&aacute;rgy&aacute;t k&eacute;pező adatok t&aacute;rol&aacute;sa t&ouml;rt&eacute;nt. A pillanatfelv&eacute;telek csup&aacute;n kis mennyis&eacute;gű t&ouml;bblet t&aacute;rhelyet foglalnak el, &eacute;s nincsenek hat&aacute;ssal a teljes&iacute;tm&eacute;nyre. </p>

<p>A pillanatfelv&eacute;teleknek k&ouml;sz&ouml;nhetően gyorsan vissza&aacute;ll&iacute;that&oacute; az adott k&ouml;tegen tal&aacute;lhat&oacute; adat az illető pillanatfelv&eacute;tel időpontj&aacute;ban megl&eacute;vő &aacute;llapotra, ami hasznosnak bizonyulhat, ha p&eacute;ld&aacute;ul egy felhaszn&aacute;l&oacute; v&eacute;letlen&uuml;l m&oacute;dos&iacute;t vagy t&ouml;r&ouml;l valamilyen adatot. R&aacute;ad&aacute;sul a felhaszn&aacute;l&oacute;k saj&aacute;t maguk vissza&aacute;ll&iacute;thatj&aacute;k a saj&aacute;t, megosztott mapp&aacute;ban t&aacute;rolt t&ouml;r&ouml;lt vagy m&oacute;dos&iacute;tott f&aacute;jljaikat a rendszergazda beavatkoz&aacute;sa n&eacute;lk&uuml;l.</p>

<p>Az Adatv&eacute;delmi kezelőprogram seg&iacute;t az &Ouml;n DiskStation term&eacute;k&eacute;n t&aacute;rolt pillanatfelv&eacute;telek kezel&eacute;s&eacute;ben &eacute;s monitoroz&aacute;s&aacute;ban.</p>

<p>Att&oacute;l f&uuml;ggően, hogy DiskStation, k&eacute;sz&uuml;l&eacute;ke milyen funkci&oacute;kat t&aacute;mogat, az <strong>Adatv&eacute;delmi kezelőprogram</strong> seg&iacute;t az al&aacute;bbi műveletek v&eacute;grehajt&aacute;s&aacute;ban:</p>
<ul>
	<li>Pillanatfelv&eacute;telek k&eacute;sz&iacute;t&eacute;se <strong>megosztott mapp&aacute;kr&oacute;l*</strong> &eacute;s <strong>iSCSI LUN-okr&oacute;l</strong>, illetve a pillanatfelv&eacute;telek kezel&eacute;se.</li>
	<li><strong>&Uuml;temezett pillanatfelv&eacute;telek</strong> &eacute;s <strong>megőrz&eacute;si be&aacute;ll&iacute;t&aacute;sok</strong> konfigur&aacute;l&aacute;sa. Ezek a be&aacute;ll&iacute;t&aacute;sok meghat&aacute;rozz&aacute;k a pillanatfelv&eacute;telek k&eacute;sz&iacute;t&eacute;s&eacute;nek, megőrz&eacute;s&eacute;nek &eacute;s/vagy elt&aacute;vol&iacute;t&aacute;s&aacute;nak idej&eacute;t &eacute;s m&oacute;dj&aacute;t.</li>
	<li>Pillanatfelv&eacute;tellel kapcsolatos esem&eacute;nyekre vonatkoz&oacute; napl&oacute;f&aacute;jlok megtekint&eacute;se.</li>
</ul>

<p>_____<br/> <strong>*</strong> Pillanatfelv&eacute;telek k&eacute;sz&iacute;t&eacute;se megosztott mapp&aacute;kr&oacute;l csak abban az esetben lehets&eacute;ges, ha t&aacute;rhelye <strong>Btrfs</strong> f&aacute;jlrendszert haszn&aacute;l.</p>

</body>
</html>