<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Centrum protokolů</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Hled&aacute;n&iacute; protokolů</h2>
<p>Na str&aacute;nce <strong>Centrum protokolů</strong> &gt; <strong>Hled&aacute;n&iacute; protokolů</strong> můžete zobrazovat, vyhled&aacute;vat a&nbsp;exportovat protokoly. </p>

<h4>Postup hled&aacute;n&iacute; protokolů:</h4>

<ol>
<li>Na kartě <strong>M&iacute;stn&iacute;</strong> nebo <strong>Z&nbsp;dal&scaron;&iacute;ch serverů </strong> můžete volit mezi zobrazov&aacute;n&iacute;m m&iacute;stn&iacute;ch syst&eacute;mov&yacute;ch protokolů nebo protokolů z&nbsp;jin&yacute;ch zař&iacute;zen&iacute;.
<li>V&nbsp;př&iacute;padě potřeby můžete použ&iacute;t možnost <strong>Nejnověj&scaron;&iacute; protokoly</strong> nebo pomoc&iacute; možnosti <strong>Otevř&iacute;t archiv protokolů</strong> otevř&iacute;t st&aacute;vaj&iacute;c&iacute; archiv protokolu.
<li>V&nbsp;rozev&iacute;rac&iacute; nab&iacute;dce hled&aacute;n&iacute; můžete zadat n&aacute;sleduj&iacute;c&iacute; krit&eacute;ria v&nbsp;z&aacute;vislosti na situaci:
  <ul>
  <li><b>Kl&iacute;čov&eacute; slovo</b>: Zadejte kl&iacute;čov&eacute; slovo pro vyhled&aacute;n&iacute; zpr&aacute;v protokolu, kter&eacute; obsahuj&iacute; odpov&iacute;daj&iacute;c&iacute; kl&iacute;čov&eacute; heslo.
  	<div class="section">
	<h4>Pozn&aacute;mka:</h4>
	<p>V&nbsp;poli pro kl&iacute;čov&eacute; slovo můžete při hled&aacute;n&iacute; použ&iacute;t běžn&yacute; v&yacute;raz jako [<strong>*</strong>] (zastupuje jak&yacute;koli počet libovoln&yacute;ch znaků) nebo [<strong>?</strong>] (zastupuje jeden libovoln&yacute; znak). Např&iacute;klad formule [p<span class="note_head">*</span>a] může zastupovat slova [p<span class="note_head">r&aacute;v</span>a], [p<span class="note_head">oruch</span>a] nebo [pa].</p>
	</div>
  </li>
  <li><strong>Rozsah dat: </strong>Vyhled&aacute;vejte protokoly podle zadan&eacute;ho rozsahu data.
  <li><b>&Uacute;roveň</b>: Vyhled&aacute;vejte protokoly podle zadan&eacute; &uacute;rovně.</li>
  <li><b>N&aacute;zev hostitele</b>: Vyhled&aacute;vejte protokoly podle zadan&eacute;ho n&aacute;zvu hostitele.</li>
  <li><b>Program</b>: Vyhled&aacute;vejte protokoly podle zadan&eacute;ho n&aacute;zvu programu.</li>
  <li><b>Kategorie</b>: Vyhled&aacute;vejte protokoly podle zadan&eacute; kategorie programu.</li>
  </ul>
<li>Kliknut&iacute;m na možnost <strong>Hledat</strong> vyhled&aacute;te protokoly, kter&eacute; odpov&iacute;daj&iacute; zadan&yacute;m krit&eacute;ri&iacute;m.</li>
</ol>

<h4>Postup exportov&aacute;n&iacute; protokolů:</h4>

<ol>
<li>Klikněte na &scaron;ipku vedle možnosti <strong>Export</strong>.</li>
<li>Pomoc&iacute; možnosti <strong>HTML</strong> nebo <strong>CSV</strong> st&aacute;hnete protokoly pomoc&iacute; požadovan&eacute;ho form&aacute;tu.</li>
</ol>

<div class="section">
<h4>Pozn&aacute;mka:</h4>
<ul>
<li>K&oacute;dov&aacute;n&iacute; znaků exportovan&eacute;ho protokolu CSV je UTF-8. Bude nutn&eacute; otevř&iacute;t soubor pomoc&iacute; programu, kter&yacute; podporuje k&oacute;dov&aacute;n&iacute; znaků UTF-8. </li>
</ul>
</div>

</body></html>
