 <!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Cr&eacute;er un volume - Aide Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="This article walks you through the steps to create a volume on eCore Server using Storage Manager.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h2>Cr&eacute;er un volume</h2>

<p>Cet article explique comment cr&eacute;er un volume sur votre DiskStation. Lors de la cr&eacute;ation d'un nouveau volume, vous pouvez choisir une des m&eacute;thodes suivantes :</p>

<ul>
  <li><b>Rapide :</b> C'est la meilleure option pour les d&eacute;butants. Choisissez cette m&eacute;thode si vous voulez optimiser automatiquement la capacit&eacute; et la performance de stockage sans vous inqui&eacute;ter des aspects techniques tels que les niveaux RAID. </li>

<li><b>Personnalis&eacute;&nbsp;:</b> Pour les utilisateurs avanc&eacute;s qui veulent contr&ocirc;l&eacute;s les plus fins aspects de cr&eacute;ation de volume tels que les types RAID et l'allocation de capacit&eacute;.  Cette option prend en charge les diff&eacute;rents types RAID, vous permets de cr&eacute;er un seul ou plusieurs volumes et de fournir des options pour allouer des quantit&eacute;s sp&eacute;cifiques de capacit&eacute; pour chaque volume (uniquement lors de la cr&eacute;ation de plusieurs volumes sur RAID).
</li>
</ul>

<div class="section">
<h4>Volumes uniques ou multiples sur RAID?</h4>
<p>Lors de la cr&eacute;ation d'un volume avec un mode personnalis&eacute;, vous pouvez choisir une des options suivantes :</p>
<ul>
  <li><b>Volume unique sur RAID</b>
    <ul>
      <li>Cr&eacute;er un volume unique en utilisant toute la capacit&eacute; disponible des disques durs s&eacute;lectionn&eacute;s.</li>
      <li>Offre de meilleures vitesses et performances.</li>
      <li>Prend en charge diff&eacute;rent types de RAID.</li>
    </ul>
  </li>
  <li><b>Volumes multiples sur RAID</b>
    <ul>
      <li>Vous permet de cr&eacute;er des volumes multiples sur un groupe de disques.</li>
      <li>Prend en charge l&rsquo;allocation de quantit&eacute;s sp&eacute;cifiques de capacit&eacute; &agrave; chaque volume.</li>
      <li>Offre une plus grande souplesse de gestion du stockage.</li>
      <li>Prend en charge diff&eacute;rent types de RAID.</li>
    </ul>
  </li>
</ul>
</div>


<div class="section">
<h4>Avant de commencer :</h4>
<ul>
<li>Avant de commencer, assurez-vous qu'il n'y a aucune donn&eacute;es importantes sur les disques durs. Toutes les donn&eacute;es existantes seront effac&eacute;es au cours du processus de cr&eacute;ation.</li>
<li>Allez &agrave; la page <B>HDD/SSD</B> et assurez-vous que le statut de chaque disque dur est <B>Normal</B> ou <B>Non initialis&eacute;</B>.</li>
</ul>
</div>


<h4>Pour cr&eacute;er un volume&nbsp;:</h4>
<ol>
<li>Ouvrez <b>Storage Manager</b>.</li>
<li>Allez &agrave; <B>Volume</B> et cliquez sur <B>Cr&eacute;er</B>.</li>
<li>Vous verrez appara&icirc;tre l&rsquo;assistant de cr&eacute;ation de volume. S&eacute;lectionnez <B>Rapide</B> ou <B>Personnalis&eacute;</B> selon vos besoins. Puis suivez les &eacute;tapes de l'assistant pour terminer la cr&eacute;ation du volume.</li>
</ol>

</body>
</html>
