<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Speicher-Analysator</title>
<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>Berichtsprofile verwalten</h2>

<p>Sie k&ouml;nnen geplante Aufgaben erstellen und &auml;ndern, um Berichte &uuml;ber die Volume-Auslastung auf dem <b>Speicher-Analysator</b> &gt; <b>Berichtsprofil</b> zu erzeugen.</p>


<h4>Erstellen eines Berichtsvorgangs:</h4>
<ol>
<li>Klicken Sie auf <b>Erstellen</b>, um den Assistenten zu &ouml;ffnen.</li>
<li>Legen Sie einen Namen f&uuml;r die neue Berichtsaufgabe fest, und geben Sie die E-Mail-Adresse ein, an die Sie den Bericht senden m&ouml;chten.</li>
<li>W&auml;hlen Sie einen oder mehrere Berichtstypen aus, die Sie erstellen m&ouml;chten.</li>
<li>F&uuml;hren Sie eine der folgenden Schritte aus, um eine Uhrzeit f&uuml;r die Erstellung von Berichten festzulegen:</li>
<ul>
<li>Aktivieren Sie <b>Berichte nach einem Zeitplan erstellen</b> und geben Sie die Uhrzeit an, wenn Sie m&ouml;chten, dass das System die Volume-Auslastung in regelm&auml;&szlig;igen Abst&auml;nden analysiert.</li>
<li>Aktivieren Sie <b>Berichte jetzt erstellen</b>, wenn Sie jetzt einen Berichtsvorgang manuell starten m&ouml;chten.</li>
</ul>
<li>Falls notwendig, geben Sie bestimmte Benutzer oder gemeinsame Ordner an, welche eingef&uuml;gt werden sollten, um die Berichte einzugrenzen. (Beachten Sie folgendes: Wenn Sie verschl&uuml;sselte Berichte und gemeinsame Ordner festlegen und erstellen m&ouml;chten, sollten Sie sicherstellen, dass die verschl&uuml;sselten Dateien angeh&auml;ngt werden, bevor der Berichtsvorgang ausgef&uuml;hrt wird.)</li>
<li>Klicken Sie auf <b>&Uuml;bernehmen</b>, um die Einstellungen zu speichern.</li>
</ol>

<div class="section">
<h4>Hinweis:</h4>
<ul>
<li>Dr&uuml;cken Sie nach jeder E-Mail-Adresse auf die <b>Eingabe</b>/<b>Zur&uuml;ck</b>-Taste, um mehrere E-Mail-Adressen zu trennen.</li>
<li>Dr&uuml;cken Sie nach jedem Benutzer auf die <b>Eingabe</b>/<b>Zur&uuml;ck</b>-Taste, wenn Sie Benutzer angeben, deren Dateien individuell nach Dateigruppen aufgelistet werden.</li>
<li>Der Bericht <b>Dateien nach Dateigruppe</b> listet die folgenden Dateitypen auf:<br> Audio, Disk-Image-Dateien, Dokumente, Ausf&uuml;hrbare Dateien, Bilder, Videos, Webseiten, gezippte Dateien, Sonstiges</li>
<li>Der Abschnitt <b>Gro&szlig;e Dateien</b> des Berichts listet die 500 gr&ouml;&szlig;ten Dateien auf der Verwendungsberichtsseite, oder die 200 gr&ouml;&szlig;ten Dateien auf der vollst&auml;ndigen Berichtsseite auf.</li>

</ul>
</div>


<h4>Bearbeiten eines Berichtsvorgangs:</h4>
<ol>
<li>W&auml;hlen Sie einen Berichtsvorgang aus der Liste aus und klicken Sie auf <b>Bearbeiten</b>.</li>
<li>Klicken Sie auf die einzelnen Registerkarten, um Einstellungen f&uuml;r diese Aufgabe zu &auml;ndern.</li>
</ol>

<h4>L&ouml;schen eines Berichtsvorgangs:</h4>
<p>W&auml;hlen Sie einen Berichtsvorgang aus der Liste aus, und klicken Sie auf <b>L&ouml;schen</b>.</p>

<h4>Historische Berichte anzeigen:</h4>
<ol>
<li>W&auml;hlen Sie einen Berichtsvorgang aus der Liste aus, und klicken Sie auf <b>Bericht</b> &gt; <b>Historische Berichte anzeigen</b>.</li>
<li>Klicken Sie im angezeigten Fenster auf einen Eintrag, um den zu diesem Zeitpunkt erstellten Bericht anzuzeigen.</li>
</ol>

<h4>Berichte sofort erstellen:</h4>
<p>W&auml;hlen Sie einen Berichtsvorgang aus der Liste aus, klicken Sie auf <b>Bericht </b> &gt; <b>Berichte jetzt erstellen</b>, um Berichte auf Abruf zu erstellen.</p>

<h4>&Auml;ndern, wo die Berichte gespeichert werden:</h4>
<ol>
<li>Klicken Sie auf <b>Einstellungen</b>.</li>
<li>W&auml;hlen Sie einen neuen Zielordner, um den Ort zu &auml;ndern, an dem die Berichte gespeichert werden.</li>
</ol>
<h4>Den Volume-Auslastungsverlauf nach einem regelm&auml;&szlig;igen Zeitplan erfassen:</h4>
<p>Die Daten der Volume-Auslastung werden standardm&auml;&szlig;ig jedes Mal bei der Erstellung eines Volume-Auslastungsberichts und beim Systemstart erfasst. Zus&auml;tzlich zu den obigen F&auml;llen, k&ouml;nnen Sie einen neuen Zeitplan auch einrichten, um die Daten des Auslastungsverlaufs zu erfassen. Hierzu klicken Sie auf <b>Einstellungen</b>, und markieren Sie <b>Volume-Auslastungsverlauf nach einem Zeitplan sammeln</b>, und legen Sie einen Zeitpunkt fest.</p>
<div class="section">
<h4>Hinweis:</h4>
<p>Der zu diesem festgelegten Zeitpunkt erfasste Verlauf dient haupts&auml;chlich zur Bestimmung der Auslastungstrends im Abschnitt <b>Volume-Auslastung</b>. Wenn diese Option aktiviert ist, wird ein Liniendiagramm mit der Anzeige der Trends und zeitlichen Ver&auml;nderungen f&uuml;r die Volume-Auslastung angezeigt; falls nicht, erscheint ein Balkendiagramm, das stattdessen den aktuellen Auslastungsprozentsatz anzeigt.</p>
</div>

<h4>Analysieren eines Berichtsvorgangs:</h4>
<p>Doppelklicken Sie auf den gew&uuml;nschten Berichtsvorgangs oder klicken Sie einfach auf <b>Diesen Bericht analysieren</b> (das <b>&gt;</b>-Symbol) neben dem gew&uuml;nschten Berichtsvorgang, um seine Analyseseite zu &ouml;ffnen. In der Datei <a href="view_reports.html">Nutzung und Berichte</a> erhalten Sie weitere Informationen.</p>

</body>
</html>
