<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Text Editor</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h1>Text Editor</h1>
<p>Text Editor &egrave; un editor di codice e testo altamente versatile che consente di accedere e modificare rapidamente codici e file di testo su DiskStation proprio nel browser Web.</p>

<h3>Gestione dei file</h3>
<h4>Per creare nuovi file:</h4> 
<p>Fare clic su <b>File</b> e scegliere <b>Nuovo</b>. Appare una nuova scheda vuota con il titolo <b>Nuovo Documento.txt</b>.</p>

<h4>Per aprire file da Text Editor:</h4> 
<p>Basta fare clic su <b>File</b> e scegliere <b>Apri</b>. Viene visualizzata una finestra di dialogo ed &egrave; possibile selezionare un file con codifica dei caratteri specifica che deve essere aperta in una scheda. Se il file &egrave; gi&agrave; stato aperto, Text Editor mostrer&agrave; quel file nel suo stato corrente.</p> 

<h4>Per aprire file da File Station:</h4> 
<p>In File Station, basta fare clic con il tasto destro sul file selezionato e quindi fare clic su <b>Apri con Text Editor</b> nel menu contestuale. Se il file &egrave; gi&agrave; stato aperto, Text Editor mostrer&agrave; quel file nel suo stato corrente. Un altro modo per aprire un file &egrave; trascinare uno o pi&ugrave; file da File Station in Text Editor usando il cursore.</p><br><div class="section">
<p><b>Nota.</b></p>
<p>Con Text Editor non &egrave; possibile aprire un file di dimensioni maggiori a 10 MB.</p>
</div>

<h4>Per salvare file:</h4> 
<p>Basta fare clic su <b>File</b> e scegliere <b>Salva</b>. Se &egrave; un file esistente, sar&agrave; sovrascritto con i contenuti correnti. Se si vogliono salvare tutti i file aperti in una volta, &egrave; possibile andare su <b>File</b> &gt; <b>Salva tutto</b>. Se il file non ha ancora un nome (un nuovo file) o si &egrave; selezionato <b>File</b> &gt; <b>Salva come</b>, viene visualizzata una finestra di dialogo, che chiede il nome del file. &Egrave; possibile scegliere quindi la posizione, il nome del file e la codifica per salvare il file.</p>

<h4>Per chiudere i file:</h4> 
<p>Basta fare clic su <b>File</b> e scegliere <b>Chiudi</b>. Un altro modo per chiudere un file &egrave; fare clic sul pulsante Chiudi su ogni scheda. Se nel file ci sono dati non salvati, Text Editor chieder&agrave; sempre se si desidera chiudere senza salvare queste modifiche.</p>

</ul>

<div class="section">
<h4>Nota.</h4>
<p>&Egrave; possibile salvare i file con una codifica dei caratteri specifica per supportare lingue bidirezionali. &Egrave; possibile anche specificare una codifica quando si apre un file, in modo che Text Editor visualizzi il file correttamente.</p>
</div>

<h3>Modifica</h3>
<ul>
<li><strong>Operazioni standard</strong><br> Il controllo modifica supporta Annulla, Ripeti e Seleziona tutto. Queste operazioni si possono trovare nella maggior parte degli editor e vengono eseguite in modo molto simile. &Egrave; possibile eseguire queste operazioni selezionando la corrispondente voce del menu in <b>Modifica</b>. Inoltre, come impostazione predefinita le opzioni Taglia, Copia e Incolla sono disponibili nel menu contestuale del browser.</li>

<li><strong>Capoverso rientrato</strong><br> Far rientrare il testo &egrave; un&apos;operazione comune quando si modifica il codice sorgente. Il rientro &egrave; in aggiunta allo spazio bianco extra all&apos;inizio di una riga per separare i blocchi di testo, aggiungendo una gerarchia. Normalmente quando si modifica, premendo il tasto Tab si inserir&agrave; un carattere di tabulazione nella posizione corrente. Tuttavia, se &egrave; selezionato del testo, premendo il tasto Tab si aggiunger&agrave; spazio bianco extra all&apos;inizio di ciascun riga che ha del testo selezionato, consentendo di rientrare l&apos;intero blocco di testo selezionato in un&apos;unica volta. Premendo Shift e Tab insieme si rimuover&agrave; il rientro.</li>

<li><strong>Sovrascrivere</strong><br> &Egrave; possibile attivare e disattivare la sovrascrittura premendo il tasto Ins. Quindi, invece di inserire i caratteri con il cursore, sostituirli. Il cursore visualizzato cambier&agrave; forma in base allo stato di sovrascrittura.</li>

<li><strong>Modifica modalit&agrave; colonna</strong><br> Un modo speciale per modificare i file &egrave; la modifica della modalit&agrave; colonna. Ci&ograve; significa che il testo pu&ograve; essere selezionato nelle colonne, piuttosto che nelle righe. Per avviare una selezione della modalit&agrave; colonna, premere il tasto Alt quando si seleziona il testo, spostando il cursore verso l&apos;alto o il basso a seconda delle necessit&agrave;. Quando il testo &egrave; selezionato in questa cosiddetta modalit&agrave; colonna, digitando cambier&agrave; ogni colonna di caratteri selezionata nel carattere digitato.</li>
</ul>


<h3>Ricerca</h3>
<ul>
<li><strong>Ricerca normale</strong><br> &Egrave; possibile ricercare il testo come nella maggior parte dei programmi usando la finestra Trova. &Egrave; possibile aprire questa finestra selezionando <b>Cerca</b> &gt; <b>Trova</b>. Questa finestra si trova sempre sulla parte alta del testo e non pu&ograve; continuare la modifica del testo se &egrave; aperta. Nel campo di ricerca, digitare il testo che si desidera trovare.</li>

<li><strong>Sostituzione</strong><br> &Egrave; possibile trovare e sostituire il testo come nella maggior parte dei programmi usando la finestra Sostituisci. &Egrave; possibile aprire questa finestra selezionando <b>Cerca</b> &gt; <b>Sostituisci</b>. <b>Sostituisci tutto</b> sostituir&agrave; tutte le occorrenze della query con il testo di sostituzione. </li>

<li><strong>Maiuscole/minuscole</strong><br> Per rispettare esattamente lo stesso utilizzo di maiuscole/minuscole della query. Se non ha il segno di spunta, la ricerca non fa distinzione tra lettere minuscole e maiuscole.</li>

<li><strong>Solo parola intera</strong><br> Porter&agrave; a un risultato solo se la corrispondenza consiste di un&apos;intera parola, non parte di essa. Ad esempio, se si cerca la parola &quot;esame&quot; con <strong>Solo parola intera</strong>, si trover&agrave; solo &quot;esame&quot;, invece di &quot;esempio&quot;.</li>

<li><strong>Espressione regolare</strong><br> La query sar&agrave; gestita come un&apos;espressione regolare.</li>
</ul>


<div class="section">
<h4>Cos&apos;&egrave; un&apos;espressione regolare?</h4>
<p>Un&apos;espressione regolare &egrave; una sequenza di caratteri che forma un modello di ricerca per una tecnica con forte risparmio energetico. Un utilizzo molto semplice di un&apos;espressione regolare individuer&agrave; la stessa parola pronunciata in due modi diversi in un editor di testo, ad esempio M[ea]rry.</p>
</div>

<h3>Configuratore stile</h3>
<p>Il configuratore stile &egrave; usato innanzitutto per controllare l&apos;aspetto del testo in Text Editor.<br> L&apos;elenco a discesa in basso a destra contiene tutte le lingue di programmazione supportate che possono essere modificare lo stile per aiutare a creare un ambiente di codifica idoneo.</p>

<h3>Preferenze</h3>
<ul>
<li><strong>Mostra caratteri invisibili</strong><br> Se con il segno di spunta spazi, tabulazioni, righe nuove o caratteri di ritorno saranno visualizzati.</li>

<li><strong>Mostra guide capoverso rientrato</strong><br> Se con il segno di spunta, le guide del capoverso rientrato saranno visualizzate. &Egrave; utile per allineare codici nella lingua di codifica.</li>

<li><strong>Evidenzia linea attuale</strong><br> Se con il segno di spunta, la linea in cui &egrave; presente il segno di omissione sar&agrave; tracciata con un colore di sfondo speciale.</li>

<li><strong>Evidenzia parola selezionata</strong><br> Se con il segno di spunta, tutte le parole (non parziali) in uno stesso file di testo che corrispondono alla parola selezionata saranno automaticamente selezionate.</li>

<li><strong>Mostra numeri di linea</strong><br> Se con il segno di spunta, i numeri di linea saranno visualizzati.</li>

<li><strong>Abilita codice piegatura</strong><br> Se con il segno di spunta, alcune linee del codice possono essere nascoste in base a determinati tratti. Questa funzione &egrave; adatta ai linguaggi strutturati come C++ o XML. Se <b>Nascondi automaticamente widget aperti</b> ha il segno di spunta, alcune linee dei codici saranno piegate automaticamente. &Egrave; possibile anche di contrassegnare solo la parentesi di apertura o la parentesi di apertura e chiusura con widget aperti.</li>  

<li><strong>Word Wrap</strong><br> Specifica se il testo &egrave; sovrapposto al bordo della finestra o su un numero di colonna specifico senza inserire un rientro forzato.</li>

<li><strong>Aggiungi chiusura caratteri automatica</strong><br> Se con il segno di spunta, le parentesi di chiusura (caratteri) saranno aggiunte automaticamente nei codici.</li>

<li><strong>Inserisci spazi invece di tabulazioni</strong><br> Se con i segni di spunta, premendo il tasto Tab si inseriranno i caratteri di spazio invece di un carattere di tabulazione. <b>Larghezza tabulazione</b> pu&ograve; essere definita dal numero di caratteri in <b>Preferenze</b> &gt; <b>Font e colore</b>.</li>

<li><strong>Codifica predefinita</strong><br> La codifica predefinita &egrave; utilizzata per salvare i file con una codifica dei caratteri specifica per supportare lingue bidirezionali. &Egrave; possibile anche specificare una codifica quando si apre un file, in modo che Text Editor visualizzi il file correttamente.</li>

<li><strong>Font e Colore</strong><br> <b>Larghezza tabulazione</b>, <b>Dimensioni font</b> e <b>Tema</b> possono essere personalizzati in base alle proprie preferenze. <b>Larghezza tabulazione</b> &egrave; definita dal numero di caratteri di spazio.</li>
</ul>

<div class="section">
<h4>Formati file supportati</h4>
<p>Text Editor supporta solo file di testo semplici. I file di testo con formattazione ricca come *.doc e *.pdf non sono supportati.</p>
</div>

</body>
</html>
