<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>Portal de aplicativo</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Portal de aplicativo</h1>
<p>Com o Portal de aplicativo, voc&ecirc; pode definir as configura&ccedil;&otilde;es de conex&atilde;o de v&aacute;rios aplicativos, permitindo acessar e executar esses aplicativos nas guias do navegador independente ou janelas. </p>
<p>Por exemplo, voc&ecirc; pode abrir o File Station digitando <strong>http://:diskstation:5000/file/</strong> em seu navegador da web. As configura&ccedil;&otilde;es de conex&atilde;o dispon&iacute;veis incluem aliases personalizados, portas HTTP e HTTPS. Para localizar essas configura&ccedil;&otilde;es, v&aacute; para <strong>Painel de Controle</strong> &gt; <strong>Portal de aplicativos</strong>.</p>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<p>O Portal de aplicativos permite que voc&ecirc; edite configura&ccedil;&otilde;es de acesso para v&aacute;rios aplicativos, como Audio Station, Download Station, Surveillance Station, Video Station, File Station, entre outros.</p>
</div>


<h2><a name="session"></a>Alias personalizado</h2>
<p>Com um alias personalizado, um aplicativos como o File Station pode ser aberto digitando um endere&ccedil;o como <b>http://:diskstation:5000/file/</b> em seu navegador da web. </p>
<h4>Para habilitar um alias personalizado:</h4>
<ol>
<li>Selecione um aplicativo.</li>
<li>Clique em <b>Editar</b>.</li>
<li>Na janela que aparece, desmarque <b>Habilitar alias personalizado</b>.</li>
<li>Especifique um alias personalizado.</li>
</ol>

<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>Voc&ecirc; pode marcar a caixa de sele&ccedil;&atilde;o <strong>Redirecionar de</strong> e usar um alias curto, f&aacute;cil de lembrar para acessar o aplicativo selecionado. </li>
<li>A seguir est&atilde;o os respectivos aliases padr&atilde;o dos aplicativos, Audio Station, Download Station, Surveillance Station, Video Station e File Station: <strong>audio</strong>, <strong>download</strong>, <strong>cam</strong>,<strong> video</strong>, <strong>file</strong>.</li>
<li>Os nomes dos aliases n&atilde;o podem ser os mesmos daqueles reservados para o sistema, navegadores ou usados por outros aplicativos e seu n&uacute;mero de caracteres deve ser limitado de 2 a 20. </li>
<li>Os nomes dos aliases podem consistir em letras mai&uacute;sculas e min&uacute;sculas, caracteres num&eacute;ricos e dois caracteres especiais (-), (_), mas esses dois caracteres podem ser usados apenas para os outros caracteres, exceto para o primeiro e o &uacute;ltimo.
</li>
</ul>
</div>

<h2><a name="session"></a>Portas HTTP ou HTTPS personalizadas</h2>
<p>Com portas HTTP ou HTTPS personalizadas, um aplicativo pode ser aberto inserindo um endere&ccedil;o como <b>http://diskstation:7000</b> ou <b>http://diskstation:7001</b>.</p>
<h4>Para habilitar uma porta HTTP ou HTTPS personalizada:</h4>
<ol>
<li>Selecione um aplicativo.</li>
<li>Clique em <b>Editar</b>.</li>
<li>Na janela que aparece, marque <b>Ativar porta personalizada (HTTP)</b> ou <b>Ativar porta personalizada (HTTPS)</b>.</li>
<li>Especifique um n&uacute;mero de porta personalizada.</li></ol>
<div class="section">
  <h4>Observa&ccedil;&atilde;o:</h4>
<ol>
<li>A faixa de n&uacute;mero de porta pode ser de 1 a 65535, mas as portas a seguir devem ser exclu&iacute;das por serem reservadas para uso do sistema: 20, 21, 22, 23, 25, 80, 110, 137, 138, 139, 143, 199, 443, 445, 515, 543, 548, 587, 873, 993, 995, 3306, 3689, 5000, 5001, 5005, 5006, 5335, 5432, 6881, 8080, 7000, 7001, 8081, 9997, 9998, 9999, 50001, 50002, portas padr&atilde;o eMule: 4662 (TCP), 4672(UDP) e intervalo de portas padr&atilde;o para FTP: a faixa atual pode variar dependendo dos modelos diferentes.</li>
</ol>
</div>
</body> </html>
