<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<title>Conectar ao VPN - Ajuda do Synology DSM</title>
<meta name="author" content="Synology Inc.">
<meta name="description" content="Turn your DiskStation into a VPN client and create profiles to connect your DiskStation to a VPN server.">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>
<h1>Conectar ao VPN</h1>
<p>&Eacute; poss&iacute;vel tornar o DiskStation facilmente em um cliente de VPN e se conectar a VPN servers (Redes Privadas Virtuais) existentes por meio dos protocolos PPTP, OpenVPN ou L2TP/IPSec. Se voc&ecirc; tiver v&aacute;rios VPN servers, ser&aacute; poss&iacute;vel criar perfis VPN espec&iacute;ficos para cada servidor, para ativar e se conectar rapidamente a VPN servers diferentes com um simples clique.</p>


<div class="section">
<h4>O que &eacute; VPN?</h4>
<p>Um VPN ou rede privada virtual &eacute; uma solu&ccedil;&atilde;o para atender a necessidade de acessar com seguran&ccedil;a os recursos de sua rede privada a partir da Internet. Para empresas ou alguns indiv&iacute;duos que precisem ampliar as capacidades de redes em crescimento, o custo desse sistema de rede f&iacute;sica e seu suporte t&eacute;cnico aumentar&aacute; exponencialmente. Ao considerar o custo-benef&iacute;cio e as manuten&ccedil;&otilde;es de longo prazo, o VPN &eacute; uma solu&ccedil;&atilde;o inteligente e cada vez mais atraente. Com a criptografia e outros mecanismos de seguran&ccedil;a, a tecnologia VPN permite que os membros de empresas acessem facilmente a rede central da empresa e use seus recursos como na LAN. Os indiv&iacute;duos tamb&eacute;m podem acessar os recursos em sua LAN local quando estiverem longe de casa.</p>
</div>


<div class="section">
<h4>Nota:</h4>
<ul>
<li> O DiskStation pode se conectar apenas a servidores OpenVPN que suportam t&uacute;neis tun-style na Layer 3.</li>
<li>Antes de instalar o pacote de VPN, verifique se voc&ecirc; tem um VPN server para se conectar. Para obter uma compatibilidade melhor, sugerimos a conex&atilde;o aos servi&ccedil;os VPN hospedados no DiskStation executando o pacote <strong>VPN Server</strong>. Para configurar outro DiskStation como um VPN server, consulte <b>Ajuda do DSM</b> &gt; <b>VPN Server</b> &gt; <b>Configurar VPN Server</b> para obter instru&ccedil;&otilde;es.</li>
</ul>
</div>


<h4>Para criar perfis de VPN:</h4>
<ol>
<li>V&aacute; at&eacute; <b>Painel de controle</b> &gt; <b>﻿Rede</b>.</li>

  
<li>Na guia <b>Interface de Rede,</b> clique em <b>Criar</b> e escolha <b>Criar perfil de VPN</b>.</li>

  
<li>Ao criar um novo perfil VPN, &eacute; poss&iacute;vel selecionar um dos seguintes tipos de conex&atilde;o:
	<ul>
		<li><b>PPTP</b>: PPTP (Protocolo de tunelamento ponto a ponto) &eacute; uma solu&ccedil;&atilde;o VPN usada comumente e suportada pela maioria dos clientes (incluindo Windows, Mac, Linux e dispositivos m&oacute;veis).</li>
		<li><b>OpenVPN</b>: A OpenVPN &eacute; uma solu&ccedil;&atilde;o de fonte aberta para a implementa&ccedil;&atilde;o do servi&ccedil;o VPN. Ela protege a conex&atilde;o VPN com o mecanismo de criptografia SSL/TLS.</li>
		<li><b>L2TP/IPSec</b>: O L2TP (Protocolo de tunelamento de camada 2) via IPSec fornece redes privadas virtuais com aumento de seguran&ccedil;a e &eacute; suportado pela maioria dos clientes (como Windows, Mac, Linux e dispositivos m&oacute;veis).</li>
	</ul>
</li>


<li>Consulte as se&ccedil;&otilde;es abaixo para obter instru&ccedil;&otilde;es para configurar qualquer um dos tr&ecirc;s tipos de conex&otilde;es VPN.</li>
</ul>
</ol>

<h4>Para criar um perfil PPTP:</h4>

  <ol>
  <li>Quando solicitado a escolher um m&eacute;todo de conex&atilde;o VPN, selecione <b>PPTP</b> e clique em <b>Avan&ccedil;ar</b>.</li>
  <li>Escolha um nome para o novo perfil, especifique o endere&ccedil;o do VPN server ao qual deseja se conectar e digite seu nome de usu&aacute;rio e senha do servidor. Clique em <b>Pr&oacute;ximo</b> para continuar.</li>

<div class="section">
<h4>Nota:</h4>

<ul>
<li>O nome de usu&aacute;rio, senha e endere&ccedil;o do VPN server devem ser fornecidos pelo administrador do servidor VPN.</li>
</ul>
</div>

  <li>Selecione um dos seguintes tipos de autentica&ccedil;&atilde;o no menu <b>Autentica&ccedil;&atilde;o</b> para proteger a senha do cliente VPN durante a autentica&ccedil;&atilde;o:
	<ul>
		<li><b>PAP</b>: A senha n&atilde;o ser&aacute; criptografada durante a autentica&ccedil;&atilde;o.</li>
		<li><b>CHAP</b>: A senha ser&aacute; criptografada usando CHAP (Challenge-Handshake Authentication Protocol).</li>
		<li><b>MS CHAP</b>: A senha ser&aacute; criptografada usando o Microsoft CHAP vers&atilde;o 1.</li>
		<li><b>MS CHAP v2</b>: A senha ser&aacute; criptografada usando o Microsoft CHAP vers&atilde;o 2.</li>
	</ul>
  </li>
  <li>Se voc&ecirc; selecionar <b>MS CHAP</b> ou <b>MS CHAP v2,</b> selecione um dos itens a seguir no menu <b>Criptografia</b> para criptografar a conex&atilde;o VPN:
	<ul>
		<li><b>Nenhum MPPE</b>: A conex&atilde;o VPN n&atilde;o ser&aacute; protegida com Microsoft Point to Point Encryption.</li>
		<li><b>Requer MPPE (40/128 bits)</b>: A conex&atilde;o VPN ser&aacute; protegida com Microsoft Point to Point Encryption de 40 ou 128 bits.</li>
		<li><b>MPPE m&aacute;ximo (128 bits)</b>: A conex&atilde;o VPN ser&aacute; protegida com a Criptografia Ponto a Ponto de 128 bits da Microsoft, que fornece o n&iacute;vel mais alto de seguran&ccedil;a.</li>
	</ul>
  </li>
    <div class="section">
    <h4>Nota:</h4>
  
    <ul>
    <li>As configura&ccedil;&otilde;es de autentica&ccedil;&atilde;o e criptografia devem ser id&ecirc;nticas &agrave;s configura&ccedil;&otilde;es especificadas no VPN server. Para mais detalhes, entre em contato com o administrador do VPN Server.</li>
    </ul>
    </div>
   
<li>Marque uma das caixas de sele&ccedil;&atilde;o a seguir, de acordo com suas necessidades:
	<ul>
		<li><b>Usar gateway padr&atilde;o na rede remota</b>: Habilite essa op&ccedil;&atilde;o para encaminhar o tr&aacute;fego da rede do DiskStation para o VPN server especificado.</li>
		<li><b>Permite que outros dispositivos da rede se conectem atrav&eacute;s da conex&atilde;o de Internet do servidor Synology</b>: Habilite essa op&ccedil;&atilde;o para permitir que os dispositivos da rede que estejam na mesma rede local que seu DiskStation para se conectar ao mesmo VPN server.</li>
		<li><b>Reconectar quando a conex&atilde;o VPN for perdida</b>: Se a conex&atilde;o VPN for perdida inesperadamente, o sistema tentar&aacute; restabelecer a conex&atilde;o cinco vezes, uma vez a cada 30 segundos.</li>
	</ul>
</li>

<li>Clique em <b>Aplicar</b>.</li>
</ol>
<h4>Para criar um perfil OpenVPN:</h4>
<ol>
<li>Quando solicitado a escolher um m&eacute;todo de conex&atilde;o VPN, selecione <b>OpenVPN</b> e clique em <b>Avan&ccedil;ar</b>.</li>
<li>Escolha um nome para o novo perfil, especifique o endere&ccedil;o do VPN server ao qual deseja se conectar e digite seu nome de usu&aacute;rio e senha do servidor.</li>
<li>
No campo <b>Certificado,</b> clique no bot&atilde;o <strong>Procurar</strong> para localizar e importar o arquivo de certificado (por exemplo: <b>ca.crt)</b> que foi exportado pelo VPN server. Clique em <b>Pr&oacute;ximo</b> para continuar.</li>

<div class="section">
<h4>Nota:</h4>

<ul>
<li>O nome de usu&aacute;rio, senha, endere&ccedil;o e certificado do VPN server devem ser fornecidos pelo administrador do VPN server.</li>
</ul>
</div>

<li>Marque uma das caixas de sele&ccedil;&atilde;o a seguir, de acordo com suas necessidades:
	<ul>
		<li><b>Habilitar compress&atilde;o no link VPN</b>: Habilite essa op&ccedil;&atilde;o para realizar a compress&atilde;o de dados antes da transfer&ecirc;ncia pelo VPN. Essa op&ccedil;&atilde;o pode aumentar a velocidade de transfer&ecirc;ncia, mas vai consumir mais recursos do sistema.</li>
		<li><b>Usar gateway padr&atilde;o na rede remota</b>: Habilite essa op&ccedil;&atilde;o para encaminhar o tr&aacute;fego da rede do DiskStation para o VPN server especificado.</li>
		<li><b>Permite que outros dispositivos da rede se conectem atrav&eacute;s da conex&atilde;o de Internet do servidor Synology</b>: Habilite essa op&ccedil;&atilde;o para permitir que os dispositivos da rede que estejam na mesma rede local que seu DiskStation para se conectar ao mesmo VPN server.</li>
		<li><b>Reconectar quando a conex&atilde;o VPN for perdida</b>: Se a conex&atilde;o VPN for perdida inesperadamente, o sistema tentar&aacute; restabelecer a conex&atilde;o cinco vezes, uma vez a cada 30 segundos.</li>
	</ul>
</li>
<li>Clique em <b>Aplicar</b>.</li>
</ol>

<h4>Para criar um perfil L2TP/IPSec:</h4>
<ol>
<li>Quando solicitado a escolher um m&eacute;todo de conex&atilde;o VPN, selecione <b>L2TP/IPSec</b> e clique em <b>Avan&ccedil;ar</b>.</li>
<li>Escolha um nome para o novo perfil, especifique o endere&ccedil;o do VPN server ao qual deseja se conectar e digite seu nome de usu&aacute;rio e senha do servidor. Tamb&eacute;m ser&aacute; necess&aacute;rio inserir a chave pr&eacute;-compartilhada do VPN server. Em seguida, clique em <strong>Avan&ccedil;ar</strong>.</li>

<div class="section">
<h4>Nota:</h4>

<ul>
<li>O nome de usu&aacute;rio, senha, endere&ccedil;o e chave pr&eacute;-compartilhada do VPN server devem ser fornecidos pelo administrador do VPN server.</li>
</ul>
</div>

<li>Selecione um dos seguintes tipos de autentica&ccedil;&atilde;o no menu <b>Autentica&ccedil;&atilde;o</b> para proteger a senha do cliente VPN durante a autentica&ccedil;&atilde;o:
	<ul>
		<li><b>PAP</b>: A senha n&atilde;o ser&aacute; criptografada.</li>
		<li><b>CHAP</b>: A senha ser&aacute; criptografada usando CHAP (Challenge-Handshake Authentication Protocol).</li>
		<li><b>MS CHAP</b>: A senha ser&aacute; criptografada usando o Microsoft CHAP vers&atilde;o 1.</li>
		<li><b>MS CHAP v2</b>: A senha ser&aacute; criptografada usando o Microsoft CHAP vers&atilde;o 2.</li>
	</ul>
</li>

<div class="section"><h4>Nota:</h4>
<ul>
	<li>As configura&ccedil;&otilde;es de autentica&ccedil;&atilde;o e criptografia devem ser id&ecirc;nticas &agrave;s configura&ccedil;&otilde;es especificadas no VPN server. Para mais detalhes, entre em contato com o administrador de seu VPN server.</li>
</ul>
</div>

<li>Marque uma das caixas de sele&ccedil;&atilde;o a seguir, de acordo com suas necessidades:
	<ul>
		<li><b>Usar gateway padr&atilde;o na rede remota</b>: Habilite essa op&ccedil;&atilde;o para encaminhar o tr&aacute;fego da rede do DiskStation para o VPN server especificado.</li>
		<li><b>Permite que outros dispositivos da rede se conectem atrav&eacute;s da conex&atilde;o de Internet do servidor Synology</b>: Habilite essa op&ccedil;&atilde;o para permitir que os dispositivos da rede que estejam na mesma rede local que seu DiskStation para se conectar ao mesmo VPN server.</li>
		<li><strong>O servidor est&aacute; por tr&aacute;s do dispositivo NAT</strong>: Por padr&atilde;o, o protocolo L2TP/IPSec n&atilde;o permite conex&otilde;es a um VPN server por dispositivos NAT. Ative essa op&ccedil;&atilde;o para contornar essa limita&ccedil;&atilde;o, permitindo que o DiskStation se conecte a um L2TP/IPSec VPN server por dispositivos NAT.</li>
		<li><b>Reconectar quando a conex&atilde;o VPN for perdida</b>: Se a conex&atilde;o VPN for perdida inesperadamente, o sistema tentar&aacute; restabelecer a conex&atilde;o cinco vezes, uma vez a cada 30 segundos.</li>
	</ul>
</li>
<li>
  Clique em <b>Aplicar</b>.
</li>
</ol>


<h4>Para conectar ou desconectar de um VPN server:</h4>

<ol>
<li>Selecione um perfil VPN.</li>
<li>Clique em <b>Conectar</b> ou <b>Desconectar.</b></li>

  
</ol>


<div class="section">
<h4>Nota:</h4>
<ul>
<li>Apenas um perfil pode ser conectado ao mesmo tempo.</li>
</ul>
</div>

<h4>Para modificar um perfil VPN:</h4>

<ol>
<li>Selecione um perfil VPN.</li>
<li>Clique em <strong>Editar</strong>.</li>

</ol>


</body>
</html>