<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
<title>DHCP Server</title>

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>

</head>
<body>
<h2>DHCP Server</h2>
<p>O DiskStation pode assumir a fun&ccedil;&atilde;o de servidor DHCP e atribuir endere&ccedil;os IP din&acirc;micos para clientes DHCP dentro de sua rede de &aacute;rea local.</p>

<h4>Para habilitar o servidor DHCP:</h4>
<ol>
<li>V&aacute; at&eacute; <strong>Painel de Controle</strong> &gt; <strong>Rede</strong> &gt; <strong>Interface de Rede</strong>.</li>
<li>Selecione uma interface de rede (como LAN) e clique em <strong>Editar</strong>.</li>
<li>V&aacute; para a guia <strong>DHCP Server</strong> e marque <b>Habilitar DHCP Server</b>.</li>
<li>Digite um valor no campo <b>Tempo de concess&atilde;o do endere&ccedil;o</b> para definir o tempo de concess&atilde;o do DHCP (em minutos) para os endere&ccedil;os IP atribu&iacute;dos aos clientes DHCP.</li>
<li>Digite o endere&ccedil;o DNS de seus clientes DHCP nos campos <b>DNS prim&aacute;rio</b> (obrigat&oacute;rio) e <b>DNS secund&aacute;rio</b> (opcional).</li>
<li>Defina o nome do dom&iacute;nio do servidor DHCP no campo <b>Nome de dom&iacute;nio</b> (opcional).</li>
<li>Clique em <b>OK</b>.</li>
</ol>
<h4>Para adicionar uma sub rede:</h4>
<ol>
<li>Clique em <b>Adicionar</b> e especifique as informa&ccedil;&otilde;es nas seguintes colunas:</li>
<ul>
<li><b>Habilitar</b>: Habilita ou desabilita a sub rede.</li>
<li><b>Iniciar</b>: O primeiro endere&ccedil;o IP da sub rede.</li>
<li><b>Fim</b>: O &uacute;ltimo endere&ccedil;o IP da sub rede.</li>
<li><b>M&aacute;scara de rede</b>: A m&aacute;scara de sub rede.</li>
<li><b>Gateway</b>: O gateway da sub rede.</li>
</ul>
<li>Clique em <b>OK</b>.</li>
</ol>


<div class="section">
<h4>Observa&ccedil;&atilde;o:</h4>
<ul>
<li>S&oacute; &eacute; poss&iacute;vel adicionar at&eacute; 32 subredes.</li>
</ul>
</div>



<h3>Clientes DHCP</h3>

<p>Para exibir uma liste de clientes DHCP e suas configura&ccedil;&otilde;es de rede, (como endere&ccedil;o MAC, endere&ccedil;o IP, nome de host e o tempo restante antes que a concess&atilde;o do DHCP expire), v&aacute; at&eacute; a aba <strong>Clientes DHCP</strong>.</p>


<h3>Reserva de DHCP</h3>

<p>Se voc&ecirc; quiser que um cliente receba sempre o mesmo endere&ccedil;o IP durante a renova&ccedil;&atilde;o da concess&atilde;o do DHCP, voc&ecirc; pode adicionar o cliente &agrave; lista de reserva do endere&ccedil;o.</p>

<h4>Para adicionar um cliente &agrave; lista de reserva de endere&ccedil;o:</h4>

<ul>
<li>Clique em <b>Adicionar</b>.</li>
<li>Especifique o endere&ccedil;o MAC do cliente, o endere&ccedil;o IP que voc&ecirc; deseja atribuir ao cliente e o nome de host do cliente. </li>
<li>Clique em <b>OK </b>para salvar suas configura&ccedil;&otilde;es.</li>
</ul>


</body>
</html>