<!DOCTYPE html>
<html class="img-no-display">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">

<link href="../../help.css" type="text/css" rel="stylesheet" />
<link href="../../scrollbar/flexcroll.css" type="text/css" rel="stylesheet" />
<script type="text/javascript" src="../../scrollbar/flexcroll.js"></script>
<script type="text/javascript" src="../../scrollbar/initFlexcroll.js"></script>
</head>
<body>

<h2><a name="session"></a>Seguran&ccedil;a</h2>

<p>Voc&ecirc; pode modificar as seguintes configura&ccedil;&otilde;es de seguran&ccedil;a em <strong>Painel de controle</strong> &gt; <strong>Seguran&ccedil;a</strong> &gt; <strong>Seguran&ccedil;a</strong> para as sess&otilde;es de navega&ccedil;&atilde;o do DSM:</p>

<ul>
<li><strong>Temporizador de logout (minutos):</strong> Os usu&aacute;rios ser&atilde;o automaticamente desconectados do DSM se ficarem inativos pelo per&iacute;odo especificado aqui. Digite qualquer valor entre 1 e 65535.</li>
<li><strong>Melhorar a compatibilidade do navegador ignorando a verifica&ccedil;&atilde;o de IP:</strong> Se voc&ecirc; acessar o DiskStation atrav&eacute;s de um proxy HTTP e encontrar encerramentos aleat&oacute;rios de sess&atilde;o, voc&ecirc; pode ativar esta op&ccedil;&atilde;o para ignorar a verifica&ccedil;&atilde;o de IP.</li>
<li><strong>Aprimorar a prote&ccedil;&atilde;o contra ataques de solicita&ccedil;&otilde;es entre sites forjadas:</strong> Essa op&ccedil;&atilde;o aumenta a prote&ccedil;&atilde;o do sistema contra os ataques de scripts de entre sites. Ela surtir&aacute; efeito no seu pr&oacute;ximo login no DSM.</li>
<li><strong>N&atilde;o permitir que o DSM seja inserido com o iFrame:</strong> Voc&ecirc; pode ativar essa op&ccedil;&atilde;o para restringir outros sites de inserir o DSM em outras p&aacute;ginas da web com o iFrame, impedindo assim certos tipos de ataques de sites mal-intencionados. Sites espec&iacute;ficos podem receber a permiss&atilde;o para inserir o DSM com o iFrame, clicando no bot&atilde;o <strong>Sites permitidos</strong>.</li>
</ul>


</body>
</html>

